{"id":1032,"date":"2022-05-18T16:52:08","date_gmt":"2022-05-18T16:52:08","guid":{"rendered":"https:\/\/why-what-who.com\/they-can-close-your-paypal-account-for-this-reason\/"},"modified":"2022-05-19T09:20:17","modified_gmt":"2022-05-19T09:20:17","slug":"they-can-close-your-paypal-account-for-this-reason","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/they-can-close-your-paypal-account-for-this-reason\/","title":{"rendered":"They can close your PayPal account for this reason"},"content":{"rendered":"<p>As we told you, PayPal has gained a lot of weight on the Internet in recent years.  Access services like <strong>pay online or send money to family and friends<\/strong> It&#8217;s really easy with one of their accounts for individuals, but this payment platform also gives us the opportunity to create a company account with which to manage the payments and sales we make to our customers.  For all this we do not need much, although strictly complying with all the requirements is essential, as we will see later.<\/p>\n<h2>The age of majority, a key PayPal requirement<\/h2>\n<p>To open a PayPal account for us, simply go to their website and click on the Create account button that we can find in the upper right part of the screen.  Once this is done, we will be able to create one of the two modalities that it offers completely free of charge, although if you are an individual you must choose the personal account in all cases.  Here we will find the first mandatory requirement to create an account: <strong>have a mobile phone number<\/strong>.  When entering it we will receive a verification SMS that we will have to enter, so make sure you have your smartphone nearby.<\/p>\n<p>Next, we will have to fill out a form with our name and surname, email and password, as well as the date of birth and our address.  Once all this is done, we will have access to use our PayPal account, adding a debit \/ credit card or a current account if we want.  At this point we may have overlooked an important thing (since the platform does not specify it for us).  The form to create an account asks for our date of birth, and it does so for one reason only: <strong>to create and use a PayPal account you must be of legal age<\/strong>.<\/p>\n<p>This, obviously, is an exclusive requirement to create an account, but as we have learned it is also affecting users who <strong>They created the account for several years as minors<\/strong>.  PayPal is requiring these users to validate their identity through the DNI, and when the platform verifies that the account was created by the user when he was a minor, it is completely restricting them.<\/p>\n<p><\/p>\n<p id=\"caption-attachment-1661844\" class=\"wp-caption-text\">Message for users who created the account being minors.<\/p>\n<h2>What to do if this happens to us<\/h2>\n<p>If this is your case, you should know that this PayPal account has &#8220;died&#8221;, <strong>so you can not operate in any way with it<\/strong>, either sending or receiving money.  This, of course, will not make us lose all the balance that we have in the account, but despite this, it is quite a nuisance.  According to the same email that you can see above, these users will be able to reimburse their clients with this balance, in addition to withdrawing the money without problems.<\/p>\n<p>To continue using PayPal will not be forced to <strong>create one new account<\/strong>although to do this you must first delete the financial data from your original account, since you cannot have them associated with two different accounts at the same time.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As we told you, PayPal has gained a lot of weight on the Internet in recent years. Access services like pay online or send money to family and friends It&#8217;s really easy with one of their accounts for individuals, but this payment platform also gives us the opportunity to create a company account with which [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1034,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1032"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1032"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1032\/revisions"}],"predecessor-version":[{"id":1053,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1032\/revisions\/1053"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1034"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1032"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1032"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1032"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}