{"id":1046,"date":"2022-05-19T09:06:25","date_gmt":"2022-05-19T09:06:25","guid":{"rendered":"https:\/\/why-what-who.com\/this-is-the-reality-of-apples-self-driving-car\/"},"modified":"2022-05-19T09:06:25","modified_gmt":"2022-05-19T09:06:25","slug":"this-is-the-reality-of-apples-self-driving-car","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/this-is-the-reality-of-apples-self-driving-car\/","title":{"rendered":"This is the reality of Apple&#8217;s self-driving car"},"content":{"rendered":"<h2>The Apple car, in strict secrecy<\/h2>\n<p>Thus, at Apple they are determined to launch the result of the titan project and mark a before and after in the way we move.  An intention that of the brand of the apple that is presumed as one of those of <strong>more interest for the future<\/strong>.  And it is that we are not facing a normal car, but this Apple will be autonomous.<\/p>\n<p>Thus, Steve Jobs&#8217;s has been working tirelessly for months and <strong>in strict secrecy<\/strong> about this project, one of the most ambitious in recent years.  We say secretly because, beyond the little that the technology has wanted to reveal (and we emphasize that it has been very little despite the fact that they have been behind it for a long time), there are some details that make it really new and innovative.<\/p>\n<p>At least that is what the latest information that has leaked now tells us about the process in which the firm is immersed in the face of a possible launch in the next five years.  Now the information is a little more precise than what we had known before, and little by little <strong>they are shaping<\/strong> which will undoubtedly be the most anticipated car in many years<\/p>\n<h2>Autonomous, electric… and robotized<\/h2>\n<p>Beyond this, Apple has Kevin Lynch at the head of the autonomous electric car project, who has been in charge of piloting the iWach software.  According to Bloomberg, Lynch would have taken an important step in promoting autonomous driving.<\/p>\n<p>If for many years, including the Titan Project, the Cupertino company has been developing semi-autonomous driving like the one already incorporated by Tesla, Stellantis, Volkswagen Group, Toyota, Renault&#8230; and practically all traditional brands, now it would have taken the step to create a <strong>autonomous driving software<\/strong> I didn&#8217;t need the driver.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>Namely;  Apple would have opted for a complete self-driving system in its future car that does not require human intervention, <strong>level 5,<\/strong> with what could do without pedals and steering wheel.  But there have been changes;  because if at the beginning they thought of a Tesla-style battery car, in the new stage, instead, they have opted to conceive a vehicle <strong>robotized<\/strong>.  The design is still an unknown, because it will depend, among other things, on the final use that is going to be given to the model.<\/p>\n<h3>It is planned for 2025<\/h3>\n<p>In the same way, the company is working on possible problems for this type of driving, where it has recently been known that they have just patented a system to avoid one of what, perhaps, will be the greatest evils at the user level: the <strong>dizziness<\/strong>.  Dealing with it is going to be a big deal, and Apple believes the way to do that is virtual reality.<\/p>\n<p>Or what is the same; <strong>create an environment<\/strong> that it moves at the same time as the vehicle, to prevent peripheral vision from appreciating the dissonance between one and the other and, therefore, dizziness does not occur.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1660875 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652951185_291_This-is-the-reality-of-Apples-self-driving-car.jpg\" alt=\"Apple self-driving car technology\" width=\"768\" height=\"425\"  \/><\/p>\n<p>As far as its arrival is concerned, we have previously seen rumors that Apple was targeting the year 2024 to produce a passenger vehicle together with Toyota.  But to this information are now added the reports that indicate that the objectives of delivery of its own vehicle have also changed, going from a possible launch within five to seven years, to just four, pointing to a <strong>global presentation by 2025<\/strong>.<\/p>\n<p>In any case, analysts almost certainly believe that Apple will have to count on the support of an already established car brand, to benefit from its experience, knowledge and even facilities, because production could be outsourced.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Apple car, in strict secrecy Thus, at Apple they are determined to launch the result of the titan project and mark a before and after in the way we move. An intention that of the brand of the apple that is presumed as one of those of more interest for the future. And it [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1049,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1046"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1046"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1046\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1049"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1046"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1046"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1046"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}