{"id":1050,"date":"2022-05-19T09:08:34","date_gmt":"2022-05-19T09:08:34","guid":{"rendered":"https:\/\/why-what-who.com\/see-the-total-data-uploaded-and-downloaded-thanks-to-transmission\/"},"modified":"2022-05-19T09:08:34","modified_gmt":"2022-05-19T09:08:34","slug":"see-the-total-data-uploaded-and-downloaded-thanks-to-transmission","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/see-the-total-data-uploaded-and-downloaded-thanks-to-transmission\/","title":{"rendered":"See the total data uploaded and downloaded thanks to Transmission"},"content":{"rendered":"<p>The internet connections that we currently have open up a wide range of possibilities in everything related to online work.  This, for example, directly affects the uploading and downloading of content through Torrent files on P2P networks, where <strong>Transmission<\/strong> can play a fundamental role.<\/p>\n<p>We refer to one of the most well-known and used clients for this type of task that we are commenting on.  And it is that through the <strong>P2P networks<\/strong> we have the possibility of downloading and sharing large files with the reliability that other methods do not offer us.  That is precisely why these torrents have been used for many years <strong>both by end users and companies<\/strong>.<\/p>\n<p>Due mainly to its nature and mode of use, as it is easy to imagine through these programs or clients we handle a <strong>huge amount of data over the internet<\/strong>.  On certain occasions it would not hurt to be able to control both the upload and download of content in terms of the data consumed here.  This information that we are talking about can be translated into an enormous <strong>number of gigabytes transmitted<\/strong> what we should know  Well, if we focus on the free Transmission client, the program itself makes things easy for us.<\/p>\n<p>With this, what we want to tell you is that we find an integrated function in the client that provides us with this information if necessary.  The truth is that this <strong>open source torrent download app<\/strong> It is preferred by many for many reasons.  It is for all these reasons that we will now teach you how to extract this information in case you need it in certain circumstances.<\/p>\n<h2>Where to see the amount of data used in Transmission<\/h2>\n<p>Keep in mind that this is a function that integrates the program itself to <strong>share torrent files<\/strong>.  By default the <strong>accountants<\/strong> that refer to the uploaded and downloaded data will be zero, as it could not be otherwise.  Therefore, what we recommend at first is to start working with the Torrent client in a conventional way.  Here we can load the corresponding files for uploading or downloading through the internet.<\/p>\n<p>Of course, at the moment in which we need <strong>know the data<\/strong> that we have mentioned before, we have to access the program menu.  Specifically, we are in the section called Help \/ Statistics.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>Here we are going to find a new small window that appears on the screen showing interesting data.  These are divided into two sections that refer to the <strong>current session exchange information<\/strong>, and another with the total accumulated with the use of the program.  Among the data type fields shown here we find everything uploaded, downloaded, the proportion obtained and the time of use of Transmission.<\/p>\n<p>There is no doubt that this useful information can be very helpful in certain circumstances when calculating everything that we have shared from the Torrent client.  Besides <strong>this information accumulates<\/strong> in the program itself over time for future aggregate reporting.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The internet connections that we currently have open up a wide range of possibilities in everything related to online work. This, for example, directly affects the uploading and downloading of content through Torrent files on P2P networks, where Transmission can play a fundamental role. We refer to one of the most well-known and used clients [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1052,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1050"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1050"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1050\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1052"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1050"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1050"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1050"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}