{"id":1054,"date":"2022-05-19T09:55:48","date_gmt":"2022-05-19T09:55:48","guid":{"rendered":"https:\/\/why-what-who.com\/kodi-20-nexus-can-now-be-downloaded-with-many-improvements\/"},"modified":"2022-05-19T09:55:48","modified_gmt":"2022-05-19T09:55:48","slug":"kodi-20-nexus-can-now-be-downloaded-with-many-improvements","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/kodi-20-nexus-can-now-be-downloaded-with-many-improvements\/","title":{"rendered":"Kodi 20 Nexus can now be downloaded with many improvements"},"content":{"rendered":"<p>Playing multimedia content only on our computer is a thing of the past.  Today we are doing it continuously on all kinds of devices, and for that it is important to have a good player that is capable of using all kinds of content without problems, be it videos, music or photos.  There are many that work very well, but there are probably none as complete as Kodi, <strong>that today May 17 has released its version number 20<\/strong>.<\/p>\n<p>There may still be many people who are unaware of the virtues of Kodi, but it is <strong>an open source software<\/strong> that should not be lost sight of.  Thanks to it we can turn a computer, a mobile or even a Raspberry Pi into a multimedia center, something that thousands of people use all over the world.  With this new version, its developers seek to make a leap in quality, although it may be that to see it at full capacity, we may have to wait a little longer.<\/p>\n<h2>Download Kodi 20 Nexus Preview<\/h2>\n<p>As we say, the most modern stable version we have of Kodi is 19.4, but today version 20 has appeared, <strong>nicknamed Nexus<\/strong>.  This version has appeared on the software&#8217;s own website under the &#8220;prerelease&#8221; tab, which indicates that it is a preliminary version that is still under development.  This type of release is great for everyone, as it allows developers to continue working on fine-tuning its functionality while users can test what&#8217;s new in the new version.<\/p>\n<p>Like everything, you have to take into account a series of things before trying a preliminary version.  Are, <strong>not being 100% finished<\/strong>, may cause us some performance or operation errors when playing content.  This is precisely what developers are looking for, since by obtaining fluid feedback from users they will have it much easier when it comes to identifying possible errors and correcting them.<\/p>\n<p>   <\/p>\n<p id=\"caption-attachment-1660794\" class=\"wp-caption-text\">Download the new version of Kodi 20 Nexus.<\/p>\n<p>Kodi 20 Nexus is available right now for download on Windows<strong> or for Android systems<\/strong>.  It is interesting to note that for both platforms it is available in both 32-bit and 64-bit versions, so we won&#8217;t have any kind of compatibility problem, even on devices that are a few years old.<\/p>\n<h2>A free player that only gets better<\/h2>\n<p>This new version of Kodi arrives with very few visual changes (at least, regarding its first preliminary version), so it seems that the bulk of the changes are going to be found inside.  Its managers always publish on its website the notes corresponding to each new version of the software to report the changes, but <strong>the notes for this Nexus release are not yet available<\/strong>.<\/p>\n<p>Since it was born in 2002 under the name of Xbox Media Player\/Center, this free software has only gained in features and quality.  At some point you may have even heard that Kodi is not legal, but nothing could be further from the truth. <strong>It is a free and legal software<\/strong>although yes, some extensions or add-ons created by other developers can carry some kind of risk.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Playing multimedia content only on our computer is a thing of the past. Today we are doing it continuously on all kinds of devices, and for that it is important to have a good player that is capable of using all kinds of content without problems, be it videos, music or photos. There are many [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":771,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1054"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1054"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1054\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/771"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1054"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1054"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1054"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}