{"id":1056,"date":"2022-05-19T10:54:55","date_gmt":"2022-05-19T10:54:55","guid":{"rendered":"https:\/\/why-what-who.com\/4-great-free-games-that-you-can-download-from-the-epic-games-store\/"},"modified":"2022-05-19T10:54:55","modified_gmt":"2022-05-19T10:54:55","slug":"4-great-free-games-that-you-can-download-from-the-epic-games-store","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/4-great-free-games-that-you-can-download-from-the-epic-games-store\/","title":{"rendered":"4 great free games that you can download from the Epic Games Store"},"content":{"rendered":"<p>The PC video game market has long been monopolized by a single platform: <strong>Steam<\/strong>.  In it we could buy any title we wanted, add it to our library, and play it whenever and wherever we wanted.  As long as, yes, we get it off this platform.  However, complaints from developers have opened the door for other platforms to try to carve out a niche in this market and stand up to Steam by offering better conditions and better prices.  And the one that has achieved it has been the Epic Games Store.<\/p>\n<p>The <strong>Epic Games Store<\/strong> is the video game store of Epic Games, the company responsible for the Unreal Engine video game development engine, as well as several PC games, such as Unreal Tournament, the Gears of War saga and, of course, the world-famous Fortnite.  This store reached users in December 2018 with the objective that we have already mentioned: to steal developers from Steam by offering better conditions and fewer commissions.  And not only that, but it has also sought to gain the trust of users by giving away PC games every week.<\/p>\n<p>But in the Epic Games Store we are not only going to find paid games.  In this store there is also room for a large number of free titles that we will be able to download at any time and play them without spending a single penny.<\/p>\n<p>Of course, one of these games is the <strong>Fortnite<\/strong>.  This &#8220;zombie wave&#8221; game, launched in 2017, finally migrated to a Battle Royale model, which has been the one that has managed to give it all the success it has achieved in the last five years.  The title is completely free, so if we want to play it, all we have to do is download and install Fortnite on Windows.  Within a similar theme we find <strong>Valorant.<\/strong> This title brings us a 5v5 tactical shooter in which, as a team, we will have to manage to defeat our rivals.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>If we are looking for something further from the shooter, then another great title, which will take us a lot of hours, is <strong>Genshin Impact<\/strong>.  This massively multiplayer role-playing open world title invites us to begin a journey through Teyvat in search of a lost relative.<\/p>\n<p>Finally, somewhat further from the previous ones, we can also play <strong>Rocket League<\/strong>.  A multiplayer arcade game that mixes racing and sports, in which we will have to score a goal in the opposite goal using a car.<\/p>\n<h2>Don&#8217;t forget the weekly free games<\/h2>\n<p>Since its launch, the Epic Games Store has been giving away different paid games to all its users every week.  Some weeks the quality of the games is of dubious quality, while other weeks we can find great titles that, without a doubt, deserve a place in our library.  This week, for example, is one of these good weeks, being able to get, at no cost, these three titles:<\/p>\n<ul>\n<li><strong>Jotun: Valhalla Edition<\/strong><\/li>\n<li><strong>Prey<\/strong><\/li>\n<li><strong>Redout: Enhanced Edition<\/strong><\/li>\n<\/ul>\n<p>These free games are only available for 7 days.  But, once added to our library, they will be ours forever.  Therefore, it costs nothing to get hold of them, and add titles to our Epic Games Store library since, if tomorrow we feel like playing any of those that have already been given away, we can do so without having to go through the box.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The PC video game market has long been monopolized by a single platform: Steam. In it we could buy any title we wanted, add it to our library, and play it whenever and wherever we wanted. As long as, yes, we get it off this platform. However, complaints from developers have opened the door for [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1058,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1056"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1056"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1056\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1058"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1056"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1056"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1056"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}