{"id":1067,"date":"2022-05-19T16:23:34","date_gmt":"2022-05-19T16:23:34","guid":{"rendered":"https:\/\/why-what-who.com\/how-to-use-the-classic-context-menu-again-in-windows-11\/"},"modified":"2022-05-19T16:23:34","modified_gmt":"2022-05-19T16:23:34","slug":"how-to-use-the-classic-context-menu-again-in-windows-11","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/how-to-use-the-classic-context-menu-again-in-windows-11\/","title":{"rendered":"How to use the classic context menu again in Windows 11"},"content":{"rendered":"\n<p>In the event that we want to access the full context menu, we will need to click on its <strong>show more options<\/strong> that is present at the bottom of the new context menu or press the key combination <strong>Shift + F10<\/strong> to access directly.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>This basically means that we have two context menus in Windows 11. The first, the compact one, and the second, the extended one with all the available options.<\/p>\n<h2>Modify the Registry<\/h2>\n<p>If we are determined to change the Windows 11 right-click menu to the classic one that we used in Windows 10, Microsoft is not going to make it easy for us and we will not have any graphic element to be able to carry out this option.  That is why we will have to carry out modifications in the Registry either manually or automatically.<\/p>\n<p>To be able to restore the context menu by the classic from the Registry, we can do it in two different ways, both equally valid, either by doing it automatically with a .reg file or by changing the parameters manually.<\/p>\n<h3><strong>Auto switch<\/strong><\/h3>\n<p>Perhaps the easiest way to carry out this restoration process is to make the change in the Registry automatically, since it will only be necessary to download a .reg file and execute it.  This file we need is called <strong>ClassicShell.reg<\/strong> We can download it from its repository on GitHub.<\/p>\n<p>Once downloaded, we just have to add it to the Windows Registry, for which we simply have to click on it with the right button and select the option <strong>Open<\/strong> with the <strong>Registry Editor.<\/strong> Next, a warning window will appear and click on Run.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-732396 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652977414_250_How-to-use-the-classic-context-menu-again-in-Windows.jpg\" alt=\"Run classicshell file\" width=\"800\" height=\"578\"  \/><\/p>\n<p>Once this is done, we only have to log out and then log back in.  Then we will check how the Windows 11 context menu has returned to the previous version.<\/p>\n<p>In the case of wanting to return to the Windows 11 context menu, the process is similar but first we must edit the ClassicShell.reg file that we had downloaded.  To do this, right-click on it and select Notepad.  Here we must change the value dword: 00000000 by <strong>dword:00000001<\/strong>.  We save the changes and run the file again.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-732387 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652977414_731_How-to-use-the-classic-context-menu-again-in-Windows.jpg\" alt=\"Edit script with Notepad\" width=\"900\" height=\"283\"  \/><\/p>\n<h3><strong>Manual shift<\/strong><\/h3>\n<p>Changing the Registry manually is intended for expert and advanced users who have knowledge and experience in modifying the system registry.<\/p>\n<p>In this case, the first thing will be to press the keyboard shortcut “Windows + R” to launch the Run command.  Here we write<strong> regedit<\/strong> and press Enter or the OK button.<\/p>\n<p>Once it is inside the Windows Registry and before modifying anything, we will make a backup, as a preventive measure.  We cannot forget that any unwanted modification can cause damage to the system.  To do this, click on “File” and “Export”.  Then we specify All in the export range, give it a name, select the .reg format and click &#8220;Save&#8221;.<\/p>\n<p>Next, we navigate to the following location:<\/p>\n<p> <code class=\"code-section\"> HKEY_CURRENT_USER \/ Software \/ Classes \/ CLSID <\/code> <\/p>\n<p>Now we right-click on the CLSID key and select “New” and “Key”.  This will make us create a key under the CLSID key that we will give by name <strong>{86ca1aa0-34aa-4e8b-a509-50c905bae2a2}<\/strong>.<\/p>\n<p>Again we right-click on the key {86ca1aa0-34aa-4e8b-a509-50c905bae2a2} and select «New» and «Key», to create a key within it which we will put as a name <strong>InprocServer32.<\/strong><\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-732432 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652977414_721_How-to-use-the-classic-context-menu-again-in-Windows.jpg\" alt=\"Return to the classic context menu by modifying the Registry\" width=\"900\" height=\"478\"  \/><\/p>\n<p>Now we only have to close the Registry Editor and restart the computer.  Once restarted we will get the old Windows 10 context menu.<\/p>\n<p>If later we want to return to the default context menu of Windows 11, it will be enough to access the Registry and delete the key <strong>{86ca1aa0-34aa-4e8b-a509-50c905bae2a2}<\/strong>.<\/p>\n<h2>Try apps for free<\/h2>\n<p>A very simple way to be able to re-enable the classic right-click menu in Windows 11 is through third-party applications.  By using these programs we will be able to carry out this operation with just a simple mouse click.<\/p>\n<h3>Win 11 Classic Context Menu<\/h3>\n<p>In exchange for downloading a simple free portable application called <strong>Win 11 Classic Context Menu<\/strong>, we are going to find a solution to be able to disable and enable the new Windows 11 context menu quickly, avoiding having to change Registry parameters.  We can download it from the developer&#8217;s website.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-733632 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652977414_62_How-to-use-the-classic-context-menu-again-in-Windows.jpg\" alt=\"Win 11 Classic Context Menu\" width=\"800\" height=\"303\"  \/><\/p>\n<p>It has a minimalist interface and in Spanish, so everything is done easily.  We will only have two options:<\/p>\n<ul>\n<li>Enable classic context menu style<\/li>\n<li>Enable default context menu styling.<\/li>\n<\/ul>\n<p>Simply click on the first option to make the Windows 10 context menu available again. In the event that we want to return to the one used in Windows 11 by default, click on the second option.<\/p>\n<p>To confirm the changes, it will only be necessary to press the “Restart browser” button.<\/p>\n<h3>Winaero Tweaker<\/h3>\n<p>We are talking about a free Windows customization and adjustment tool that will allow us to modify the hidden configuration of the operating system that does not allow us to change the interface, giving us the possibility of being able to recover the classic menu in Windows 11. The application is safe to use , free of ads and scripts.  We can download it from its official website.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-735549 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652977414_476_How-to-use-the-classic-context-menu-again-in-Windows.jpg\" alt=\"Winaero Tweaker\" width=\"900\" height=\"603\"  \/><\/p>\n<p>Once downloaded and installed, we run it so that its main menu appears.  In the left column we look at its Windows 11 section and select “Classic Full Context Menus”.  Finally, in the right column, we click on the section of <strong>Enable classic full context menus<\/strong>.  Once this is done, we restart the computer and check that the changes have taken effect.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In the event that we want to access the full context menu, we will need to click on its show more options that is present at the bottom of the new context menu or press the key combination Shift + F10 to access directly. This basically means that we have two context menus in Windows [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1074,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1067"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1067"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1067\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1074"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1067"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1067"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1067"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}