{"id":1101,"date":"2022-05-20T10:54:03","date_gmt":"2022-05-20T10:54:03","guid":{"rendered":"https:\/\/why-what-who.com\/do-you-know-what-the-vin-code-of-your-car-is-find-out-what-it-is-for-and-where-to-find-it\/"},"modified":"2022-05-20T10:54:03","modified_gmt":"2022-05-20T10:54:03","slug":"do-you-know-what-the-vin-code-of-your-car-is-find-out-what-it-is-for-and-where-to-find-it","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/do-you-know-what-the-vin-code-of-your-car-is-find-out-what-it-is-for-and-where-to-find-it\/","title":{"rendered":"Do you know what the VIN code of your car is?  Find out what it is for and where to find it"},"content":{"rendered":"<p>It is time to deal with the circulation tax, known as IVTM, Tax on Mechanical Traction Vehicles, which has a series of provisions.  Among them, for example, we have what is distinguished as the VIN or VIN code of your car, which is the identification number that each of the vehicles that appear on our streets has.  However,<strong>what is it for<\/strong> and where can we put it?<\/p>\n<h2>The VIN, the identifier of our car<\/h2>\n<p>Owning a car is associated with some fixed costs.  Among them, the Circulation Tax, also known as the &#8216;little number&#8217;, although its formal name in the General Vehicle Regulations is Tax on Mechanical Traction Vehicles (IVTM).  Its objective is to record the <strong>ownership of registered vehicles<\/strong> They are suitable for driving on public roads.<\/p>\n<p>Given this, and especially to deal with this (and other taxes), from our town hall they are going to ask us for some identification of our car, among them the one that has to do with the <strong>VIN code<\/strong>.  A VIN that is moving and that is useful in many aspects, not only for this type of tax.<\/p>\n<p>In those, just as people have identifiers such as our name or ID, the vehicles have this &#8216;little number&#8217; <strong>for your recognition<\/strong> at the legal level.  VIN stands for &#8216;Vehicle Identification Number&#8217; and it is a code that appears on the car, making its importance clear.<\/p>\n<h2>Not to be confused with the chassis number<\/h2>\n<p>All in all, this serves to be able to identify each car correctly and prevent criminal acts from taking place, where all vehicles in the world have a <strong>own and unique identifier<\/strong>.  It could be said that it is like his name and surname.  This number is the VIN, not to be confused with the chassis number.<\/p>\n<p>This could also be said to be the car&#8217;s serial number, given by the manufacturer.  Similarly, the VIN is now standard on every car on the road, and the components of the code have different meanings, such as country of manufacture, make and model, etc.<\/p>\n<p>A code of numbers and letters that was implemented as a standard from 1980 in accordance with the ISO 3779 standard. It specifies that motor vehicles, trailers, motorcycles or mopeds must have it.  In addition, the VIN code appears on all documents of the car, so you can easily find out<strong> what has happened to you before<\/strong> to the vehicle (if used).<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<h3>Where is it located<\/h3>\n<p>As we say, this identification must be registered in all the documents of the car (TCP, registration certificate, etc.).  And there, there are several places in the vehicle itself where the <strong>manufacturer can indicate<\/strong> and where we can place it.  This is done to protect the car from theft as it could be missed by thieves in some places.<\/p>\n<p>Most often, the code is indicated in the <strong>body components<\/strong>, which are in one piece, as well as in the chassis and number plates.  The code plate is located in the engine compartment and is easy to find.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1666221 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/Do-you-know-what-the-VIN-code-of-your-car.jpg\" alt=\"Find car VIN\" width=\"768\" height=\"425\"  \/><\/p>\n<p>To find the identification number you have to resort more or less always to the same places.  In a car, the VIN is usually located in a visible place in the engine compartment, in the lower part of the front window, in one of the pillars of the driver&#8217;s door and sometimes in the trunk or under the driver&#8217;s or passenger&#8217;s mat.<\/p>\n<p><strong>Composed of 17 characters<\/strong>, 8 of them are those corresponding to the frame number.  To avoid confusion when it comes to reading, the alphabetic part does not include the letters I, O, Q or Ñ.  Thus, in the VIN we can find the following elements:<\/p>\n<ul>\n<li><strong>WMI.<\/strong> It is responsible for identifying the manufacturer.  They are the first three digits and they show the country of the company.  The number is assigned to such a company taking into account the International Organization for Standardization (ISO).<\/li>\n<li><strong>YOU. <\/strong>It is made up of six characters that are responsible for displaying the information of the car itself.  That is, the type of engine, fuel, chassis and other technical characteristics.<\/li>\n<li><strong>VIS. <\/strong>This is the frame or chassis number and is made up of eight characters.  It shows the year in which the car was manufactured, the factory and the production line.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>It is time to deal with the circulation tax, known as IVTM, Tax on Mechanical Traction Vehicles, which has a series of provisions. Among them, for example, we have what is distinguished as the VIN or VIN code of your car, which is the identification number that each of the vehicles that appear on our [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1104,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1101"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1101"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1101\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1104"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1101"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1101"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1101"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}