{"id":1121,"date":"2022-05-20T11:40:34","date_gmt":"2022-05-20T11:40:34","guid":{"rendered":"https:\/\/why-what-who.com\/4-features-that-shouldnt-be-in-web-browsers\/"},"modified":"2022-05-20T11:40:34","modified_gmt":"2022-05-20T11:40:34","slug":"4-features-that-shouldnt-be-in-web-browsers","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/4-features-that-shouldnt-be-in-web-browsers\/","title":{"rendered":"4 features that shouldn&#8217;t be in web browsers"},"content":{"rendered":"<p>When we turn on the computer for the first time in the day, one of the programs that we give priority to is the web browser.  And it is that these, the browsers, give us <strong>access to all internet content<\/strong> directly.  They are full of interesting functions that try to make these tasks easier for us, although the truth is that some of them are superfluous.<\/p>\n<p>Over time, this is a software sector that has not stopped growing, something that its users are fully aware of. <strong>developers<\/strong>.  Behind the main web browsers we find firms of the importance of Microsoft or Google with <strong>Edge and Chrome<\/strong> respectively, among others.  In any case, we have a wide variety of programs of these characteristics to choose from.  The main objective of all of them is basically the same, to give us access to the almost infinite content of the Internet.<\/p>\n<p>But at the same time, many other factors come into play here that directly affect the user&#8217;s experience with the program.  Hence precisely the constant updates that developers send for their projects.  And it is that here elements as important as the <strong>functionality<\/strong>external appearance and <strong>security<\/strong>.  Precisely for all this and with the passage of time, these programs are becoming more complete as well as complex.  This translates into a <strong>high consumption of computer resources<\/strong>which is one of the most recurrent complaints shown by users.<\/p>\n<p>Sometimes we may come across certain functions and features that the developer of the program could have saved.  Next, we will talk about some of these <strong>functionalities that perhaps should not be in the mentioned browsers<\/strong> Web.<\/p>\n<h2>Functions that are left over in many internet browsers<\/h2>\n<p>As we told you, these applications in particular and especially due to their enormous use, have more and more integrated features.  In this way, for many users, some of them could be eliminated without any problem, let&#8217;s see some examples.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<ul>\n<li><strong>tracking functions<\/strong>: a part of current browsers collect and track our movements through the web.  Therefore, all these telemetry functions should be automatically removed from these programs, since they violate users&#8217; privacy.<\/li>\n<li><strong>Storage of certain data<\/strong>: and speaking of <strong>Privacy<\/strong>Likewise, a good part of these programs store a good amount of our data.  It is true that there are some that help us improve the experience of using the browser.  However, there is certain information that is too sensitive and should not be saved automatically.  Here we refer to the passwords of the platforms that we access, with our bank cards.  All this could be seriously exposed just by accessing the application as such.<\/li>\n<li><strong>Install an infinite number of extensions<\/strong>: The use of extensions in these browsers is common and often necessary.  But this is something that should be limited so that the operation of the program is not negatively affected.  We can install as many plugins as we want, which could have a direct impact on the operation of the rest of <strong>computer programs<\/strong>.<\/li>\n<li><strong>Google as default search engine<\/strong>: On most occasions when we install a new program of this type, the default search engine is almost always Google.  This is something that can also affect our privacy, so the program should let us choose during the installation itself.  What <strong>Chrome<\/strong> set this search engine by default, it&#8217;s logical, but the rest should omit this parameter by default.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>When we turn on the computer for the first time in the day, one of the programs that we give priority to is the web browser. And it is that these, the browsers, give us access to all internet content directly. They are full of interesting functions that try to make these tasks easier for [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1123,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1121"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1121"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1121\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1123"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1121"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1121"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1121"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}