{"id":1124,"date":"2022-05-20T13:02:33","date_gmt":"2022-05-20T13:02:33","guid":{"rendered":"https:\/\/why-what-who.com\/adsl-and-cable-continue-to-disappear-from-spain\/"},"modified":"2022-05-20T13:02:33","modified_gmt":"2022-05-20T13:02:33","slug":"adsl-and-cable-continue-to-disappear-from-spain","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/adsl-and-cable-continue-to-disappear-from-spain\/","title":{"rendered":"ADSL and cable continue to disappear from Spain"},"content":{"rendered":"<p>We are going to review the most interesting things that this latest monthly report on telecommunications published in CNMCData has left us.<\/p>\n<h2>FTTH grows, ADSL and cable drop<\/h2>\n<p>According to the latest consolidated monthly data at the end of March 2022, <strong>the total number of FTTH lines (fiber to the home) stands at practically 13 million<\/strong>, 12,984,675 to be more exact.  These data, in turn, are linked to those of the ADSL and HFC lines, which continue to drop month after month.  The monthly growth was 92,932 lines.  37.5% of the total FTTH lines correspond to Movistar, with a fleet of 4.9 million lines.<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1666818\" class=\"wp-caption-text\">Evolution of broadband lines by technology (thousands)<\/p>\n<p>As for cable, or HFC connection (hybrid fiber coaxial), it is considered fiber optic and the operators offer it that way, but the truth is that it does not use the same technology for the cable, but rather the fiber optic reaches a main installation and from there it is distributed to homes through coaxial cable.  If we look at the latest data we will see that they still resist<strong> 1,860,437 HFC lines<\/strong>, 10,000 less than the previous month (1,870,736).  If we go back a couple of months, to have a perspective of what this 2022 has been, at the end of January there were 1,897,493 and at the end of December of last year 1,915,354.<\/p>\n<p>For its part, ADSL has also experienced a fall.  On an annual level, compared to March 2021, the increase of 1.1 million FTTH lines is also related to the loss of 0.5 million lines with DSL technology.  On a month-to-month basis,<strong> ADSL data at the end of March 2022 is 1,150,062<\/strong> (with 648,983 of them corresponding to Movistar).  At the end of February there were 1,192,518, at the end of January 1,230,861 and at the end of last 2021 1,265,672.<\/p>\n<h2>Movistar leads the mobile sector<\/h2>\n<p>The number of mobile lines increased by 230,189 lines in March.  The month closed with a figure of 56.23 million lines, which is 2.5% more than a year ago.  If we add to <strong>Movistar (28.24%)<\/strong>, Orange (22.91%) and Vodafone (22.26%), represent 73.4% of the total mobile lines in the market.  If we add the MásMóvil Group (20.55%), we go up to 94% of the mobile market.<\/p>\n<p> <img viewbox=\"0 0 3 2\" aria-describedby=\"caption-attachment-1666845\" loading=\"lazy\" class=\"size-large wp-image-1666845\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653051753_660_ADSL-and-cable-continue-to-disappear-from-Spain.jpg\" alt=\"Mobile operator market share\" width=\"715\" height=\"384\"  \/><\/p>\n<p id=\"caption-attachment-1666845\" class=\"wp-caption-text\">Mobile operator market share<\/p>\n<p>The number of mobile lines in our country has once again increased as a whole, as well as separately, both in terms of contract and prepaid.  The total number of mobile lines in our country is, at the end of March 2022, 56,234,988, which represents a positive variation of 2.5% year-on-year with respect to the data for March 2021 (54,873,580 lines).<\/p>\n<p>As we mentioned, <strong>both contract and prepaid lines have grown, with almost identical figures<\/strong>.  The former rose 119,147 contract lines, for a total in Spain of 47,188,907, the vast majority of the sector.  However, the offers in the balance recharge sector, with quite attractive rates in a practically unexpected fight in this type of mobile telephony in extinction, has caused an increase of 111,042 prepaid lines, for a total of 9,046,081 lines to end of March 2022.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We are going to review the most interesting things that this latest monthly report on telecommunications published in CNMCData has left us. FTTH grows, ADSL and cable drop According to the latest consolidated monthly data at the end of March 2022, the total number of FTTH lines (fiber to the home) stands at practically 13 [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1127,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1124"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1124"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1124\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1127"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1124"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1124"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1124"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}