{"id":1132,"date":"2022-05-20T13:05:08","date_gmt":"2022-05-20T13:05:08","guid":{"rendered":"https:\/\/why-what-who.com\/update-windows-11-now-try-its-new-search-bar\/"},"modified":"2022-05-20T13:05:08","modified_gmt":"2022-05-20T13:05:08","slug":"update-windows-11-now-try-its-new-search-bar","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/update-windows-11-now-try-its-new-search-bar\/","title":{"rendered":"Update Windows 11 now, try its new search bar"},"content":{"rendered":"<p>There is no doubt that Microsoft is currently putting a good part of its efforts into the new <strong>Windows 11<\/strong>.  That does not mean that it has abandoned the previous operating system, but the firm aims that the majority of users with compatible equipment migrate to the new system.  Hence the constant updates it sends out with bug fixes and functional improvements.  Next, we will talk about the new <strong>build 25120<\/strong> sent to Insiders and some of its interesting news.<\/p>\n<p>This is something that is taking place for those enrolled in the <strong>dev channel<\/strong> Insider, where the most recent tests of the firm are usually sent.  Here the these users receive new functions and characteristics that the ones of Redmond are testing, all before its implementation for the whole world.  In fact, in the aforementioned build for Windows 11 that was just shipped, we found some important new features.<\/p>\n<h2>Build 25120: Windows 11 offers us this search bar<\/h2>\n<p>Among the <strong>new functions that we will find<\/strong> In this new build for Windows 11, we must highlight a particularly striking one.  Keep in mind that the software giant wants to make certain interactive content reach the Windows desktop for users of this system.  At this time, as many of you have tried first hand, the software has this type of content in the form of <strong>widgets<\/strong>.<\/p>\n<p>But the firm wants to go a step further in this same direction and improve this interaction model that we are commenting on.  Going deeper into this topic, in the new build we find a <strong>search box displayed on desktop<\/strong> and that allows us to perform searches on the web.  As you can imagine, this will not be of much help when it comes to <strong>locate online content in a much more direct way<\/strong> and accessible.  With this new search box, the signature fulfills the objective of facilitating the arrival of all kinds of information in Windows 11 in a more direct way.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>In any case, it must be taken into account that the use of this functionality is optional.  With these we mean that we have the possibility of<strong> remove this search box<\/strong> so it doesn&#8217;t show up on the desktop.  Just click with the right mouse button in this section of Windows where we can already deactivate the Show search option.<\/p>\n<h2>Other improvements and fixes coming to the Microsoft system<\/h2>\n<p>With all this, what Microsoft wants is that the insiders of the <strong>dev channel<\/strong> Try this search box first-hand for its possible integration into the final version of Windows 11. But this is not the only novelty that we are going to find in this <strong>new build<\/strong> of Microsoft software.  Therefore, here are some features that have been fixed and bugs fixed after this release.<\/p>\n<ul>\n<li>We are now with <strong>more date and time formats<\/strong> for use in Windows 11.<\/li>\n<li>Fixed some issues with certain formats when copying a date or time.<\/li>\n<li>The build improves the <strong>overall performance and system reliability<\/strong>.<\/li>\n<li>They fix an issue that locks the settings when viewing the graph of <strong>battery usage<\/strong>.<\/li>\n<li>Improve display performance <strong>Wi-Fi networks<\/strong> after turning them on in Quick Settings.<\/li>\n<li>Fixed bug that caused texts on the Performance page to be unreadable.<\/li>\n<li>Microsoft fixes a bug in Windows Update that rolls back updates.<\/li>\n<\/ul>\n<p>To finish, we will tell you that the software giant provides us with a new Windows 11 ISO with this compilation that you can download right now to make a clean installation with the news.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There is no doubt that Microsoft is currently putting a good part of its efforts into the new Windows 11. That does not mean that it has abandoned the previous operating system, but the firm aims that the majority of users with compatible equipment migrate to the new system. Hence the constant updates it sends [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1134,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1132"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1132"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1132\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1134"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1132"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1132"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1132"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}