{"id":1138,"date":"2022-05-20T14:07:23","date_gmt":"2022-05-20T14:07:23","guid":{"rendered":"https:\/\/why-what-who.com\/if-you-use-this-version-of-libreoffice-soon-you-will-not-receive-updates\/"},"modified":"2022-05-20T14:07:23","modified_gmt":"2022-05-20T14:07:23","slug":"if-you-use-this-version-of-libreoffice-soon-you-will-not-receive-updates","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/if-you-use-this-version-of-libreoffice-soon-you-will-not-receive-updates\/","title":{"rendered":"If you use this version of LibreOffice, soon you will not receive updates"},"content":{"rendered":"<p>Despite the enormous popularity of Microsoft&#8217;s office suite, many users around the world prefer to opt for another open source.  Here we find LibreOffice, a set of office programs that have little to envy to the aforementioned <strong>Office<\/strong>.<\/p>\n<p>Furthermore, it is worth noting here that <strong>we will not have to pay a single euro<\/strong> to benefit from all the functions included.  It is also interesting to know that this is a completely live project that receives <strong>regular updates<\/strong> that improve its functionality and compatibility, among other things.  This is precisely the case that concerns us in these lines and that we will talk about next.<\/p>\n<p>We tell all this because the version of the office suite, <strong>Libre Office 7.2<\/strong>, you receive your latest update before the end of its useful life.  This is something that will take place on June 12, that is, in less than a month.  That is why we should update to a newer version as soon as possible.  Keep in mind that The Document Foundation has just made the new LibreOffice 7.2.7 available to everyone.  To say that this is the seventh and last maintenance update of the series of packages belonging to 7.2.  All this occurs a month before his official end of life.<\/p>\n<p>This is an update that comes two months after the previous version in order to add one last layer of bug fixes to the series.  As we told you before, LibreOffice 7.2 will reach the end of its useful life next month, the <strong>June 12, 2022<\/strong>.<\/p>\n<h2>What does the latest version of LibreOffice offer me?<\/h2>\n<p>It is interesting to know that this new update includes a total of <strong>47 bug fixes<\/strong>.  These fixes are intended to make LibreOffice 7.2 installations more stable and reliable.  At least until you upgrade to a newer version of the open source office suite, we&#8217;re talking about the LibreOffice 7.3 series already available.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>It is important to know that <strong>Libre Office 7.3<\/strong> it was launched earlier this year, specifically on February 2, 2022. Here we find the latest and most modern version of the office suite for Windows, Linux and macOS and Windows.  What&#8217;s more, the latest update for the series arrived last week as LibreOffice 7.3.3.  Here we find a good number of bug fixes to make the series even better.<\/p>\n<p>With all this what we want to tell you is that if you still use the previous series of the suite, it is <strong>It is recommended that you update to the most current<\/strong> when before.  We must know that it will receive a total of seven maintenance updates until November 30, 2022. On the contrary, LibreOffice 7.2 will reach the end of its useful life on June 12.  This is something we should do to continue receiving updates with the <strong>new features included<\/strong> for these programs.<\/p>\n<p>In parallel, The Document Foundation is working on the next major version of its series of open source office suites.  We refer to the next <strong>Libre Office 7.4<\/strong> which should see the light of day in mid-August 2022.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Despite the enormous popularity of Microsoft&#8217;s office suite, many users around the world prefer to opt for another open source. Here we find LibreOffice, a set of office programs that have little to envy to the aforementioned Office. Furthermore, it is worth noting here that we will not have to pay a single euro to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1140,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1138"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1138"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1138\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1140"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1138"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1138"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1138"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}