{"id":115,"date":"2022-05-08T23:11:52","date_gmt":"2022-05-08T23:11:52","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/08\/tv-has-never-been-seen-so-little-since-1992\/"},"modified":"2022-05-18T15:53:23","modified_gmt":"2022-05-18T15:53:23","slug":"tv-has-never-been-seen-so-little-since-1992","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/tv-has-never-been-seen-so-little-since-1992\/","title":{"rendered":"TV has never been seen so little since 1992"},"content":{"rendered":"<p>Practically since television was created, it has occupied a fundamental space in our home.  As technology and television channels themselves have evolved, we have had more and more ways to enjoy it, and of course with a wide variety of channels to choose from.  However, it seems that television consumption habits are changing in Spain, <strong>and this one has less and less audience<\/strong>.<\/p>\n<p>As we say, in our country we have a long list of DTT channels to enjoy, with several of its channels even focused on very specific content.  It is true that the majority of the audience is always taken by general channels such as Antena 3 or Telecinco, but it seems that not even these are saved.  According to audience data collected by Barlovento Comunicación, <strong>TV has never been seen so little since 1992<\/strong>.<\/p>\n<h2>The average consumption of television, down<\/h2>\n<p>According to the data collected in the month of April, each Spaniard watched television for an average of three hours and seventeen minutes a day.  This figure in itself does not seem bad, but the reality is that it supposes <strong>32 minutes less than the same month of the previous year<\/strong>.  These data represent a decrease that puts the average television viewing at its lowest since 1992, the year in which these data began to be collected.  Of this consumption, it should be noted that 190 minutes correspond to the linear broadcast, and 7 minutes to deferred (broadcast in the seven days following the linear broadcast).<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1622265\" class=\"wp-caption-text\">April TV audience analysis (2022) – Barlovento<\/p>\n<p>If we break down this data, we can also get some quite interesting notes.  Antena 3 continues to be the most watched channel on DTT (with a 13.6% audience share), closely followed by Telecinco (12.1%).  The latter has gained two tenths compared to the previous month, but, even so, it is in the lowest month of April in its history.  With regard to La 1 de la Televisión Española, this has fallen again two tenths, <strong>tying with an 8.3% audience share with some regional channels<\/strong>.  In fact, some, such as Aragón TV or Canal Sur, have recorded their best April since 2014 and 2018, respectively.<\/p>\n<p>As for the news,<strong> Antena 3&#8217;s continues to reign in audience for 28 months<\/strong>.  This takes 18.9% of the screen share, compared to the second on the list, which is Telecinco, with 12.3% of the share.<\/p>\n<h2>The end of the pandemic, possible cause<\/h2>\n<p>This significant drop in average audience from one year to the next may be due to several reasons, although it seems that the most logical is the end of the pandemic.  As the restrictive measures to prevent the spread of the Coronavirus have been eased, <strong>it is logical that people spend less time of their day to day at home<\/strong>something that would have directly affected television consumption habits in Spaniards.<\/p>\n<p>To this we must also add the rise of streaming platforms, which allow us to watch content on demand whenever and wherever we want.  Regardless of this, some sporting events are still successful on screen.  The golden minute of the month of April, for example, was won by the Copa del Rey penalty shootout, <strong>which at that time accumulated 50.6% of the audience share<\/strong> (6,061,000 spectators).<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Practically since television was created, it has occupied a fundamental space in our home. As technology and television channels themselves have evolved, we have had more and more ways to enjoy it, and of course with a wide variety of channels to choose from. However, it seems that television consumption habits are changing in Spain, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":117,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/115"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=115"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/115\/revisions"}],"predecessor-version":[{"id":878,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/115\/revisions\/878"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/117"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=115"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=115"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=115"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}