{"id":1158,"date":"2022-05-20T15:49:55","date_gmt":"2022-05-20T15:49:55","guid":{"rendered":"https:\/\/why-what-who.com\/open-source-programs-that-you-must-install-if-you-are-going-to-telework-on-linux\/"},"modified":"2022-05-20T15:49:55","modified_gmt":"2022-05-20T15:49:55","slug":"open-source-programs-that-you-must-install-if-you-are-going-to-telework-on-linux","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/open-source-programs-that-you-must-install-if-you-are-going-to-telework-on-linux\/","title":{"rendered":"Open Source programs that you must install if you are going to telework on Linux"},"content":{"rendered":"<p>Over the last few months we have seen how teleworking has spread significantly at the business level.  There are several reasons for all this, among which we can highlight the pandemic that has devastated the entire globe.  Therefore, if you are going to continue working from home and have a <strong>Linux based PC<\/strong>there are applications that are considered essential.<\/p>\n<p>Keep in mind that not everyone has a computer based on the Microsoft system, Windows.  There are many users around the world who, either out of obligation or necessity, prefer to use a <strong>linux based computer<\/strong>.  Here you can choose from a multitude of proposals in the form of distributions, most of them free.  But whatever our choice, the truth is that the applications that we are going to install and use here are usually mostly common.<\/p>\n<p>Even more so if we focus on the most common and used titles in this type of open source operating system.  We tell you all this because next we are going to talk about a series of Open Source programs that are going to be very useful when it comes to <strong>telecommute on a Linux computer<\/strong>.  Therefore, we will talk about free applications that will be of great help to you to work from home without any problem.<\/p>\n<h2>Open Source programs for remote working on Linux<\/h2>\n<p>It is true that there are many software proposals available for this type of work, but here we are going to talk about some of the most popular and used ones.  This will allow us to work from home comfortably and <strong>share this work with the rest of the classmates<\/strong>.<\/p>\n<p style=\"display:inline-block; width:100%;\"><strong>jitsi<\/strong>: here we find software that connects us directly with others.  When teleworking we need tools focused on the <strong>chat<\/strong> and to perform <strong>videoconferences<\/strong> on our Linux machine.  It is characterized by being very simple and easy to configure and use.  Thus, we generate a URL that we share with colleagues to act as a meeting room.<\/p>\n<p><strong>nextcloud<\/strong>: this is an Open Source software that allows us to create our own <strong>personal cloud to save files<\/strong> own remotely.  In addition, we can take a look at them via the web or from the installed applications.  Likewise, we will have the opportunity to easily share these files with the rest of our colleagues, all of this in a secure manner.  In this way we will have the possibility of storing and sharing all kinds of content while we telework<\/p>\n<p><strong>etherpad<\/strong>: on many occasions when working from home we do it with text documents.  This is precisely where Etherpad comes into play, a tool for sharing documents or working by taking <strong>shared notes<\/strong> of meetings.  It works like a <strong>shared text editor<\/strong> to which we can invite others and see the changes at that very moment.<\/p>\n<p><strong>Drawpile<\/strong>: sharing content of all kinds in teleworking is very important, including drawings.  In this program we find a <strong>virtual whiteboard<\/strong> that appears on the screen to use it in collaborative mode.  Drawpile is a real-time group drawing application where we can <strong>organize drawing sessions and invite virtual colleagues<\/strong>.  All this is carried out in a simple and at the same time intuitive way.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Over the last few months we have seen how teleworking has spread significantly at the business level. There are several reasons for all this, among which we can highlight the pandemic that has devastated the entire globe. Therefore, if you are going to continue working from home and have a Linux based PCthere are applications [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1160,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1158"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1158"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1158\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1160"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1158"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1158"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1158"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}