{"id":1161,"date":"2022-05-20T15:57:55","date_gmt":"2022-05-20T15:57:55","guid":{"rendered":"https:\/\/why-what-who.com\/after-the-extortion-of-a-hacker-a-pirate-iptv-faces-a-millionaire-fine\/"},"modified":"2022-05-20T15:57:55","modified_gmt":"2022-05-20T15:57:55","slug":"after-the-extortion-of-a-hacker-a-pirate-iptv-faces-a-millionaire-fine","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/after-the-extortion-of-a-hacker-a-pirate-iptv-faces-a-millionaire-fine\/","title":{"rendered":"After the extortion of a hacker, a pirate IPTV faces a millionaire fine"},"content":{"rendered":"<p>This is the story of PrimeStreams and how they seek compensation against them that could be historic and in the tens of millions of dollars.<\/p>\n<h2>The complaint against PrimeStreams<\/h2>\n<p>In a lawsuit filed in a Kentucky court this month, the American network <strong>DISH Network<\/strong> and streaming platform Sling TV are accusing PrimeStreams of infringing their rights on a massive scale through its internet &#8220;broadcasting&#8221; operations.  DISH, through its technology partner NegaStar, are one of the most active agents in the persecution of pirated IPTV and this month they requested a sentence of 585 million dollars in damages for a man who operated and sold these services.<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1614885\" class=\"wp-caption-text\">United States vs Pirate IPTV<\/p>\n<p>The complaint names Daniel Scroggins, Steven Daugherty (as co-owners of PrimeStreams), and the corporate entity Dscroggs Investments LLC as defendants, citing <strong>large-scale violations of the Federal Communications Act <\/strong>(FCA) and the DMCA (Digital Age Copyright Act).<\/p>\n<p>&#8220;Defendants provide an unlawful streaming service known as PrimeStreams that allows users to access, without authorization, Internet communications of plaintiffs&#8217; television programming that were acquired by circumventing security measures implemented by plaintiffs,&#8221; it reads. on the demand.<\/p>\n<p>The service operated on various domains, including <strong>primestreams.tv, primestreamstv.com and primehosting.one<\/strong>.  The service was marketed and sold to users through these domains and through promotion on social media platforms.<\/p>\n<p>“PrimeStreams was advertised as a subscription streaming service that provides over 3,000 channels, movies on demand, pay-per-view events and sports programming, among other content, all for one low monthly fee.”<\/p>\n<p>For all this, DISH has asked the defendants for compensation that could be historic.  Determining an exact figure for damages is impossible at this stage given the available information, but by combining the alleged FCA and DMCA violations, they could easily be<strong> tens of millions of dollars<\/strong>.<\/p>\n<h2>The previous computer hack<\/h2>\n<p>This legal problem of PrimeStreams is not the first big incident that takes place in their career as operators of a pirate IPTV.  In late 2019, the IPTV provider found itself extorted by a hacker who claimed to have obtained the details of around 121,000 of its subscribers.  PrimeStreams customers were informed immediately to avoid major disasters, especially with the possession of payment data by this hacker.<\/p>\n<p> <img viewbox=\"0 0 3 2\" aria-describedby=\"caption-attachment-1649049\" loading=\"lazy\" class=\"size-large wp-image-1649049\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653062275_388_After-the-extortion-of-a-hacker-a-pirate-IPTV-faces.jpg\" alt=\"Pirate IPTV\" width=\"715\" height=\"374\"\/><\/p>\n<p id=\"caption-attachment-1649049\" class=\"wp-caption-text\">Pirate IPTV<\/p>\n<p>The attacker exploited a password in the service&#8217;s billing panel and then informed the service through its own ticketing system about what had happened.  This extortion attempt included a <strong>$70,000 ransom demand in Bitcoins, 10 BTC<\/strong> by then.<\/p>\n<p>The PrimeStreams operator acted responsibly and did not try to hide anything from its customers.  Knowing that the information would probably be leaked anyway, he took full responsibility for the intrusion, although he is not known to have paid any such extortion.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This is the story of PrimeStreams and how they seek compensation against them that could be historic and in the tens of millions of dollars. The complaint against PrimeStreams In a lawsuit filed in a Kentucky court this month, the American network DISH Network and streaming platform Sling TV are accusing PrimeStreams of infringing their [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1164,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1161"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1161"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1161\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1164"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1161"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1161"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1161"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}