{"id":121,"date":"2022-05-09T09:48:05","date_gmt":"2022-05-09T09:48:05","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/09\/the-new-website-of-the-windows-microsoft-store-encourages-you-to-use-it-more\/"},"modified":"2022-05-18T15:53:23","modified_gmt":"2022-05-18T15:53:23","slug":"the-new-website-of-the-windows-microsoft-store-encourages-you-to-use-it-more","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/the-new-website-of-the-windows-microsoft-store-encourages-you-to-use-it-more\/","title":{"rendered":"The new website of the Windows Microsoft Store encourages you to use it more"},"content":{"rendered":"<p>As in most operating systems, the official store of each one is a key element.  Obviously this is extensible to the most recent Microsoft systems.  Now we are going to focus on the new web version of the official store that we can find at <strong>Windows 11<\/strong>.<\/p>\n<p>Despite the efforts and work of the software giant, this is an element that has not had the expected success since its appearance.  Keep in mind that the Microsoft Store is something that has been available to Windows users for a long time.  However, at the moment it is not even close to comparable to the usability and success of the store of other operating systems such as <strong>Android<\/strong> either <strong>iOS<\/strong>.  With everything and with it, those from Redmond continue to work on improving this element now with the new Windows 11.<\/p>\n<p>Among the improvements that are gradually being introduced here, Microsoft is bringing all kinds of applications, whether native to the platform or not, to its official Windows store.  At the same time, its aim is to provide an environment and interface that provides a quick and easy experience for browsing, installing and updating applications.  This tool as such is found installed by default in the operating system.  But with everything and with it there are users who prefer <strong>use the Microsoft Store web interface<\/strong>.<\/p>\n<p>There are many reasons why in certain circumstances it will be more comfortable or interesting for us to use this version of the store.  Well, at this point we are going to tell you that right now we will find a new Microsoft website for all of this.  As you can imagine, this will allow us <strong>find and download software directly from the browser<\/strong>.<\/p>\n<h2>The Microsoft Store website improves its functionality<\/h2>\n<p>It must be said that Microsoft has been working on a <strong>new web-based store<\/strong> for Windows 11. This is a new version of the Internet portal that has been launched recently and it focuses on several points.  First of all, it offers a much better experience than the classic web store both functionally and visually.  You can access it through its new URL.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>It is worth mentioning that the new store called <strong>Windows Apps<\/strong> It has the same goal as the native app.  We refer to the fact that it aims to help us explore content for the system, download and install it.  It is also useful when we need to discover links through a search engine, for example.  In addition, the new design is closer to Windows 11 and follows the path of <strong>fluent design<\/strong>.  This is seen in the use of rounded corners or minimalist icons.<\/p>\n<p>However, we must know that <strong>no support for dark mode<\/strong>, although it could arrive in later versions of the store.  Unlike the classic web store, the new Microsoft Store <strong>does not allow to see certain information of the apps<\/strong> such as the last update date or the release date.  Yes it shows the descriptions of the different titles, reviews, ratings and <strong>screenshots<\/strong>.<\/p>\n<p>We also have a button to install these programs and download the application through a new pop-up window.  It is worth knowing that this new website offers direct access to <strong>traditional desktop applications<\/strong>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As in most operating systems, the official store of each one is a key element. Obviously this is extensible to the most recent Microsoft systems. Now we are going to focus on the new web version of the official store that we can find at Windows 11. Despite the efforts and work of the software [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":123,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/121"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=121"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/121\/revisions"}],"predecessor-version":[{"id":877,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/121\/revisions\/877"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/123"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=121"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=121"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=121"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}