{"id":127,"date":"2022-05-09T15:35:52","date_gmt":"2022-05-09T15:35:52","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/09\/in-these-2-spanish-cities-the-gps-will-fail-you-more-than-in-the-others\/"},"modified":"2022-05-18T15:53:23","modified_gmt":"2022-05-18T15:53:23","slug":"in-these-2-spanish-cities-the-gps-will-fail-you-more-than-in-the-others","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/in-these-2-spanish-cities-the-gps-will-fail-you-more-than-in-the-others\/","title":{"rendered":"In these 2 Spanish cities the GPS will fail you more than in the others"},"content":{"rendered":"<p>Gone are the days when the only way to guide us through a big city was to use a paper map.  Since GPS technology is available to everyone, it is much simpler, since we only need to have a device with internet access to be able to guide us, whether on foot, by bicycle or by car.  As a general rule, it is difficult to have problems using this technology, <strong>but there are two Spanish cities where the GPS fails more than in any other<\/strong>.<\/p>\n<p>If we visit a city for the first time, or simply want to see what is the easiest route to reach our destination, most of us use applications such as Google Maps, where it is very easy to create a route in just a few seconds.  As we say, the operation of this type of service usually goes well anywhere, but a study by Confused.com shows that there are <strong>some European cities with significant connectivity &#8220;holes&#8221;<\/strong>.<\/p>\n<h2>An easily lost GPS signal<\/h2>\n<p>This study gives each city a score from 0 to 100 based on the number of navigation errors that may exist in it. <strong>216 cities around the world have participated in the study<\/strong>, and have taken into account several factors that can contribute to the safety and duration of the trip, as well as access to real-time traffic and map applications.  The parameters to be taken into account were <strong>the number of GPS failures<\/strong>, <strong>internet download speed<\/strong> Y <strong>internet latency<\/strong>.<\/p>\n<p><strong>The city that has left the worst stop in this regard has been Sofia<\/strong>, the capital of Bulgaria.  This city has obtained a score of 91.97, the highest of all.  The most curious thing about this note is that it is very high despite not being one of the cities that has recorded the most GPS failures.  Sofia only registered 37 GPS failures during a period of 3 months, a figure significantly lower than those registered for example in Helsinki during the same period of time (it is the 9th on the list).  The real problem in this city, as is logical, lies in the speed of the Internet and its latency, which can exceed 200 ms.<\/p>\n<h2>Barcelona and Madrid are very high in the ranking<\/h2>\n<p>Turning to the cities of our country, unfortunately we have two that are in fact very high in this ranking.  Without going any further, the second city of those that have participated in the study that registers more problems when using the GPS is <strong>Barcelona<\/strong>.  Compared to Sofia, Barcelona sees much more GPS failures over the same 3-month period, though luckily it has a much higher speed and less latency.<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1639611\" class=\"wp-caption-text\">The 15 cities with the most GPS failures (Confused.com).<\/p>\n<p>The other city that is also in this ranking is <strong>Madrid<\/strong>, although this time it is somewhat lower (specifically, in sixth position).  In the case of the capital, we can see how practically the same failures were recorded as in Sofia, but, as in Barcelona, ​​both speed and latency are much better.  It should be noted that although there are only 4 positions difference between Barcelona and Madrid, the score between the two is quite different: <strong>the 90.83 points obtained by Barcelona are far from the 73.60 of Madrid<\/strong>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Gone are the days when the only way to guide us through a big city was to use a paper map. Since GPS technology is available to everyone, it is much simpler, since we only need to have a device with internet access to be able to guide us, whether on foot, by bicycle or [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":129,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/127"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=127"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/127\/revisions"}],"predecessor-version":[{"id":876,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/127\/revisions\/876"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/129"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=127"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=127"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=127"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}