{"id":144,"date":"2022-05-10T04:51:31","date_gmt":"2022-05-10T04:51:31","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/10\/activate-this-function-and-your-connections-in-anydesk-will-be-more-secure\/"},"modified":"2022-05-18T15:53:23","modified_gmt":"2022-05-18T15:53:23","slug":"activate-this-function-and-your-connections-in-anydesk-will-be-more-secure","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/activate-this-function-and-your-connections-in-anydesk-will-be-more-secure\/","title":{"rendered":"Activate this function and your connections in AnyDesk will be more secure"},"content":{"rendered":"<p>Years ago, when a family member or friend had a <strong>computer problem<\/strong>, we had to go to his house to try to fix it.  But on many occasions this will no longer be necessary thanks to the type of programs that we will talk about here.  The aforementioned AnyDesk is one of them, in fact, it could be considered one of the most popular in the sector, a trust that has been earned over time.  We can use the <strong>portable or installable version<\/strong> of the application to make remote connections with any other computer in the world.<\/p>\n<p>In this way and in a personalized way, we will be able to have control over other equipment remotely without leaving our seat.  But as we mentioned before and it is not difficult to imagine, here the <strong>security and privacy<\/strong> are key elements.  We must bear in mind that in these connections we handle and share an enormous amount of sensitive information.  In addition, a potential attacker could take control of said connection, with all the problems that this would entail.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>Precisely for all this, this type of program, as with AnyDesk, tries to help us and protect us.  So we can establish a series of <strong>access keys for each connection<\/strong>personalize the contents that we can use, deactivate the <strong>file sharing<\/strong> and other objects etc<\/p>\n<h2>Protect your connections in AnyDesk with this change<\/h2>\n<p>In fact, in these same lines we are going to talk about a function that is deactivated by default and that will allow us to protect our sessions here in a much more secure way.  Specifically, we are referring to the possibility of activating a <strong>two-factor authentication for our connection logins<\/strong>.  Basically what we achieve by activating this functionality is to ensure that other malicious users cannot carry out saved logins in the program.<\/p>\n<p>To be able to make these remote connections, from that moment on, a second verification and authentication system will be needed to start working with the other remote PC.  As we mentioned before, this is something that we find disabled by default in AnyDesk, but that we are going to solve.  In order to achieve what we are telling you about, we open the program in a conventional way and access its configuration window.<\/p>\n<p>On the left side of it we find a panel full of sections that we can customize in the software.  But the one that interests us in this case is the so-called Security.  Here we meet several <strong>customizable parameters<\/strong>but what interests us in this case is found in the section on <strong>permissions<\/strong>.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-741633\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652158291_874_Activate-this-function-and-your-connections-in-AnyDesk-will-be.jpg\" alt=\"anydesk permissions\" width=\"1000\" height=\"486\"  \/><\/p>\n<p>As we can see, the default feature is disabled, so the first thing we do is mark the corresponding selector.  In addition, we can <strong>enable this two-factor authentication for saved logins<\/strong> and for the <strong>passwords<\/strong> short term.  This ensures that other malicious users can initiate remote connection sessions without our permission.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Years ago, when a family member or friend had a computer problem, we had to go to his house to try to fix it. But on many occasions this will no longer be necessary thanks to the type of programs that we will talk about here. The aforementioned AnyDesk is one of them, in fact, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":147,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/144"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=144"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/144\/revisions"}],"predecessor-version":[{"id":873,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/144\/revisions\/873"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/147"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=144"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=144"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=144"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}