{"id":148,"date":"2022-05-10T08:31:27","date_gmt":"2022-05-10T08:31:27","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/10\/these-are-the-5-cryptocurrencies-to-follow-in-may\/"},"modified":"2022-05-18T15:53:23","modified_gmt":"2022-05-18T15:53:23","slug":"these-are-the-5-cryptocurrencies-to-follow-in-may","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/these-are-the-5-cryptocurrencies-to-follow-in-may\/","title":{"rendered":"These are the 5 cryptocurrencies to follow in May"},"content":{"rendered":"<p>As soon as you understand the cryptocurrency market, you will know that Bitcoin is the main of these currencies, and although there are others that are gradually beginning to achieve more value, the truth is that this is always on the lips of the main experts in the matter.  Currently, this crypto is not having its best moment with a value that is well below what was expected, <strong>largely due to the general bearish trend of the market<\/strong>.  However, not all of these cryptocurrencies are experiencing declines, and in fact there are 5 that could have a very promising month of May.<\/p>\n<p>The cryptocurrency market is like any other stock market, which means that it is susceptible to variations of all kinds caused by some type of event worldwide or within the market itself.  BTC hit its all-time high last year, but since then <strong>started a fairly steep decline<\/strong> and that it seems that, at least for now, it will continue to be its trend.<\/p>\n<h2>Bitcoin down<\/h2>\n<p>As we said a bit above, the market is currently in a downtrend after being hit from the US.  The chairman of the US Federal Reserve announced last week <strong>an increase in interest rates<\/strong>.  It seems that this increase in interest rates will not exceed 0.75 points, something that seems insufficient due to the high inflation that is taking place worldwide.<\/p>\n<p>This decision seems to have not sat well with Bitcoin.  The value of the coin has dipped below $35,000 again, and it looks like this is just the beginning.  In fact, this drop in value has not only affected BTC, but we have been able to see a general drop in the entire market.  Since the Federal Reserve announcement, the cryptocurrency market is estimated to have lost <strong>more than 100,000 million dollars of value in just 48 hours<\/strong>.<\/p>\n<p>   <\/p>\n<p id=\"caption-attachment-1638579\" class=\"wp-caption-text\">Evolution of the BTC\/USD value in the last 7 days.<\/p>\n<h2>The 5 most promising cryptocurrencies of May<\/h2>\n<p>Of course, it wasn&#8217;t all going to be bad news.  Despite this very negative trend in the cryptocurrency market,<strong> there are 5 that are worth keeping in mind during this month of May<\/strong>.  This is nothing new: whenever there is such a general downward movement in the market, there are some cryptocurrencies that manage to “escape” and reverse this trend in value.<\/p>\n<p>The first one is not exactly unknown. <strong>ethereum<\/strong> It seems to be one of the main candidates to have a great month of May, thanks mainly to the change of the network to Proof of Stake, known as Ethereum 2.0.  If this change occurs without any mishap, <strong>could hit new all-time highs<\/strong>.  Another one that should also change the current trend in the coming days and weeks would be <strong>Moon<\/strong>.<\/p>\n<p><strong>To these two cryptocurrencies we have to add Solana and Cardano<\/strong>.  The case of these two cryptos is curious, as they are currently trading around 70% below their all-time highs, so now would certainly be a good time to get into them. <strong>We close this list with Tron (TRX)<\/strong>one of the few cryptocurrencies that has managed to withstand the pull in recent days and that in fact has risen more than 30% in value in the last month.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As soon as you understand the cryptocurrency market, you will know that Bitcoin is the main of these currencies, and although there are others that are gradually beginning to achieve more value, the truth is that this is always on the lips of the main experts in the matter. Currently, this crypto is not having [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":150,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/148"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=148"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/148\/revisions"}],"predecessor-version":[{"id":872,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/148\/revisions\/872"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/150"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=148"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=148"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=148"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}