{"id":157,"date":"2022-05-10T11:51:44","date_gmt":"2022-05-10T11:51:44","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/10\/024-against-suicide\/"},"modified":"2022-05-18T15:53:23","modified_gmt":"2022-05-18T15:53:23","slug":"024-against-suicide","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/024-against-suicide\/","title":{"rendered":"024 against suicide"},"content":{"rendered":"<p>Mental health has been gaining importance in recent years, especially after the start of the pandemic.  Giving all Spanish citizens the possibility of accessing care and attention for her seems fundamental, and although there is still a long way to go before it can be considered “sufficient”, the truth is that we are on the right track. <strong>Spain today presents its new number 024<\/strong>and we tell you more about him.<\/p>\n<p>Today, May 9, has been the day chosen by the Ministry of Health to officially present 024, a totally free telephone number that is <strong>designed to serve all those at risk of suicide<\/strong> and offer them effective and real help.  The phone will be fully managed by the Red Cross, and will be available to everyone very soon.<\/p>\n<h2>This is number 024: free and confidential<\/h2>\n<p>The creation of this new number was already established in a Resolution of December 9, 2021 that we can see in the BOE.  The most remarkable thing about this issue is that <strong>will ensure prompt attention<\/strong> and without the need for any prior registration or similar.  For practical purposes, it can be said that this new 024 number can be used like many other free or 900 numbers that we have available in our country.<\/p>\n<p>The people who will be in charge of carrying out the service will be at all times <strong>specialized personnel with multidisciplinary profiles<\/strong> and experts in handling these situations.  According to the Resolution itself, this will allow the experts to be able to act according to the type of situation that they know of in each call, and in addition they will also have the possibility of providing the necessary information to access other specialized health services.<\/p>\n<p>Another very important detail to keep in mind about 024 is that it is <strong>a totally confidential number. <\/strong>Both this type of healthcare and other face-to-face channels are sometimes &#8220;avoided&#8221; precisely for fear of giving personal details and that these may be made public in some way.  In addition, as we have said above, the number is completely free, and in these calls there may not be, in any case, advertising, entertainment, marketing, sale or use of the call for the future sale of commercial services.<\/p>\n<h2>The importance of mental health<\/h2>\n<p>The next commissioning of this phone 024 <strong>It is a great movement of the Spanish government<\/strong>.  Unfortunately, suicides in our country have been increasing in recent years, especially after the pandemic.  Ensuring access to all Spanish citizens who need it to medical attention as immediate as picking up the phone and dialing is key to trying to reduce those numbers drastically.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Mental health has been gaining importance in recent years, especially after the start of the pandemic. Giving all Spanish citizens the possibility of accessing care and attention for her seems fundamental, and although there is still a long way to go before it can be considered “sufficient”, the truth is that we are on the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":158,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/157"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=157"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/157\/revisions"}],"predecessor-version":[{"id":870,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/157\/revisions\/870"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/158"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=157"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=157"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=157"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}