{"id":162,"date":"2022-05-10T11:54:07","date_gmt":"2022-05-10T11:54:07","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/10\/before-creating-games-in-rpg-maker-check-if-your-pc-has-this-ram-and-cpu\/"},"modified":"2022-05-18T15:53:23","modified_gmt":"2022-05-18T15:53:23","slug":"before-creating-games-in-rpg-maker-check-if-your-pc-has-this-ram-and-cpu","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/before-creating-games-in-rpg-maker-check-if-your-pc-has-this-ram-and-cpu\/","title":{"rendered":"Before creating games in RPG Maker, check if your PC has this RAM and CPU"},"content":{"rendered":"<p>With the passage of time, technology is advancing, something that directly affects the software we have.  All this provides us with different platforms and programs that, among other things, allow us and facilitate the development of our own projects.  For example, <strong>RPG Maker<\/strong> It is a perfect solution if we want to enter the exciting world of game creation.<\/p>\n<p>Here we are going to find all the necessary tools to be able to start up <strong>own projects that in the future become video games<\/strong>.  In fact, this is not the only proposal we find for this type of work.  There are others that are well known and have been in widespread use for a long time, such as <strong>Unity<\/strong> either <strong>Unreal Engine<\/strong>.  Some time ago, to carry out these developments that we mentioned, it was essential to have a deep knowledge of some programming languages.<\/p>\n<p>Both high-level and low-level languages ​​were included here, which greatly complicated the whole thing.  However, thanks to current technology we have the possibility of obtaining very attractive results without typing a single line of code.  This means that both advanced users and novice users will be able to enter this exciting world.  But of course, we must bear in mind that all this type of work requires a certain number of requirements on our computer.<\/p>\n<p>At this point we will say that along these same lines we want to focus on the proposal offered by the aforementioned RPG Maker platform.  Therefore, before starting to work on this type of project, we should take into consideration the potential of our computer in order to <strong>get an optimal experience<\/strong>.<\/p>\n<h2>RPG Maker hardware requirements to create games<\/h2>\n<p>First of all, we must bear in mind that the heads of this development platform try to adapt to the majority of users.  This means that a good part of the current teams are trained so that we can work in an acceptable way with this environment for the <strong>video game creation<\/strong>.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>But not everyone has enough hardware on their PC to work comfortably and acceptably with all of this.  Therefore, next, we will show you what are the <strong>minimum requirements<\/strong> by RPG Maker owners.  At the same time, we must also keep in mind that we can take advantage of this method on both Windows-based and macOS-based computers.  These are the minimum requirements:<\/p>\n<ul>\n<li><strong>Intel Core i3 processor<\/strong> fourth generation or higher.<\/li>\n<li>Amount of <strong>RAM of at least 8 gigabytes<\/strong>.<\/li>\n<li><strong>GPU<\/strong> OpenGL compatible and more than a gigabyte of RAM.<\/li>\n<li>4 gigabytes, at least, of <strong>Available space<\/strong> on disk.<\/li>\n<li>It is recommended to work with a screen that supports <strong>resolutions starting at 1280 x 768<\/strong> points.<\/li>\n<\/ul>\n<p>As is the case with most current software, we must know that these are the minimum requirements to be met in order to work with RPG Maker.  However, to obtain an acceptable experience we should go one step further in the demands <strong>hardware<\/strong> from our computer.  Usually these minimum requirements are also used by other programs at the same time, which can harm our game development work here.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>With the passage of time, technology is advancing, something that directly affects the software we have. All this provides us with different platforms and programs that, among other things, allow us and facilitate the development of our own projects. For example, RPG Maker It is a perfect solution if we want to enter the exciting [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":164,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/162"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=162"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/162\/revisions"}],"predecessor-version":[{"id":869,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/162\/revisions\/869"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/164"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=162"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=162"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=162"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}