{"id":1644,"date":"2022-05-20T19:09:35","date_gmt":"2022-05-20T19:09:35","guid":{"rendered":"https:\/\/why-what-who.com\/disable-smatscreen-remove-alert-that-prevents-opening-downloaded-files\/"},"modified":"2022-05-20T19:09:35","modified_gmt":"2022-05-20T19:09:35","slug":"disable-smatscreen-remove-alert-that-prevents-opening-downloaded-files","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/disable-smatscreen-remove-alert-that-prevents-opening-downloaded-files\/","title":{"rendered":"Disable SmatScreen &#8211; Remove alert that prevents opening downloaded files"},"content":{"rendered":"<p>For this reason, today we are going to learn a little more about what this security filter consists of and how it works.  In case we need to disable it, we can also do it in different ways, either by accessing the Windows Defender Security Center, such as from the Local Group Policy Editor or the Windows Registry Editor.<\/p>\n<h2>What is SmartScreen Filter<\/h2>\n<p>The SmartScreen Filter works as a <strong>alert system<\/strong> which is responsible for automatically analyzing all the files on our system, the programs, the digital signature of all the applications we download and the websites we visit.  To do this, it uses a large database containing whitelisted and blacklisted items to analyze whether something can be opened safely.  In this way, it allows us to decide if it is a reliable application or, on the contrary, it could be a threat to our security.<\/p>\n<p>It usually works like a <strong>additional security layer<\/strong> for our system that is responsible for checking everything that happens in it regardless of whether we have other security applications installed.  This security layer is completely invisible, runs in the background and does not affect system operation or performance.  When it is displayed, it does so through a large blue box that indicates that “Windows protected your PC” by blocking a program or a website.<\/p>\n<p>If it is a program, we will usually have the option to “Run anyway”, in case we are sure that it does not present risks.  If SmartScreen appears when we visit a website that we know to be safe, you can click &#8220;More Info&#8221; and mark it as a safe website.  It is generally a useful security layer, however it can sometimes <strong>prevent us from downloading content or prevent us from visiting a website<\/strong> that we know is safe but that it is not verified, so in this case we can choose to deactivate it.<\/p>\n<h2>Ways to disable this security filter<\/h2>\n<p>If we want to temporarily or permanently disable the SmartScreen filter in Windows 10 or Windows 11, we have different ways to do it.<\/p>\n<h3>Use Windows Defender Security Center<\/h3>\n<p>If we want to have access to the Windows security options, we can find them grouped within Windows Defender, so from here we can access the SmartScreen filter.  To access it, simply use the Start menu search engine and type Windows Security.<\/p>\n<p>Once we have accessed, in the left column click on “Application and browser control”.  Next, in the right column, in the “Reputation-based protection” section, click on <strong>&#8220;Reputation-Based Protection Settings&#8221;<\/strong>.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>In the new screen that appears we can see the different layers of security that SmartScreen offers us to protect our files and that we can deactivate and reactivate when we need it.<\/p>\n<ul>\n<li><strong>Check Apps and files<\/strong>.  It analyzes all the applications and files on our computer and warns us when any of them could be dangerous.<\/li>\n<li><strong>SmartScreen for Microsoft Edge<\/strong>.  It protects our browsing and helps protect us from both malicious websites and dangerous downloads.<\/li>\n<li><strong>SmartScreen for apps from the Microsoft Store<\/strong>.  It helps us avoid downloading malware from the Windows Store.<\/li>\n<li><strong>Block potentially unwanted applications<\/strong>.  Protects the system from applications with a bad reputation that can cause unexpected problems.  It allows us to block both applications and downloads.<\/li>\n<\/ul>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-733947 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653073775_94_Disable-SmatScreen-Remove-alert-that-prevents-opening-downloaded-files.jpg\" alt=\"Turn off SmartScreen Options\" width=\"920\" height=\"484\"  \/><\/p>\n<p>All these options are usually activated by default, so if we want to deactivate them, just click on the button where it says Activated and it will become Deactivated for each function that we indicate.  At any time we can click the switch again and mark it as On again.<\/p>\n<h3>Using the Group Policy Editor<\/h3>\n<p>We can also disable SmartScreen through the Local Group Policy Editor, using different filters or permanently disabling these filters.  We can also make changes to those filters at the user level and the respective options in Windows Security will be grayed out.  This Editor is available for users with Windows 10 Pro or Enterprise and Windows 11.<\/p>\n<p>To access it, press the keyboard shortcut Windows + R to launch the Run command.  Here we write <strong>gpedit.msc<\/strong> and press Enter or the OK button.<\/p>\n<p>Once inside, we will find different group policies available that we can use to disable Windows SmartScreen filters on a case-by-case basis and that we can find by navigating through the left panel to their respective paths.<\/p>\n<p> <code class=\"code-section\"> Configuración del equipo \/ Plantillas administrativas \/ Componentes de Windows \/ SmartScreen de Windows Defender \/ Explorador \/ Configurar SmartScreen de Windows Defender <\/code> <\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-733953 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653073775_586_Disable-SmatScreen-Remove-alert-that-prevents-opening-downloaded-files.jpg\" alt=\"Configure Windows Defender SmartScreen\" width=\"920\" height=\"226\"  \/><\/p>\n<p>This policy setting turns on Microsoft Defender SmartScreen generally to check apps and files on your device.  To deactivate it, double click on it and in the next window we mark Deactivated.<\/p>\n<p> <code class=\"code-section\"> Configuración del equipo \/ Plantillas administrativas \/ Componentes de Windows \/ SmartScreen de Windows Defender \/ Explorador \/ Configurar App Install Control <\/code> <\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-733950 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653073775_15_Disable-SmatScreen-Remove-alert-that-prevents-opening-downloaded-files.jpg\" alt=\"Configure App Install Control\" width=\"920\" height=\"224\"  \/><\/p>\n<p>The purpose of this setting is to prevent malicious content from being able to affect users&#8217; devices by downloading executable content from the Internet.  It does not protect against malicious content from USB devices, network shares, or other non-Internet sources.  To deactivate it, double click on it and in the next window we mark Deactivated.<\/p>\n<p> <code class=\"code-section\"> Configuración del equipo \/ Plantillas administrativas \/ Componentes de Windows \/ SmartScreen de Windows Defender \/ Microsoft Edge \/ Configurar SmartScreen de Windows Defender <\/code> <\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-733965 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653073775_461_Disable-SmatScreen-Remove-alert-that-prevents-opening-downloaded-files.jpg\" alt=\"Configure Windows Defender SmartScreen\" width=\"920\" height=\"227\"  \/><\/p>\n<p>This policy setting turns on Microsoft Defender SmartScreen for the Microsoft Edge browser for protection against websites and downloads.  To deactivate it, double click on it and in the next window we mark Deactivated.<\/p>\n<p> <code class=\"code-section\"> Configuración del equipo \/ Plantillas administrativas \/ Componentes de Windows \/ SmartScreen de Windows Defender \/ Microsoft Edge \/ Impedir la omisión de los avisos de SmartScreen de Windows Defender para sitios <\/code> <\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-733956 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653073775_558_Disable-SmatScreen-Remove-alert-that-prevents-opening-downloaded-files.jpg\" alt=\"Prevent bypassing Windows Defender for Sites SmartScreen prompts\" width=\"920\" height=\"227\"  \/><\/p>\n<p>This policy setting prevents users from bypassing Microsoft Defender SmartScreen warnings about potentially malicious sites.  If we enable this setting, it prevents employees from bypassing the warning, which prevents them from going to the site.<\/p>\n<h3>Using Registry Editor<\/h3>\n<p>Another method that we have available to disable SmartScreen is to use the Windows Registry Editor.  In order to access it, we are going to first press the Windows + R key combination. Here we write <strong>regedit<\/strong> and press Enter or the OK button.<\/p>\n<p>Later we will navigate to the following route:<\/p>\n<p> <code class=\"code-section\"> HKEY_LOCAL_MACHINE \/ SOFTWARE \/ Policies \/ Microsoft \/ Windows \/ System <\/code> <\/p>\n<p>Once here, we right-click and select<strong> New and Value DWORD (32-bit)<\/strong> and we give it a name <strong>EnableSmartScreen<\/strong>.  We double click on the created value and configure the Value data section by typing 0 to deactivate SmartScreen.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-733974 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653073775_154_Disable-SmatScreen-Remove-alert-that-prevents-opening-downloaded-files.jpg\" alt=\"EnableSmartScreen Registry Editor\" width=\"900\" height=\"496\"  \/><\/p>\n<p>Next, we right-click again and select<strong> New and String Value<\/strong>.  name we put <strong>ShellSmartScreenLevel<\/strong> and double click on it.  Now in the new string value, within the Value information section we write Warn (Warning) or Block (Block) according to our preferences.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-733977 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653073775_663_Disable-SmatScreen-Remove-alert-that-prevents-opening-downloaded-files.jpg\" alt=\"ShellSmartScreenLevel Registry Editor\" width=\"900\" height=\"496\"  \/><\/p>\n<p>By using Warn it will show us a SmartScreen warning message which we can ignore and if we use Block it will show us a warning message and also prevent us from running the app or file manually.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>For this reason, today we are going to learn a little more about what this security filter consists of and how it works. In case we need to disable it, we can also do it in different ways, either by accessing the Windows Defender Security Center, such as from the Local Group Policy Editor or [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1653,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1644"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1644"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1644\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1653"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1644"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1644"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1644"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}