{"id":165,"date":"2022-05-10T12:42:47","date_gmt":"2022-05-10T12:42:47","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/10\/they-ask-for-585-million-dollars-from-a-pirate-iptv\/"},"modified":"2022-05-18T15:53:23","modified_gmt":"2022-05-18T15:53:23","slug":"they-ask-for-585-million-dollars-from-a-pirate-iptv","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/they-ask-for-585-million-dollars-from-a-pirate-iptv\/","title":{"rendered":"They ask for 585 million dollars from a pirate IPTV"},"content":{"rendered":"<p>The request has not yet been resolved, but the number of <strong>this possible sentence would be historic<\/strong>.<\/p>\n<h2>This is how the pirate IPTV business operated<\/h2>\n<p>On December 22, 2020, DISH Network, a pay television provider in the United States, together with its technology partner NegaStar, filed a lawsuit with more than 260 attached pieces of evidence against Carlos Rocha, a resident of Canada.  East,<strong> according to the complaint, was the operator and controller of SolTV and Stream Solutions,<\/strong> pirate IPTV services that offered content from said chain infringing its rights.<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1562190\" class=\"wp-caption-text\">Pirate IPTV<\/p>\n<p>According to the investigations by DISH and NegaStar, Rocha had a relationship with SET TV, a pirate IPTV service that had already been brought down by DISH previously in a lawsuit that cost the defendants 90 million dollars.  Additionally, she also had connections to Simply-TV, another service that had been sued by DISH.<\/p>\n<p>As stated in the lawsuit, Rocha, in addition to operating SolTV and Stream Solutions, <strong>also trafficked in pirated IPTV subscriptions for other services<\/strong> like BimoTV, TVStreamsNow, OneStepTV, IbexTV, MagnumStreams, Prime Tyme TV, Lazer TV Streams, Griff TV, Flix Broadcasts and CantGetEnoughTV.<\/p>\n<p>DISH said encrypted messages in its satellite transmissions confirmed that the content offered by the services was its own and that the unlawful conduct constituted massive violations of the Federal Communications Act (FCA).  Demanding $10,000 in damages for each FCA violation, with the potential to increase to an additional $100,000, DISH also sought an injunction to end Rocha&#8217;s business.<\/p>\n<h2>They ask for a sentence of 585 million for the accused<\/h2>\n<p>Last week an agreement was reached in this litigation with a most curious resolution.  This week the judgment and court order against Rocha appeared stating that he operated, participated in and\/or trafficked in device codes and subscriptions for various IPTV services, including SolTV, SET TV, Simply-TV, BimoTV, TVStreamsNow, OneStepTV , IbexTV, MagnumStreams, Prime Tyme TV, Lazer TV Streams, Griff TV, Flix Streams, and CantGetEnoughTV.<\/p>\n<p> <img viewbox=\"0 0 3 2\" aria-describedby=\"caption-attachment-1426782\" loading=\"lazy\" class=\"size-large wp-image-1426782\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652186567_203_They-ask-for-585-million-dollars-from-a-pirate-IPTV.jpg\" alt=\"IPTV trial\" width=\"715\" height=\"374\"  \/><\/p>\n<p id=\"caption-attachment-1426782\" class=\"wp-caption-text\">Trial for sale of pirate IPTV<\/p>\n<p>The defendant agreed to be liable for statutory damages.<strong> The motion asks the court for damages worth more than 585 million dollars<\/strong> under the provisions of the FCA and issue a permanent injunction to prevent any future conduct that may infringe DISH&#8217;s rights.<\/p>\n<p>If the court approves this unprecedented ruling, it will be known in the next few days, but it seems quite likely that Rocha does not have half a billion in cash.  The amount seems disproportionate, not only because of Rocha&#8217;s turnover, but also because <strong>the entire US pirate IPTV market is valued at $1 billion<\/strong> (as of 2020).<\/p>\n<p>A common feature of DISH&#8217;s lawsuits against IPTV providers and similar entities is how they keep showing up in subsequent and parallel investigations.  The company likes to connect the dots and the lawsuits make it possible.  Recidivism with them can be dangerous.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The request has not yet been resolved, but the number of this possible sentence would be historic. This is how the pirate IPTV business operated On December 22, 2020, DISH Network, a pay television provider in the United States, together with its technology partner NegaStar, filed a lawsuit with more than 260 attached pieces of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":168,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/165"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=165"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/165\/revisions"}],"predecessor-version":[{"id":868,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/165\/revisions\/868"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/168"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=165"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=165"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=165"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}