{"id":1663,"date":"2022-05-20T23:06:47","date_gmt":"2022-05-20T23:06:47","guid":{"rendered":"https:\/\/why-what-who.com\/do-you-know-unix-these-revamped-commands-replace-yours\/"},"modified":"2022-05-20T23:06:47","modified_gmt":"2022-05-20T23:06:47","slug":"do-you-know-unix-these-revamped-commands-replace-yours","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/do-you-know-unix-these-revamped-commands-replace-yours\/","title":{"rendered":"Do you know Unix?  These revamped commands replace yours"},"content":{"rendered":"<p>Depending on the type of use that we intend to make of our computer, we can opt for one operating system or another.  The usual thing is to use Windows, but for certain tasks we can opt for <strong>Unix<\/strong>software that we will precisely talk about next.<\/p>\n<p>We must bear in mind that here we are dealing with a powerful operating system that began to be developed in the late 1960s and early 1970s. Later, the different Linux distributions began to be launched that were based precisely on this system that we are commenting on.  As a curiosity, we will tell you that GNU\/Linux was born from the union of two Unix-based projects.  On the one hand, we find <strong>The GNU Project<\/strong> by Richard Stallman and the Kernel by Linus Torvalds.<\/p>\n<p>One of his main goals was to develop an operating system similar to Unix, but without its original code.  In this way this would give the possibility to its creators to distribute it freely.  Once we are clear about the differences between both models, it is worth mentioning that in these lines we want to focus on the original system, the aforementioned Unix.  Possibly most of the regulars of these operating systems are aware that one of their strong points is the <strong>operation via commands<\/strong>.<\/p>\n<p>It is true that the graphical interface in these alternatives has grown and improved ostensibly over time.  But with everything and with it, the usual and experienced users of Unix and Linux prefer to get the most out of the system through their corresponding ones.  But as we have told you, this is a software that has been with us for a good number of years, for which many ask for a renewal.<\/p>\n<h2>Check out this program to use revamped commands on Unix<\/h2>\n<p>We tell you all this because next we are going to talk about a <strong>open source application <\/strong>and free that will serve you for all this.  This will help us to get more out of certain Unix system commands in a more up-to-date and renewed way.  Specifically, we are talking about the software called <strong>Modern Unix<\/strong> that offers us an extensive collection of faster and more current alternatives to the most common commands of the aforementioned Unix.  In addition, as we say, you will get all this without having to pay a single euro.<\/p>\n<p>And it is worth noting that Modern Unix is ​​available on its corresponding page of the development platform <strong>GitHub<\/strong>.  For the developers of this application that we are telling you about, the proposals in the form of commands that they offer us here are the future of the operating system.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>In addition, they give us the opportunity to <strong>use the software in an easier way<\/strong> and intuitive.  As you can imagine this will be very useful for those users who are not very experienced in the use of Unix.  It also offers us a new way of moving around the different disk locations used here.  Therefore, we could say that this open source tool will be of <strong>Useful for both experienced and novice users<\/strong> in the aforementioned system.<\/p>\n<p>Keep in mind that this command replacement focuses especially on the most common and used ones.  This is precisely one of its advantages, since it will allow us to be more productive and efficient in common Unix tasks.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Depending on the type of use that we intend to make of our computer, we can opt for one operating system or another. The usual thing is to use Windows, but for certain tasks we can opt for Unixsoftware that we will precisely talk about next. We must bear in mind that here we are [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1665,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1663"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1663"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1663\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1665"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1663"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1663"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1663"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}