{"id":1666,"date":"2022-05-21T00:01:04","date_gmt":"2022-05-21T00:01:04","guid":{"rendered":"https:\/\/why-what-who.com\/these-two-popular-routers-have-a-serious-security-flaw-that-will-not-be-fixed\/"},"modified":"2022-05-21T00:01:04","modified_gmt":"2022-05-21T00:01:04","slug":"these-two-popular-routers-have-a-serious-security-flaw-that-will-not-be-fixed","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/these-two-popular-routers-have-a-serious-security-flaw-that-will-not-be-fixed\/","title":{"rendered":"These two popular routers have a serious security flaw that will not be fixed"},"content":{"rendered":"<p>If we talk about technology, it is obvious that security will always be among the first concerns of manufacturers.  This concern is even greater when we talk about router manufacturers, since these devices are responsible for allowing us to connect to the Internet and, therefore, <strong>are very exposed to attacks of all kinds<\/strong>.  Occasionally, new security flaws appear for these types of devices, but they do not take long to be patched.  Except for this exception that we tell you today.<\/p>\n<p>As we say, the manufacturers of the best routers have equipment to precisely alleviate these security holes in record time.  For this, it is always important that our equipment has the most recent firmware possible, something that will save us from having the occasional scare.  The problem is in this case in <strong>two routers from the manufacturer NETGEAR<\/strong>which have a hole that, unfortunately, will not be able to be patched.<\/p>\n<h2>These are the two affected routers<\/h2>\n<p>As explained by our colleagues at Redes Zone, the two routers affected by this important security flaw are the models <strong>NETGEAR BR200<\/strong> Y <strong>NETGEAR BR500<\/strong>.  These two models are usually used above all in the business environment, and in fact have a very complete firmware that can also be configured according to the needs of each consumer.<\/p>\n<p>As we said, router manufacturers (and especially those that have lines aimed at companies) usually report security flaws in their equipment constantly, and work piecemeal until they are able to provide a solution in the form of a patch.  That these two routers have a security flaw is not the most remarkable thing, but NETGEAR itself is communicating to its customers that <strong>these errors will not be able to be solved<\/strong>.<\/p>\n<blockquote>\n<p>Due to certain technical limitations beyond our control, we are unable to fix these vulnerabilities.<\/p>\n<\/blockquote>\n<p> <\/p>\n<p id=\"caption-attachment-1669659\" class=\"wp-caption-text\">This is the mail that users are receiving (Redes Zone)<\/p>\n<p>Something quite interesting about this security flaw is that it is not easy to exploit.  To do this, NETGEAR tells us that a computer connected to one of these two routers needs to connect to a malicious website and click a link while the router&#8217;s GUI is open.  Despite the difficulty of this, a good coordinated attack could perfectly exploit this vulnerability, so <strong>these two routers have become “dangerous”<\/strong>.<\/p>\n<h2>NETGEAR is providing solutions to those affected<\/h2>\n<p>To prevent undesirables from attacking us through these vulnerabilities, NETGEAR provides some <strong>fairly &#8220;generic&#8221; advice<\/strong> that they cannot give the user too much peace of mind, such as not visiting any malicious or suspicious website to avoid phishing.<\/p>\n<p>As an alternative to this, NETGEAR is offering its users of both the BR500 and BR200 models, <strong>two different possibilities<\/strong>depending on what was the date of purchase of this:<\/p>\n<ul>\n<li>Users who have purchased one of these two models on a date after May 19, 2021 will be able to receive the SXR30 model for free at home, valued at 110 euros.<\/li>\n<li>All other users, unfortunately, will not be eligible for a free replacement device.  Of course, they will have a 50% discount to acquire the same SXR30 model.<\/li>\n<\/ul>\n<p>To request either of these two things, we must send an email to <strong>br500_br200@netgear.com<\/strong>enclosing in it the following data: device serial number, purchase invoice and our personal data.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If we talk about technology, it is obvious that security will always be among the first concerns of manufacturers. This concern is even greater when we talk about router manufacturers, since these devices are responsible for allowing us to connect to the Internet and, therefore, are very exposed to attacks of all kinds. Occasionally, new [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1668,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1666"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1666"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1666\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1668"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1666"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1666"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1666"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}