{"id":1673,"date":"2022-05-21T01:45:41","date_gmt":"2022-05-21T01:45:41","guid":{"rendered":"https:\/\/why-what-who.com\/my-new-computer-says-windows-is-not-activated-what-do-i-do\/"},"modified":"2022-05-21T01:45:41","modified_gmt":"2022-05-21T01:45:41","slug":"my-new-computer-says-windows-is-not-activated-what-do-i-do","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/my-new-computer-says-windows-is-not-activated-what-do-i-do\/","title":{"rendered":"My new computer says Windows is not activated, what do I do?"},"content":{"rendered":"<p>What the manufacturer of our PC intends with the pre-installation of the Redmond operating system is that we start working as soon as possible.  Thus, when turning on this computer that we have just acquired, for the first time, we will only have to configure the system as such.  This means that we will have to specify basic data to put the equipment into operation, such as our user account, and other basic parameters.<\/p>\n<p>This is something that we carry out in a few minutes and that will allow us to start using our new equipment almost immediately.  However, on certain occasions we may encounter some problems related to the product key.  It is important to know that, although we work with a <strong>Windows OEM<\/strong> provided by the computer manufacturer, it requires an active license.  And let&#8217;s not think that it is free, since in one way or another said manufacturer has paid for it and therefore has charged us for it.  Of course, in most cases this cost will be less than one <strong>retail license<\/strong> that we buy later.<\/p>\n<p>But the problem may be given at the moment in which the PC tells us that <strong>Windows is not activated<\/strong>.  You have to know that downloading and installing Windows for free can be done by anyone from the <strong>Microsoft official website<\/strong>.  What we really go for is the product key that helps us activate the operating system.<\/p>\n<h2>What to do if Windows is not activated on a new PC<\/h2>\n<p>With this, what we want to tell you is that the manufacturer of the computer that we have just bought should <strong>provide us with a Windows with its corresponding key<\/strong> staff.  Therefore, in the event that the Microsoft operating system tells us that it is not activated, let&#8217;s see what steps we should take.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<ul>\n<li><strong>Find the key among the documentation<\/strong>: Sometimes the equipment manufacturer provides us with that license made up of a good number of characters, among its documentation.  Thus we will only have to type that password in the <strong>Settings app<\/strong> of Windows so that the operating system is activated.<\/li>\n<li><strong>Make sure you enter the license correctly<\/strong>: sometimes we make mistakes when typing this license that we commented on.  Therefore, if Windows keeps telling us that it is not activated, first of all, we must make sure that we are entering that key correctly.<\/li>\n<li><strong>Contact the manufacturer<\/strong>: but it can also be the case that we do not find anything of this that we commented on.  Therefore, the best thing we can do in this circumstance is to contact the site where we bought the PC, or failing that, with its manufacturer.  This should give us explanations or provide us with the license of the Microsoft system that we have purchased.  Keep in mind that if the operating system with its key was included with the purchase of the PC as such, it should be specified before.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>What the manufacturer of our PC intends with the pre-installation of the Redmond operating system is that we start working as soon as possible. Thus, when turning on this computer that we have just acquired, for the first time, we will only have to configure the system as such. This means that we will have [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1675,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1673"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1673"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1673\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1675"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1673"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1673"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1673"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}