{"id":172,"date":"2022-05-10T14:38:47","date_gmt":"2022-05-10T14:38:47","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/10\/google-chrome-will-allow-capturing-websites-without-extensions-this-is-how-it-works\/"},"modified":"2022-05-18T15:53:23","modified_gmt":"2022-05-18T15:53:23","slug":"google-chrome-will-allow-capturing-websites-without-extensions-this-is-how-it-works","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/google-chrome-will-allow-capturing-websites-without-extensions-this-is-how-it-works\/","title":{"rendered":"Google Chrome will allow capturing websites without extensions: this is how it works"},"content":{"rendered":"<p>There are many reasons why we sometimes need <strong>capture a part of a web page<\/strong> that we visit from our favorite browser.  In programs like Google Chrome, we generally install an extension that allows us to do this.  However, it seems that things are going to change soon, as we are going to show you.<\/p>\n<p>This type of capture that we are talking about can be useful both at a domestic and professional level.  For example, the resulting file can be used to save an image of a section of the web.  But as we say, for all this to be effective, in the most used browser, <strong>Chrome<\/strong>, we tend to use third-party plugins.  Aware of all this, Google wants to offer us a native solution.<\/p>\n<p>We&#8217;re telling you all this because the popular search giant&#8217;s program is testing a powerful screenshot tool of its own.  This will be able to be used in desktop operating systems soon.  We are referring specifically to a new and advanced screenshot tool.  This functionality is based on the default one that you have been using for a long time. <strong>Edge<\/strong>.  If you don&#8217;t know it, the Microsoft browser has a functionality that allows us to <strong>capture certain areas of a web<\/strong> and copy them to the clipboard or edit them.<\/p>\n<p>Also, as a curiosity we will tell you that Chrome for Android also has a capture tool.  Well, Google is currently testing similar functionality in Chrome to <strong>Windows<\/strong>, <strong>macOS<\/strong> and Chrome OS.  It could even be said that this new implementation that Google will offer us is better than Microsoft&#8217;s on its Edge.  Although its main operation is very similar, there are some important differences between both capturers.<\/p>\n<h2>Try Chrome&#8217;s screenshot feature<\/h2>\n<p>It is worth mentioning that the Edge tool only allows you to use <strong>Windows Ink<\/strong> to edit the screenshot we have taken.  On the other hand, Chrome&#8217;s is included as part of the Share menu, so it opens the capture in a separate window and with its own editing controls.  Among other things, from here we can change the <strong>brush size<\/strong>choose your type, <strong>add text<\/strong> and much more.  In fact, we even have the possibility to crop the screenshots within the same browser.<\/p>\n<p>Google started testing the screenshot editor last year, but right now the project is far from complete.  The company is still working on the screenshot editing tool right now.  Therefore, let&#8217;s see how we can test this functionality that we are talking about first-hand.  You have to know that before we will have to enable it from the <strong>browser test page<\/strong>.<\/p>\n<p>In addition, we have to have Chrome Canary where we are located at the following address:<\/p>\n<p> <code class=\"code-section\">chrome:\/\/flags<\/code> <\/p>\n<p>Once here we have to enable two sections: Desktop Screenshots and Desktop Screenshots Edit Mode.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>Once this is done we can take screenshots by clicking on the <strong>share button<\/strong> from the address bar and choose Screenshot.  After that we can draw the area of ​​the screen that we want to capture and copy it to the clipboard.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-741108\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652193527_2_Google-Chrome-will-allow-capturing-websites-without-extensions-this-is.jpg\" alt=\"screenshot chrome\" width=\"637\" height=\"652\"\/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are many reasons why we sometimes need capture a part of a web page that we visit from our favorite browser. In programs like Google Chrome, we generally install an extension that allows us to do this. However, it seems that things are going to change soon, as we are going to show you. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":175,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/172"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=172"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/172\/revisions"}],"predecessor-version":[{"id":867,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/172\/revisions\/867"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/175"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=172"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=172"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=172"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}