{"id":1721,"date":"2022-05-21T08:32:02","date_gmt":"2022-05-21T08:32:02","guid":{"rendered":"https:\/\/why-what-who.com\/take-this-iphone-12-at-its-lowest-price\/"},"modified":"2022-05-21T08:32:02","modified_gmt":"2022-05-21T08:32:02","slug":"take-this-iphone-12-at-its-lowest-price","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/take-this-iphone-12-at-its-lowest-price\/","title":{"rendered":"take this iPhone 12 at its lowest price"},"content":{"rendered":"<p>You may like them more or less, but no one can doubt that <strong>Apple devices have something special<\/strong>.  The Californian company has been surprising us for years with products of quality and exquisite design, and as a general rule it is rare to buy one and then go back to using a product from another brand.  Their iPhones are always one of the best-selling phones, and there are compelling reasons for this.  If you were looking for a new iPhone, be attentive: you can take one with a great discount.<\/p>\n<p>As we told you, thanks to this great offer from Amazon we have the possibility of getting a new iPhone 12 at its lowest historical price.  We are talking about <strong>a discount of more than 130 euros<\/strong>so you shouldn&#8217;t think about it too much before throwing yourself into the offer.<\/p>\n<h2>A design that is second to none<\/h2>\n<p>One of the things that stands out most about the iPhone 12 is undoubtedly its design.  In this particular model we can see how Apple chose to manufacture a structure with straight edges that suit it very well.  The phone, which alone <strong>weighs 162 grams<\/strong>, it is very comfortable to use and allows us to interact with it with one hand without too much difficulty.  Despite the fact that it seems to be a delicate terminal for this reason, the truth is that we should not worry too much: it is very resistant and has <strong>IP68 protection<\/strong>.<\/p>\n<p>Now we have to stop at possibly one of the strengths of this iPhone 12: its screen.  This model has a <strong>6.1-inch Super Retina XDR OLED display<\/strong>.  This model changed the panel, and the change gives it a huge leap in quality in terms of image.  This screen has a resolution of 2,532 x 1170 pixels, and as we have already told you a little above, it is quite resistant thanks to the <strong>Ceramic Shield<\/strong> with which it is covered.<\/p>\n<p>   <\/p>\n<p id=\"caption-attachment-1613247\" class=\"wp-caption-text\">iPhone 12 color range.<\/p>\n<p>The change to an OLED panel will allow us to enjoy a more comfortable use both outdoors and indoors, thanks above all to <strong>fairly high brightness levels<\/strong>.  If you are someone who enjoys watching multimedia content on your phone a lot, with this iPhone 12 you will enjoy it a lot, especially with content compatible with HDR 10.<\/p>\n<h2>Power and great battery<\/h2>\n<p>In the &#8220;heart&#8221; of this Apple device we will find the <strong>A14 Bionic chip<\/strong>.  This chip also has what is known as <strong>Neural Engine<\/strong>, a system that allows our device to automatically learn how we use it to enhance its performance and efficiency.  The Apple A14 also offers a fairly large leap in quality with the previous chip, and with it we will not have any kind of problem even with the most demanding uses such as video games.  Another of the hardware advances of this iPhone 12 is that <strong>allows us to use 5G<\/strong>.  The phone comes standard with version 14 of Apple&#8217;s operating system, but we will have no problem updating it to the latest.<\/p>\n<p>We can&#8217;t say anything bad about its battery either.  This iPhone 12 has <strong>a 2,815mAh battery<\/strong>, which thanks to Apple&#8217;s optimization systems can give us up to 17 hours of video playback.  If you run out of battery you can use the <strong>20W fast charge<\/strong>thanks to which we can charge 50% of the battery in just 30 minutes.<\/p>\n<p>Finally, regarding the photographic section, this Apple smartphone presents a configuration of <strong>dual 12 MP camera<\/strong>.  We are going to find an ultra wide angle sensor (f \/ 2.4 aperture and 120 ° field of view) and a wide angle sensor (f \/ 1.6 aperture).  With this section we can also <strong>record video in 4K quality at 60 fps<\/strong>and we will even have the possibility of<strong> record with Dolby Vision<\/strong> (up to 30fps).  The front camera is also not far behind: it has a 12 MP sensor ideal for any use.<\/p>\n<p> <img viewbox=\"0 0 3 2\" aria-describedby=\"caption-attachment-1670094\" loading=\"lazy\" class=\"size-large wp-image-1670094\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653121922_698_take-this-iPhone-12-at-its-lowest-price.jpg\" alt=\"\" width=\"500\" height=\"500\"  \/><\/p>\n<p id=\"caption-attachment-1670094\" class=\"wp-caption-text\">Some features of the iPhone 12.<\/p>\n<p>The 128 GB storage version (which is the one on sale) has a usual price of 859 euros, but thanks to this offer from Amazon <strong>you can take it home for 723 euros<\/strong> in its mauve version.  The rest of the colors are also on sale, although in this case they contain a somewhat lower discount.<\/p>\n<p>The articles listed contain an affiliate link that reports to ADSLZone a small commission for each purchase.  The products that appear here have been chosen by the editors for being discounted, and their appearance here has nothing to do with any agreement with the brands.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You may like them more or less, but no one can doubt that Apple devices have something special. The Californian company has been surprising us for years with products of quality and exquisite design, and as a general rule it is rare to buy one and then go back to using a product from another [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1724,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1721"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1721"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1721\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1724"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1721"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1721"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1721"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}