{"id":1729,"date":"2022-05-21T08:51:10","date_gmt":"2022-05-21T08:51:10","guid":{"rendered":"https:\/\/why-what-who.com\/8-update-screens-to-troll-friends-or-at-work\/"},"modified":"2022-05-21T08:51:10","modified_gmt":"2022-05-21T08:51:10","slug":"8-update-screens-to-troll-friends-or-at-work","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/8-update-screens-to-troll-friends-or-at-work\/","title":{"rendered":"8 update screens to troll friends or at work"},"content":{"rendered":"<p>Most of us fully trust the software that we have installed on the computer, with special mention to the operating system.  The updates of everything that is part of the software of our PC are a key element, but that does not mean that sometimes they stop being annoying.  If you want to troll or play a prank on a friend or colleague <strong>making use of some supposed update<\/strong>then we will help you.<\/p>\n<p>Surely many of you are already fully aware that many times when a program or operating system is updating, it is better not to touch the PC.  This could seriously damage the program in question, including the system <strong>Microsoft Windows<\/strong>.  Therefore, it is almost always preferable to wait a few seconds or minutes for this process to finish and continue with what we were.  Because of this, we can always make use of this fear to play some joke or <strong>troll our friends<\/strong>.<\/p>\n<p>Specifically, we refer to the possibility of launching or <strong>set a fake on screen<\/strong> in form of <strong>update<\/strong> so that the affected cannot touch your PC.  It is true that the usefulness of all this is not much, but on the contrary, we can have a laugh at its expense.  Forcing a software update for it is not the most effective method, but we have other ways to achieve something similar.  To all this, we must add that, depending on the version of the operating system, these update screens usually vary.<\/p>\n<p>However, in these same lines we are going to talk about some interesting samples that you can easily use to troll someone else in this regard.<\/p>\n<h2>Fool your friends with these fake update windows<\/h2>\n<p>For all this that we tell you, at first we are going to need <strong>load in internet browser<\/strong> commonly used on that PC.  Next, we only have to load one of the links that we will show you a little further down to emulate that update window that we are looking for.  Of course, so that everything is more credible and said window occupies the entire screen, it is recommended to <strong>set that browser to full screen<\/strong>.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>In most cases we achieve this by pressing the <strong>F11 key<\/strong> so that the fake update window fills the screen and further confuses the cheated.  And also this does not end here, since perhaps one of the first movements that person makes is to press the enter key.  Well, if this movement is carried out, a <strong>blue screen<\/strong> either <strong>BSOD<\/strong>, which can lead to a good scare.  It is worth mentioning that to end this trolling, just press the ESC key, press F11 again or go back as if it were a conventional website.<\/p>\n<p>Therefore, if you want to troll your friends, co-workers or family members, we recommend you take a look at these web pages that we show you below.  You will be able to use them in a totally believable way in some <strong>windows versions<\/strong>and other platforms.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Most of us fully trust the software that we have installed on the computer, with special mention to the operating system. The updates of everything that is part of the software of our PC are a key element, but that does not mean that sometimes they stop being annoying. If you want to troll or [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1731,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1729"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1729"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1729\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1731"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1729"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1729"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1729"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}