{"id":1742,"date":"2022-05-21T09:16:29","date_gmt":"2022-05-21T09:16:29","guid":{"rendered":"https:\/\/why-what-who.com\/5000-euros-for-each-pirated-iptv-you-sell-the-price-of-reoffending\/"},"modified":"2022-05-21T09:16:29","modified_gmt":"2022-05-21T09:16:29","slug":"5000-euros-for-each-pirated-iptv-you-sell-the-price-of-reoffending","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/5000-euros-for-each-pirated-iptv-you-sell-the-price-of-reoffending\/","title":{"rendered":"5,000 euros for each pirated IPTV you sell: the price of reoffending"},"content":{"rendered":"<p>Now he has been caught again and, in addition to seizing cash worth 25,000 euros and cryptocurrencies, <strong>you will have to pay a fine if you reoffend<\/strong>.  Said penalty will be 5,000 euros for each new subscription sold.<\/p>\n<h2>This is how the pirate IPTV business worked<\/h2>\n<p>Already in March 2021 the Dutch BREIN found this man who <strong>sold IPTV subscriptions<\/strong> as part of its never-ending quest to disrupt the unauthorized distribution of copyrighted content.<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1293390\" class=\"wp-caption-text\">Pirate IPTV arrest<\/p>\n<p>The subscriptions that this guy sold gave <strong>access to more than 6,000 television channels<\/strong> live and on-demand content such as 10,000 movies and TV series.  These packages typically cost only a fraction of the price associated with similar legal services and offer many more options, attracting the attention of consumers simply by looking at the price for the entire service.<\/p>\n<p>After being approached by the BREIN, this man agreed to close his seller accounts in Benelux online marketplaces such as Marktplaats.nl and 2dehands.be and a priori ended his illegal business.<\/p>\n<h2>Deception and recidivism<\/h2>\n<p>As the anti-piracy group did not believe that this man had really finished his lucrative service, they decided to continue investigating him for a while, confirming their suspicions later.<\/p>\n<p> <img viewbox=\"0 0 3 2\" aria-describedby=\"caption-attachment-1666194\" loading=\"lazy\" class=\"size-large wp-image-1666194\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653124589_967_5000-euros-for-each-pirated-IPTV-you-sell-the-price.jpg\" alt=\"Pirate IPTV Trial\" width=\"715\" height=\"374\"  \/><\/p>\n<p id=\"caption-attachment-1666194\" class=\"wp-caption-text\">Pirate IPTV Trial<\/p>\n<p>“He pretended to be Belgian, but it turned out that he lived in the Netherlands.  She has signed an abstention statement with a penalty clause for future violations,” BREIN said at the time.<\/p>\n<p>Precisely that document that protected against a possible recidivism is what will now have more serious consequences for the offender.  After closing that act by paying an undisclosed amount that covered the investigation costs, advertisements were finally detected and websites showed traces of the same subject, which led to the conclusion that<strong> the man had broken the agreement<\/strong> of conciliation.<\/p>\n<p>Now the anti-piracy group has had permission from the Dutch court to access the offender&#8217;s home and seize the assets obtained as a profit from the business, including 25,000 euros in cash and a cryptocurrency wallet.  These assets have been confiscated and a new conciliation agreement has been issued with more severe penalties in case of a new offense: <strong>5,000 euros penalty for each new subscription<\/strong>.  If this is the case, the BREIN will also begin the procedures for prosecution and would request prison sentences in addition to the financial penalty.<\/p>\n<p>According to the latest figures, BREIN has removed 4,752 advertisements for illegal IPTV subscriptions from sales platforms and has tracked down and arrested 53 illegal providers.  Additionally, BREIN has shut down 330 websites that were used to sell illegal IPTV subscriptions.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Now he has been caught again and, in addition to seizing cash worth 25,000 euros and cryptocurrencies, you will have to pay a fine if you reoffend. Said penalty will be 5,000 euros for each new subscription sold. This is how the pirate IPTV business worked Already in March 2021 the Dutch BREIN found this [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1745,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1742"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1742"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1742\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1745"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1742"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1742"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1742"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}