{"id":1749,"date":"2022-05-21T10:01:30","date_gmt":"2022-05-21T10:01:30","guid":{"rendered":"https:\/\/why-what-who.com\/this-is-how-hackers-spy-on-you\/"},"modified":"2022-05-21T10:01:30","modified_gmt":"2022-05-21T10:01:30","slug":"this-is-how-hackers-spy-on-you","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/this-is-how-hackers-spy-on-you\/","title":{"rendered":"this is how hackers spy on you"},"content":{"rendered":"<p><strong>Chema Alonso<\/strong>a member of the Executive Committee of Telefónica, an expert in cybersecurity and surely the best-known Spanish hacker, has shown in a blog post how hackers can access your information if you choose to show the connection time on WhatsApp.<\/p>\n<h2>Last connection time on WhatsApp<\/h2>\n<p>WhatsApp currently allows you to choose between three privacy settings to hide or show your last connection time:<strong> Everyone, My Contacts or Nobody<\/strong>.  Chema Alonso directly considers that the first of all should not even exist and details why through a series of experiments that he has carried out.<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1669434\" class=\"wp-caption-text\">whatsapp options last connection<\/p>\n<p>&#8220;The &#8220;Everyone&#8221; option should not even exist within the universe of configuration possibilities.&#8221;<\/p>\n<p>The Spanish hacker thinks this way because he has carried out a test on users that he does not have among his contacts through WhatsApp Web in Firefox.  If the victim chose &#8220;Everyone&#8221; in his privacy options, anyone who enters his number on WhatsApp will be able to see his <strong>last connection times<\/strong>.<\/p>\n<p>Using WhatsApp Web, a Firefox plugin and a virtual machine, this data can be constantly read to check when there has been a change in it.  In this way, a database can be fed with sampling times and &#8220;last seen&#8221; data to<strong> draw a timeline<\/strong> that indicates when changes occurred in said text and therefore it was connected.<\/p>\n<h2>You can keep an eye on your contacts even more<\/h2>\n<p>The story does not end here for tracking and monitoring for using WhatsApp with last connection time.  In the event that you have chosen the “My Contacts” option there will probably be fewer potential hackers going to review your data, but if they do, they will get even better information with which to profile your daily patterns.<\/p>\n<p>If the contact is in your agenda, in addition to knowing when the last connection was, you can use the <strong>notice that whatsapp gives that you are online<\/strong>.  With the same Firefox plugin you can monitor contacts by searching for online text matches in the chat bar.  By searching for the text “On Line” a trace will be left each time you have accessed the messaging application and bring that data to a timeline that allows you to know when you are connected throughout the day.<\/p>\n<p> <img viewbox=\"0 0 3 2\" aria-describedby=\"caption-attachment-1669635\" loading=\"lazy\" class=\"size-large wp-image-1669635\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653127290_22_this-is-how-hackers-spy-on-you.jpg\" alt=\"WhatsApp tracking example\" width=\"398\" height=\"500\"  \/><\/p>\n<p id=\"caption-attachment-1669635\" class=\"wp-caption-text\">WhatsApp tracking example<\/p>\n<p>You can literally do a refresh every 5 seconds to know when you are no longer available and <strong>know for sure when and how long you have been using WhatsApp<\/strong>.  In this way, this data can turn against you.  Not only because these activity times can be shared with those who should not, but knowing when you are usually on WhatsApp you can be more likely to fall into a scam.<\/p>\n<p>So you should hide your connection time so as not to make it easier for your information to fall into the wrong hands.  As Alonso says, &#8220;be careful who you give your phone number to, what are you giving<strong> your life schedules<\/strong>«.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Chema Alonsoa member of the Executive Committee of Telefónica, an expert in cybersecurity and surely the best-known Spanish hacker, has shown in a blog post how hackers can access your information if you choose to show the connection time on WhatsApp. Last connection time on WhatsApp WhatsApp currently allows you to choose between three privacy [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1752,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1749"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1749"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1749\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1752"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1749"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1749"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1749"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}