{"id":1768,"date":"2022-05-21T13:33:13","date_gmt":"2022-05-21T13:33:13","guid":{"rendered":"https:\/\/why-what-who.com\/can-i-extract-an-archive-in-winrar-if-some-parts-are-missing\/"},"modified":"2022-05-21T13:33:13","modified_gmt":"2022-05-21T13:33:13","slug":"can-i-extract-an-archive-in-winrar-if-some-parts-are-missing","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/can-i-extract-an-archive-in-winrar-if-some-parts-are-missing\/","title":{"rendered":"Can I extract an archive in WinRAR if some parts are missing?"},"content":{"rendered":"<p>For years we have used compressed files for various reasons, almost all of them very useful.  For this we use applications such as <strong>WinRAR<\/strong> in order to save space on disk drives, or to combine many files into one, for example.  They are programs that if used properly can be of enormous help.<\/p>\n<p>These file compressors have been with us for decades, although over time they have improved their functionality.  Initially they were limited to compressing or decompressing files, but now they go much further.  Right now they are proposing some interesting additional functions to have greater control over these processes that we mentioned.  There is no doubt that one of the best known and used proposals is WinRAR.<\/p>\n<p>As we tell you, this is one of the most used and complete alternatives that we can download and use right now.  A good part of all this is given by the functionality that it offers us in certain circumstances.  A clear example is found in the case that we are going to present below.  Specifically, we refer to the possibility of <strong>fully extract a WinRAR archive if parts are missing<\/strong>.  The first thing we should know is that on many occasions we divide these files to be compressed, especially large ones, into several volumes.<\/p>\n<p>Therefore, when decompressing the set of files we need all those files that are part of the total.  But it may be the case that one of them has disappeared by accident or is damaged.  At first we might think that in this case we could not extract the compressed file if any of its parts are missing.  But let&#8217;s see some solution that we can carry out in this specific case.<\/p>\n<h2>Recover lost parts of files in WinRAR<\/h2>\n<p>In the event that we find ourselves in this unpleasant situation, the first thing we should know is that we have a possible solution to hold on to.  Of course, we must take into account that in order to recover the missing files from a compressed, here we have to use the file the <strong>RAR format in the program<\/strong> that we have mentioned.  That is, if we generate the original compressed with WinRAR using the default format, RAR, we will have the possibility of recovering the missing parts of the set.<\/p>\n<p>In addition, it is essential that we have previously activated a certain function when performing the <strong>file compression<\/strong> and folders added in the beginning.  To give you an idea of ​​what we are talking about, before compressing the originals and creating the corresponding files, we must check the option <strong>Add recovery log<\/strong>.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>Therefore, if a priori we mark this <strong>configuration option in WinRAR<\/strong>, when trying to unzip and missing some part, the program will try to get hold of that recovery record.  We must bear in mind that this may be of help to us, as we mentioned before, both due to the lack and the damage to some of the parts of the tablet.<\/p>\n<p>Of course, at the same time we must take into consideration that, although this is mandatory to be able to recover the set, it is not 100% effective.  Sometimes it will be impossible <strong>recover damaged or lost parts<\/strong> despite the Add recovery log option.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>For years we have used compressed files for various reasons, almost all of them very useful. For this we use applications such as WinRAR in order to save space on disk drives, or to combine many files into one, for example. They are programs that if used properly can be of enormous help. These file [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1770,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1768"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1768"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1768\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1770"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1768"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1768"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1768"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}