{"id":1801,"date":"2022-05-21T18:57:19","date_gmt":"2022-05-21T18:57:19","guid":{"rendered":"https:\/\/why-what-who.com\/this-windows-11-could-bring-dangerous-malware\/"},"modified":"2022-05-21T18:57:19","modified_gmt":"2022-05-21T18:57:19","slug":"this-windows-11-could-bring-dangerous-malware","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/this-windows-11-could-bring-dangerous-malware\/","title":{"rendered":"this Windows 11 could bring dangerous malware"},"content":{"rendered":"<p>Cybercriminals and other hackers know very well how to choose which opportunities are better to attack our computers.  It is very common that when a new popular software or any type of program launches a new version, they take the opportunity to try to &#8220;sneak in&#8221; a fake version that includes <strong>some malware with which to infect our computer<\/strong>.  In recent weeks, we&#8217;ve been seeing a lot of these attempts around Windows 11, and unfortunately it seems like a new one has emerged.<\/p>\n<p>Microsoft announced with great fanfare the new version of its operating system, which has come with a good number of improvements (both visually and in terms of performance).  The best thing about this update is that it&#8217;s <strong>totally free for owners of the previous version<\/strong>, so practically all we need to install Windows 11 is to meet its minimum requirements.  This facility is perhaps one of the biggest windows for hackers, as they have an easy time creating opportunities to infect computers.<\/p>\n<h2>Be very careful when downloading Windows 11<\/h2>\n<p>As you probably already know, Microsoft makes a web page available to all users so that we can comfortably download what is necessary to install Windows 11 on our computer.  For this, this page gives us <strong>three options<\/strong> so that we can choose the one that suits us best: an installation wizard, create an installation medium or an ISO image of Windows 11.<\/p>\n<p>It is precisely this last type of file that they are using in the last attempt that has been discovered by <strong>security firm Zscaler<\/strong>.  According to this, a series of <strong>unauthorized distribution domains<\/strong> which are very similar to the original from Microsoft itself, but obviously have nothing to do with it.  Some of these domains were the following: ms-win11[.] com, win11-serv[.] com, win11install[.] com and ms-teams-app[.] com.<\/p>\n<p>These domains contained access to download an ISO file, which contained an executable file of considerable size (specifically 300 MB).  The size of this file is an attempt to prevent our computer&#8217;s security solutions from identifying it as malicious software, but it is also <strong>signed with an expired AVAST security certificate<\/strong>probably stolen.  This ISO file contains the malware known as Vidar, which can have terrible results for us.<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1669275\" class=\"wp-caption-text\">An ISO fraudulently signed by AVAST (The Hacker News).<\/p>\n<h2>A widely used malware<\/h2>\n<p>As we say, this ISO file contains Vidar, a Trojan that is capable of <strong>steal all kinds of personal data from our equipment<\/strong> without us noticing.  It establishes connections to a remote command and control (C2) server to retrieve legitimate DLL files such as sqlite3.dll and vcruntime140.dll, thereby diverting valuable system data to the site of its managers&#8217; choosing.<\/p>\n<p>In the last month, several more attempts to deliver this malware through other routes have been discovered.  This is why we must always be very careful when downloading any type of software, <strong>always choosing an official route<\/strong>.  This is how they explain it from Zscaler:<\/p>\n<blockquote>\n<p>Cybercriminals distributing Vidar malware have proven their ability to socially trick victims into installing the Trojan using tamas related to the latest popular software applications.  As always, users should be cautious when downloading software applications from the Internet and download software only from the official websites of the providers.<\/p>\n<\/blockquote>\n","protected":false},"excerpt":{"rendered":"<p>Cybercriminals and other hackers know very well how to choose which opportunities are better to attack our computers. It is very common that when a new popular software or any type of program launches a new version, they take the opportunity to try to &#8220;sneak in&#8221; a fake version that includes some malware with which [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1803,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1801"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1801"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1801\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1803"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1801"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1801"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1801"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}