{"id":1804,"date":"2022-05-21T19:13:27","date_gmt":"2022-05-21T19:13:27","guid":{"rendered":"https:\/\/why-what-who.com\/search-texts-and-words-in-your-excel-sheets-with-these-functions\/"},"modified":"2022-05-21T19:13:27","modified_gmt":"2022-05-21T19:13:27","slug":"search-texts-and-words-in-your-excel-sheets-with-these-functions","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/search-texts-and-words-in-your-excel-sheets-with-these-functions\/","title":{"rendered":"Search texts and words in your Excel sheets with these functions"},"content":{"rendered":"<p>If what we really need is to work with numerical data on our PC, one of the most complete solutions that we are going to find is Microsoft Excel.  Here we find ourselves with blank spreadsheets that we must fill in with our own data and use all the available functions.<\/p>\n<p>Surely many of you know first-hand that this is an application present on most computers and that it is part of the <strong>office-suite<\/strong>.  As we mentioned, this is a software that focuses on the treatment of numerical contracts, although it is not exclusive to them.  In a parallel way in the program we can use many other types of data and components such as <strong>texts<\/strong>formulas, <strong>graphics<\/strong>images and much more.<\/p>\n<p>It is logical to think that both numbers and texts are going to predominate here, numerical data with which we will later be able to operate thanks to the functions offered.  We find ourselves with a functional user interface made up of a huge number of <strong>cells<\/strong>.  Each of these elements works independently and represents the most efficient way of working with the data that we are discussing.  We also have to take into consideration that, especially at the enterprise level, sometimes you work with huge spreadsheets here.<\/p>\n<p>Thus, sometimes we can find ourselves faced with the problem that we need <strong>locate certain content included in these sheets<\/strong>.  For this, the program itself offers us some ways to locate what we are looking for in the most effective and fastest way.  Precisely below we will talk about some ways and methods that you have at your fingertips to search for texts or words in Excel sheets.<\/p>\n<h2>Various ways to search in Excel<\/h2>\n<p>Here are several ways to <strong>locate certain texts or words<\/strong>, among other content, that are part of the Excel spreadsheet.  That is why below we will talk about different ways to find what interests us or what we need in the Microsoft program.<\/p>\n<ul>\n<li style=\"display:inline-block; width:100%;\"><strong>Keyboard shortcut<\/strong>: to begin with, we will tell you that the most common and used method in these cases is the <strong>CTRL + B key combination<\/strong>.  At that moment, a small window will appear on the screen to enter the term or text to locate.  We recommend you click on the Options button that we will see here to further filter this content search.  We can indicate where to focus it, <strong>distinguish between upper and lower case<\/strong>or the coincidence of terms.<\/li>\n<li><strong>smart search<\/strong>: This is another more advanced search function that we access by simply clicking with the right mouse button on any cell.  In this way we will have the possibility of <strong>locate content and make queries<\/strong> through multiple pathways.  Here we can carry out both local and online searches.<\/li>\n<li><strong>SEARCH formula<\/strong>: The Microsoft spreadsheet program offers us this function that helps us locate certain content.  This will allow us <strong>locate values ​​within a range<\/strong> of the spreadsheet that we specify previously.<\/li>\n<li><strong>SEARCH function<\/strong>: on the other hand, we find this other function integrated in Excel also very useful for these tasks.  Specifically, when using it, it returns the character number in which it is <strong>finds the text that we include in its syntax<\/strong>.<\/li>\n<li><strong>Formula FIND<\/strong>: this other formula works similarly to the one mentioned above.  Specifically, it returns the <strong>starting position of a given text string<\/strong> within another character set.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>If what we really need is to work with numerical data on our PC, one of the most complete solutions that we are going to find is Microsoft Excel. Here we find ourselves with blank spreadsheets that we must fill in with our own data and use all the available functions. Surely many of you [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1806,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1804"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1804"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1804\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1806"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1804"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1804"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1804"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}