{"id":183,"date":"2022-05-10T14:39:49","date_gmt":"2022-05-10T14:39:49","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/10\/el-corte-ingles-plus-for-free-shipping-price-conditions-and-products\/"},"modified":"2022-05-18T15:53:23","modified_gmt":"2022-05-18T15:53:23","slug":"el-corte-ingles-plus-for-free-shipping-price-conditions-and-products","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/el-corte-ingles-plus-for-free-shipping-price-conditions-and-products\/","title":{"rendered":"El Corte Inglés Plus for free shipping: Price, conditions and products"},"content":{"rendered":"<p>Amazon has its Amazon Prime but it is not the only one that offers users<strong> an annual payment in exchange for free shipping.<\/strong> El Corte Inglés Plus offers same-day delivery on many products without having to pay for them to be brought to us, free home delivery on millions of products from different categories.<\/p>\n<h2>What is El Corte Inglés Plus?<\/h2>\n<p>El Corte Inglés Plus is the <strong>El Corte Inglés premium subscription or the flat shipping rate<\/strong> that allows us to have a series of advantages over other customers or buyers of the online store.  It has a price of 19.90 euros per year, with annual payment, and its main advantage is that we have free shipping on all orders we make (with conditions, as we will see later) as well as other advantages such as discounts, returns, access to offers…<\/p>\n<p>We can have free shipping on all orders with home delivery, with delivery on the same day or with collection at Supercor or Correos.  In addition, the service includes 10% on the first purchase you make after contracting it, includes free returns, exclusive access to offers and promotions for Plus service customers.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>We will mainly pay to have<strong> products without shipping costs<\/strong> regardless of the purchase you make.  Not only with standard home delivery but also with free same day shipping on all orders over 40 euros and as long as the service is available in your city (currently available in about 54 cities) If the amount of the purchase is 10 euros to 40 euros, delivery on the same day is 5.90 euros, somewhat cheaper than the usual price.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-286180 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652193589_828_El-Corte-Ingles-Plus-for-free-shipping-Price-conditions-and.jpg\" alt=\"\" width=\"1200\" height=\"664\"\/><\/p>\n<h2>What products can we buy?<\/h2>\n<p>Almost all categories are included in El Corte Inglés Plus so we can buy different products and join them in a single order.  For example, we can order a toy and a book in the same order without having to pay multiple shipping charges and without having to place multiple different orders.  Virtually all products are <strong>included in the flat rate and the categories<\/strong> o Sections or departments included are: Fashion, Perfumery, Home, Electronics, Computers, Appliances, Sports, Babies, Books, Music, Cinema, Toys, Videogames, Stationery, Pets, Gourmet Club and Primeriti.<\/p>\n<p>But there are exceptions.<strong> Not everything is included.<\/strong> The categories are not included: Gift Card, Flowers and Gifts, Supermarket and Wine Club, or Market Place products.  If we buy or add to the basket any product from these categories, the general and customary shipping costs will apply and the flat rate will not apply even if there are other fashion, perfumery, sports or baby products.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1598769 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652193589_47_El-Corte-Ingles-Plus-for-free-shipping-Price-conditions-and.jpg\" alt=\"ECI categories\" width=\"1200\" height=\"864\"\/><\/p>\n<h2>Conditions, price and permanence<\/h2>\n<p>The price of El Corte Inglés Plus is 19.90 euros and has an annual payment. <strong>We pay this amount every twelve months<\/strong> and entitles us to free shipments throughout the year as long as we meet a series of conditions and limits.  Plus, there&#8217;s a 30-day free trial that we can use to see if it&#8217;s worth it.<\/p>\n<p>As we have explained before, there are conditions.  We can always have free delivery but in the case of choosing &#8220;same day delivery&#8221; they must be purchases of more than 40 euros.  They explain from the website: “FREE same day delivery;  In orders over €40 and if the amount is between €10 and €40, the shipping cost will be €5.90.  Now also in a <strong>selection of products and food brands.<\/strong> Service available in more than 54 cities”.<\/p>\n<p>There is a series of <strong>terms<\/strong> to be able to have El Corte Inglés Plus… It is a service <strong>Personal and non-transferable<\/strong> for anyone over 18 years of age but its use is private and particular and is not allowed for companies.  It is not refundable, so if you pay 19.90 euros after the free month, we will not be able to get the money again until we cancel the subscription so that it is not renewed after twelve months.<\/p>\n<p>In addition, El Coret Ingles adds that <strong>reserves the right to make changes<\/strong> in the conditions of service, use and sale, as well as its cancellation” and also that the service may be suspended in case of misuse or fraud.<\/p>\n<p>As for returns, they are free.  But not always: <strong>“Returns in Supermarket<\/strong> They will not be allowed, except in case of poor quality or composition of the product or error in the shipment.  The return and\/or exchange of the same may be requested, provided that the incident is communicated within 24 hours of receipt”<\/p>\n<h2>How to contract and how to buy<\/h2>\n<p>Contracting El Corte Inglés Plus is very simple and we simply have to go to the corresponding website, where we will see all the details.  Here we will find a button that indicates<strong> “start your free 30-day trial”<\/strong> and we just have to follow the steps to add the service to our account and start enjoying the advantages.  Of course, of course, you must<strong> have an El Corte Inglés account<\/strong> with which to process the service.  If you do not have it, you must create it before clicking on this button.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1598751 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652193589_487_El-Corte-Ingles-Plus-for-free-shipping-Price-conditions-and.jpg\" alt=\"ECI Plus\" width=\"1185\" height=\"417\"  \/><\/p>\n<p>The first month is free, but it is very important that we bear in mind that you can try it for thirty days, but 19.90 will be charged to the payment method provided at the time of subscription, so you must cancel it before the time has elapsed, otherwise you want it to renew and start charging you.  If you stay, the 19.90 will simply be charged after the free month and you will be able to use it for the next twelve months without any additional charge and without the need to make a monthly renewal.<strong> or any other type of procedure.<\/strong><\/p>\n<p>Once we have it contracted, there is no need to do anything else for the free shipping costs to apply.  We only have to prepare a purchase or order through the website and we will see that the estimated shipping costs automatically appear as &#8220;free&#8221; in all delivery options, either <strong>“24h home delivery” or “same day delivery”.<\/strong> We complete the order and that&#8217;s it.  We must not mark anything special or specific for the flat rate discount to be applied or for El Corte Inglés Plus to start operating.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1598754 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652193589_273_El-Corte-Ingles-Plus-for-free-shipping-Price-conditions-and.jpg\" alt=\"The English Court Shipping\" width=\"1200\" height=\"433\"\/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Amazon has its Amazon Prime but it is not the only one that offers users an annual payment in exchange for free shipping. El Corte Inglés Plus offers same-day delivery on many products without having to pay for them to be brought to us, free home delivery on millions of products from different categories. What [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":189,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/183"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=183"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/183\/revisions"}],"predecessor-version":[{"id":866,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/183\/revisions\/866"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/189"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=183"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=183"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=183"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}