{"id":1833,"date":"2022-05-22T07:47:16","date_gmt":"2022-05-22T07:47:16","guid":{"rendered":"https:\/\/why-what-who.com\/have-you-updated-ubuntu-6-things-to-do-and-update-your-pc\/"},"modified":"2022-05-22T07:47:16","modified_gmt":"2022-05-22T07:47:16","slug":"have-you-updated-ubuntu-6-things-to-do-and-update-your-pc","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/have-you-updated-ubuntu-6-things-to-do-and-update-your-pc\/","title":{"rendered":"Have you updated Ubuntu?  6 things to do and update your PC"},"content":{"rendered":"<p>The new version of one of the most loved and used Linux distributions has recently been released, we refer to <strong>Ubuntu 22.04LTS<\/strong>.  That is precisely why many users have made the decision to update as soon as possible in order to benefit from the new features that have been included here.<\/p>\n<p>We do not need to tell you that installing a <strong>new version of an operating system<\/strong>, as it is the case, we make an important change in our computer.  Sometimes this directly affects the general operation of the software and we will also have interesting new features that improve the experience.  For a few days we have been able to download and install the new Ubuntu 22.04 Jammy Jellyfish.<\/p>\n<p>To say that this is something that we can do both by doing a <strong>clean install<\/strong>, such as upgrading software from a previous version of Ubuntu.  The truth is that in most cases the installation from scratch is the most recommended, but it is also more annoying and tedious in many cases.  Be that as it may, we will talk about some of them below. <strong>things you should do as soon as you install the new version of the software<\/strong>.<\/p>\n<p>With all this, the change from one version to another will be more comfortable, you will update your PC, and you will enjoy all the news as soon as possible.  The truth is that this is something that extends to most changes or updates of this type.<\/p>\n<p>The arrival of a <strong>new version of this type<\/strong>, whatever the operating system, is almost always great news.  This is the case of the usual <strong>Ubuntu distribution<\/strong> of Linux, so let&#8217;s see what steps we should take once it is finished.<\/p>\n<h2>What to do on the PC as soon as you update Ubuntu<\/h2>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<ul>\n<li><strong>Update bundled software and enable additional repositories<\/strong>: In addition to the operating system itself, all the software that we install in Ubuntu is very important.  We tell you this because after updating Ubuntu, we should do the same with all the included programs, in addition to enabling the additional repositories.  With all this we can get the most out of the set on our computer.<\/li>\n<li><strong>Activate dark mode and graphic options<\/strong>: The latest version of Ubuntu includes a renewed dark mode that we should activate as soon as possible.  At the same time <strong>canonically<\/strong> It sends us a series of graphic options to adapt this system to current times in terms of interface.  For example, this is something that affects both the login screen and the lock screen.<\/li>\n<li><strong>Try advanced capture<\/strong>: one of the characteristics of which the <strong>developer<\/strong> most echoed is the revamped screenshot functionality.  Some features have been included here to improve the functionality of these tasks, something that we should try as soon as possible.<\/li>\n<li><strong>Install all media codecs<\/strong>: Sometimes we can find that some multimedia codecs are missing so that we can update Ubuntu.  To avoid problems with the reproduction of these contents, we should install those that we miss.<\/li>\n<li><strong>Browse GNOME 42 Visual Enhancements<\/strong>: another of the great novelties of Ubuntu is the arrival of the GNOME 42 desktop. Thus, it is almost essential to navigate through the entire system interface to make little by little the changes included here, almost all of them for the better.<\/li>\n<li><strong>Take advantage of new multitasking capabilities<\/strong>: Canonical&#8217;s new operating system incorporates a number of new multitasking capabilities.  These ostensibly improve the functionality of the software.  This is something that we must take advantage of, more in these times.  Normally we want to get the most out of the operating system.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>The new version of one of the most loved and used Linux distributions has recently been released, we refer to Ubuntu 22.04LTS. That is precisely why many users have made the decision to update as soon as possible in order to benefit from the new features that have been included here. We do not need [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1835,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1833"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1833"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1833\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1835"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1833"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1833"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1833"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}