{"id":1836,"date":"2022-05-22T07:49:17","date_gmt":"2022-05-22T07:49:17","guid":{"rendered":"https:\/\/why-what-who.com\/ruin-of-telefonica-in-a-hurry-recover-34-million-after-investing-about-1000\/"},"modified":"2022-05-22T07:49:17","modified_gmt":"2022-05-22T07:49:17","slug":"ruin-of-telefonica-in-a-hurry-recover-34-million-after-investing-about-1000","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/ruin-of-telefonica-in-a-hurry-recover-34-million-after-investing-about-1000\/","title":{"rendered":"Ruin of Telefónica in a hurry.  Recover 34 million after investing about 1000"},"content":{"rendered":"<p>Ruinous operation for Telefónica with the sale of just over 7% of its shares in Prisa for a value of 0.68 euros per share.  This has generated an income of 34 million euros, but it is very far from the investment made in the media group.  In fact, <strong>more than 1,000 million have been left<\/strong> to recover only 34 million.  In addition to the 725 million to buy Digital Plus, they spent another 100 million on convertible bonds and two capital increases of the same amount.<\/p>\n<p>Following the agreement with the company Global Alconaba SL, Telefónica retains <strong>less than 2% of the company&#8217;s capital<\/strong>.  Now, this remains as the fourth shareholder of Prisa after Amber Capital (29.8%), Vivendi (9.9%) and Rucandio (7.6%).  Telefónica has signed its almost definitive departure from one of the main media conglomerates in Spain with a rather worrying result for its coffers.  Specifically, they have 13,839,900 shares, equivalent to 1.953% of Prisa&#8217;s share capital.<\/p>\n<h2>The decline of Prisa in recent years<\/h2>\n<p>Beyond the rumored disagreements between the media group&#8217;s board of directors and the telecommunications company, the reality is that Telefónica has gotten rid of a ballast like Prisa at too high a price.  Prisa went public in 2000 <strong>at a price of 20 euros per share<\/strong> and was even part of the IBEX 35. At the time of writing this article, the shares are trading at 0.59 euros per share.<\/p>\n<p style=\"display:inline-block; width:100%;\"><strong>John Pena<\/strong>, an analyst at GVC Gaesco, does not hesitate to talk about the significant loss of money for the telecommunications company: &#8220;Obviously, they have lost a lot of money on their investment because this comes from 2002 and I think they have invested more than 1,000 million euros since then .  But hey, it had already been accounted for, so it&#8217;s assumed.&#8221;<\/p>\n<h2>The entrance of Telefónica in Prisa<\/h2>\n<p>The entry into the media conglomerate dates back to the time of <strong>Cesar Alierta<\/strong>.  As Marcos Sierra explained to us in VozPopuli, the operator thus guaranteed a presence in the media with great influence in our country.  In 2012, it subscribed convertible bonds for a value of 100 million euros.  These were converted into shares in 2014. A year later, the operator added 8.7% through derivatives.  In total, he came to have 13.058% of Prisa in February 2016.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-large wp-image-95542\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653205757_244_Ruin-of-Telefonica-in-a-hurry-Recover-34-million-after.jpg\" alt=\"\" width=\"715\" height=\"402\"  \/><\/p>\n<p>In 2017 he tried to expand his position in Prisa again, but in the end it did not go ahead.  All these investments must be added to the 725 million euros invested in the purchase of Digital Plus.  No matter how well assumed and computed the losses were during these years, the reality is that Telefónica recovers 34 million <strong>after investing nearly 1,000 million euros<\/strong>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ruinous operation for Telefónica with the sale of just over 7% of its shares in Prisa for a value of 0.68 euros per share. This has generated an income of 34 million euros, but it is very far from the investment made in the media group. In fact, more than 1,000 million have been left [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1839,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1836"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1836"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1836\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1839"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1836"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1836"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1836"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}