{"id":1855,"date":"2022-05-22T09:10:06","date_gmt":"2022-05-22T09:10:06","guid":{"rendered":"https:\/\/why-what-who.com\/many-blue-screens-in-windows-11-your-antivirus-is-to-blame\/"},"modified":"2022-05-22T09:10:06","modified_gmt":"2022-05-22T09:10:06","slug":"many-blue-screens-in-windows-11-your-antivirus-is-to-blame","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/many-blue-screens-in-windows-11-your-antivirus-is-to-blame\/","title":{"rendered":"Many blue screens in Windows 11?  Your antivirus is to blame"},"content":{"rendered":"<p>Over the last few weeks, many users have been migrating from Windows 10 to <strong>Windows 11<\/strong> if they have a compatible equipment, from the point of view of Microsoft.  However, this growth of the new system is not being as the software giant expected.  Also, certain errors being caught don&#8217;t help at all.<\/p>\n<p>We must bear in mind that Windows 11 was initially conceived as an operating system with a totally renewed interface and some new functions.  He is called to be <strong>Windows 10 successor<\/strong> which has been with us since last year 2015. However, the migration from one software to another is not being as proactive as Microsoft initially expected.  This is due, on the one hand, to the rigorous requirements demanded for the PC when it comes to installing the new system.<\/p>\n<p>On the other hand, we find that some of the features included here do not convince everyone, so they prefer to stay with the old system.  In addition, some important errors are being detected that also make many users who are considering changing doubt.  This is precisely the case that concerns us right now with some <strong>blue screens being detected in windows 11<\/strong>.<\/p>\n<p>It is true that these failures that lead to blue screens are not as common today as they were in the past.  But on certain occasions they still occur in the latest versions of Windows.  In addition, since its inception they have always been <strong>synonym of serious error<\/strong> and therefore unpleasantness for the user.  Well, we must bear in mind that these still occur in the current Windows 11, as is the case at hand.<\/p>\n<h2>Antivirus in Windows 11 causes blue screens<\/h2>\n<p>To give you an idea of ​​everything that we are telling you, the <strong>latest cumulative update released by Microsoft<\/strong> for computers with this system has caused these problems.  At first we could say that all these problems are caused by bad drivers.  In fact, the <strong>sophos security company<\/strong> claims that some of the affected drivers are used by the antivirus.<\/p>\n<p>Precisely for this reason some computers that are currently running their products could end up <strong>experiencing a BSOD or blue screen<\/strong>.  In other words, the fault for this failure in Windows 11 is the antivirus.  The reason for this is that the security software causes the latest cumulative update to corrupt the aforementioned drivers.  However, with everything and with it at this time we can use an effective solution.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>Thus, the security firm that we mentioned before, Sophos, has published a solution for all users affected by all this.  As reported, Windows 11 users running Sophos Home can find a <strong>BSOD error after installing update KB5013943<\/strong> and restart the PC.  The symptoms consist of not being able to access the desktop, which translates into a serious problem.<\/p>\n<p>At this point, the solution referred to is reduced to the complete removal of the KB5013943 update from Windows 11. In this way, we can continue using the antivirus without any problems on the computer.  On the other hand, we can also opt for <strong>rename driver hmpalert.sys<\/strong> in the team.  All this while waiting for Microsoft to correct the fault from its root.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Over the last few weeks, many users have been migrating from Windows 10 to Windows 11 if they have a compatible equipment, from the point of view of Microsoft. However, this growth of the new system is not being as the software giant expected. Also, certain errors being caught don&#8217;t help at all. We must [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1857,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1855"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1855"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1855\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1857"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1855"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1855"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1855"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}