{"id":1901,"date":"2022-05-22T18:20:55","date_gmt":"2022-05-22T18:20:55","guid":{"rendered":"https:\/\/why-what-who.com\/mining-cryptocurrencies-with-the-pc\/"},"modified":"2022-05-22T18:20:55","modified_gmt":"2022-05-22T18:20:55","slug":"mining-cryptocurrencies-with-the-pc","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/mining-cryptocurrencies-with-the-pc\/","title":{"rendered":"Mining cryptocurrencies with the PC"},"content":{"rendered":"<br \/>\n<h2>What should we take into account when mining<\/h2>\n<p>The first thing we must take into account before putting our computer to work is that, as we know, electricity is not exactly cheap.  And this task consumes a large number of watts as the hardware (specifically, the GPU) has to be running at full capacity 24 × 7.  Therefore, from the profits that we can obtain we will have to subtract the increase in the <strong>electricity bill<\/strong>, which can vary from month to month.  It is profitable?  Yes, but it is a factor to take into account that we cannot forget.<\/p>\n<p>Another important aspect is that putting the computer to mine causes a lot of <strong>heat<\/strong>.  But when we say a lot, it really is a lot.  In winter we will not have problems, since, in addition, we will be able to save on heating.  But when the first or summer arrives, either we have the isolated mining room, or we will be really hot.<\/p>\n<p>In addition, putting an electronic component to work, continuously 24×7, and with high temperatures, is not good for its useful life.  As time goes by, the probability of something going wrong will increase. <strong>our graph is messed up<\/strong>.  This is without taking into account that, after mining, these components lose performance when performing other tasks (such as playing), so they will depreciate more and more.  And the graphics is not that they are at their cheapest.  If this component breaks, we will probably have to leave all the profits of the last 6 months to buy another GPU to continue mining.<\/p>\n<p>Finally, we must bear in mind that what is worth $4,000 today may be worth $2,000 tomorrow, or less.  And the lower the value of the cryptocurrency that we mine, the lower the income.  If it falls a lot, we may even have losses one day due to the crazy price of electricity.<\/p>\n<p>These are factors that, unless we make an investment in a mining RIG to go mining professionally, we must take into account.  Rare is the person who, mining in these times, has managed to get rich or stop working.<\/p>\n<h2>Cryptocurrency mining programs<\/h2>\n<p>Next, we are going to see what are the most common programs that we can use to mine cryptocurrencies.  Not all programs work for all currencies, that must be clear.  And, when choosing between one or the other, we recommend you visit the following wiki where we can see the currencies compatible with each of the programs.<\/p>\n<p>We must also take into account that <strong>antivirus usually detect all these programs as threats<\/strong> potentials.  This is because there are hackers who use these programs to remotely infect computers and use them to mine cryptocurrency to their accounts.  Therefore, if we are going to use them, we have to make sure to place it in a folder added to the AV exclusion list to avoid problems.  But never disable the antivirus.<\/p>\n<h3>CGMiner<\/h3>\n<p style=\"display:inline-block; width:100%;\"><strong>CGMiner<\/strong> It is one of the oldest programs in cryptocurrency mining.  This program is written in C and is cross-platform, being able to install it on any operating system.  Its main feature is that it is designed to be used in dedicated mining systems, although we can also easily use it on any PC that has a GPU connected.<\/p>\n<p>It is one of the best optimized programs, since, instead of spending resources loading a graphical interface, it is designed to be controlled by means of commands.  When using it for the first time, it will ask us to enter the URL of the mining pool, as well as our username and password.  All the cats generated will go directly to the pool, and it will be he who is in charge of accumulating our cryptocurrencies and making the payments when we reach the minimum accumulated money.<\/p>\n<p>This mining program is open source, and we can download it from its repository.<\/p>\n<h3>easy miner<\/h3>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-637152\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653243655_920_Mining-cryptocurrencies-with-the-PC.jpg\" alt=\"easy miner\" width=\"828\" height=\"635\"  \/><\/p>\n<p>For users who are not comfortable with a console or who do not feel comfortable configuring the program from configuration files, it is born <strong>easy miner<\/strong>.  This mining program has a very simple and intuitive graphical interface with which we will be able to start generating money as soon as possible.<\/p>\n<p>This program includes two mining tools, CGminer (to mine Bitcoin) and CPUMiner (to mine Litecoin), which we can use simultaneously.  In addition, it allows us to configure several ASIC equipment to mine, and join mining pools easily.<\/p>\n<p>We can download EasyMiner here and realize that mining cryptocurrencies is not just for four geeks.<\/p>\n<h3>BFGMiner<\/h3>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-637155\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653243655_281_Mining-cryptocurrencies-with-the-PC.jpg\" alt=\"BFGMiner\" width=\"651\" height=\"329\"  \/><\/p>\n<p>This program is based on CGMiner, but it is specially designed to work with ASIC mining hardware.  If we don&#8217;t know what it is, an ASIC is an integrated circuit for specific applications, or what is the same, a hardware designed to perform only one specific task optimally, in this case, mining cryptocurrencies.  This software has the most interesting functions, such as the control of several groups of ASICs, the possibility of easily joining mining pools, and even the possibility of dynamic overclocking and remote control of all computers.<\/p>\n<p>Unless we are going to mine with this type of equipment, <strong>BFGMiner<\/strong> It is not the best program that we can download and install at home.  But, if we want it, on its main website we can find the latest version of it.<\/p>\n<h3>awesome miner<\/h3>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-637158\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653243655_95_Mining-cryptocurrencies-with-the-PC.jpg\" alt=\"awesome miner\" width=\"781\" height=\"519\"  \/><\/p>\n<p>Generally, most of us will use one or two computers that we have at home to mine.  But what if we want to carry out an operation on a larger scale? <strong>awesome miner<\/strong> It is a program that not only allows us to mine, but also allows us to control up to 25,000 computers dedicated to mining cryptocurrencies.<\/p>\n<p>The purpose of this program is to avoid having to configure and control all these devices one by one, but rather we can have all of them controlled remotely through a very simple and intuitive interface.  With this program we can also join a mining pool with all our devices, or use them on our own to generate cryptocurrencies by ourselves.<\/p>\n<p>This program is in charge of controlling everything, from the hardware overclock to the optimal and most profitable coins that we can mine.  And it is available for Windows and Linux, so if you want to start using it, you can go here to download Awesome Miner.<\/p>\n<h3>multi miner<\/h3>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-637161\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653243655_194_Mining-cryptocurrencies-with-the-PC.jpg\" alt=\"multi miner\" width=\"726\" height=\"549\"  \/><\/p>\n<p>If you want to mine cryptocurrencies, but everything sounds Chinese to you, then you should try <strong>multi miner<\/strong>.  This is not a mining program like the previous ones, but, like EasyMiner, it has been designed as a graphical interface for BFGMiner.  When running it for the first time, it allows us to see a configuration wizard from which we can start the program, register in the pool that we want, and start generating that extra income as soon as possible.<\/p>\n<p>This program can be used both to mine using ASIC systems and to mine through the GPU of our computer.  It is compatible with the main cryptocurrencies on the market, and includes the main mining algorithms so that we can choose the one we want to use.<\/p>\n<p>From its website we can download MultiMiner for free.  Of course, we remember that we will need additional software to start mining.<\/p>\n<h3>SHAMINING<\/h3>\n<p>SHAMINING is one of the best platforms for both advanced users and beginners, even those who are mining for the first time.  This web platform is designed to try to bring together all kinds of miners, both those who use ASIC equipment and those who prefer to use the power of the GPU to perform these calculations.<\/p>\n<p>This platform has a very clear and easy-to-use interface, although it only allows Bitcoin (BTC) mining.  However, the performance that users get is very high, and the payments around GH\/s are also quite high.  In addition, we can use SHAMINING as an investment platform, renting cloud mining equipment and getting bonuses based on its performance without having to invest in very expensive hardware.<\/p>\n<p>We can enter this platform from here.<\/p>\n<h3>cryptex<\/h3>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-717171\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653243655_43_Mining-cryptocurrencies-with-the-PC.jpg\" alt=\"cryptex\" width=\"622\" height=\"446\"  \/><\/p>\n<p>One of the features of this application for Windows is that it is capable of analyzing our hardware, calculating which currency is the most profitable, and starting to work on it.  For this reason, it is one of the most interesting solutions for both advanced users and those who are taking their first steps in mining.  To start working with it, all you have to do is download the program, create an account on the platform and put the hardware to work, nothing more.  When we have generated enough payments we can receive the payments.<\/p>\n<p><strong>cryptex<\/strong> It allows us to control mining remotely from anywhere, and it even has one of the lowest withdrawal minimums: 0.5 dollars.<\/p>\n<p>We can start working with this tool, and earn money, from the Kryptex website.<\/p>\n<h3>cudo miner<\/h3>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-739626\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653243655_626_Mining-cryptocurrencies-with-the-PC.jpg\" alt=\"cudo miner\" width=\"958\" height=\"559\"  \/><\/p>\n<p>If we should highlight something <strong>cudo miner<\/strong> is that this program is capable of mining using both the CPU and the GPU of the computer.  In this way, we can select the most profitable component based on the currency that we are going to work with.  In addition, it supports a large number of algorithms, which helps improve work performance (and therefore profits).<\/p>\n<p>This program also stands out for being a very simple program to configure and start up, which can help beginners to take their first steps in the world of mining.  It has a large number of additional functions (such as remote control, account management, monitoring functions, etc.) to be able to have control of our hardware and how it is working at all times.  The important thing, after all, is to make money, not lose it.<\/p>\n<p>We can start mining with this program by downloading the program from the Cudo website.<\/p>\n<h2>Web-based mining applications<\/h2>\n<h3>ECHOES<\/h3>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-739623\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653243655_697_Mining-cryptocurrencies-with-the-PC.jpg\" alt=\"ECHOES\" width=\"834\" height=\"586\"  \/><strong>ECHOES<\/strong> It is a great cloud mining platform, being one of the first to reach the market and, today, it has more than 90,000 users spread all over the world.  In addition to making it easier for us to mine the main cryptocurrencies, this platform has many other useful functions thanks to which we will be able, for example, to store our cryptocurrencies, exchange them, and even invest easily without having to resort to other external platforms.<\/p>\n<p>Thanks to this platform we will be able, on the one hand, to make a mining contract by investing at least 50 dollars, or join a contract that is already in operation.  This platform offers a very high profitability, and allows you to withdraw the money generated from 0.001 BTC.  The profit obtained depends on several factors, such as the contract selected, the amount of TH\/s or the duration of the contract.  It is, without a doubt, one of the best options for beginners.<\/p>\n<p>We can start working with this platform from the ECOS page.  Of course, once a contract is made, we will need a real machine to mine.<\/p>\n<h2>What program should I use?<\/h2>\n<p>In the end, all miners are more or less alike, with some features to differentiate between them, but nothing critical.  Of course, the most widely used, oldest and most popular program among users is <strong>CGMiner<\/strong>.  A very complete, open source program that has everything you need to start mining just by entering the mining pool data.<\/p>\n<p>However, if we do not have much experience in the field of mining or computing, and we want to go easy, then the other option that we can consider is <strong>multi miner<\/strong>.  This program is easier to configure and start up, and allows us to control everything from a simple interface.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What should we take into account when mining The first thing we must take into account before putting our computer to work is that, as we know, electricity is not exactly cheap. And this task consumes a large number of watts as the hardware (specifically, the GPU) has to be running at full capacity 24 [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1910,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1901"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1901"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1901\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1910"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1901"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1901"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1901"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}