{"id":1915,"date":"2022-05-22T21:08:55","date_gmt":"2022-05-22T21:08:55","guid":{"rendered":"https:\/\/why-what-who.com\/windows-defender-not-opening-how-to-fix\/"},"modified":"2022-05-22T21:08:55","modified_gmt":"2022-05-22T21:08:55","slug":"windows-defender-not-opening-how-to-fix","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/windows-defender-not-opening-how-to-fix\/","title":{"rendered":"Windows Defender Not Opening – How To Fix"},"content":{"rendered":"<br \/>\n<h2>Troubleshooting steps<\/h2>\n<p>If we have problems starting Windows Defender correctly in both Windows 10 and Windows 11, we can use the following actions to solve it.<\/p>\n<h3>Enable real-time protection<\/h3>\n<p>Windows Defender is an antivirus that is installed by default on Windows 10 and Windows 11 and is designed to turn itself off if it detects another third-party antivirus to avoid compatibility issues.  Also, if your security software has a Firewall, the Windows Firewall will be disabled.  This means that, if we want Windows Defender to work, we must choose between this and another third-party antivirus.<\/p>\n<p>There are times, especially when we buy a new computer, that it comes with a trial version of different antiviruses, such as McAffe, Norton, etc.  In this case, if we have it enabled, we are deactivating Windows Defender.  Likewise, if we have installed any antivirus to test it, it can also cause the Windows security system to disconnect.  That is why, when the time comes, we do not know if Windows Defender is activated or not, so if it is not, it may seem that it has a fault.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>That is why we must re-activate it manually.  This is something we can do quickly by typing Windows Security in the Start menu search box and selecting it.  Next, we click Virus &#038; other threat protection and Manage settings.  On the next page we activate the section of<strong> Real-time protection<\/strong>.<\/p>\n<h3>Check system files with SFC and DISM<\/h3>\n<p>If Windows Defender fails, we can choose to perform a file system scan on the system to check if everything is correct or if there is a corrupt file that prevents it from starting correctly.  To do this, we are going to use the SFC tool first and then the DISM tool.<\/p>\n<p>The first thing will be to activate the Command Prompt for which we write cmd in the search box of the Start menu and run it with administrator rights.  Then we type the following command and press Enter.<\/p>\n<p> <code class=\"code-section\"> sfc \/scannow <\/code> <\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-619737 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653253735_765_Windows-Defender-Not-Opening-–-How-To-Fix.jpg\" alt=\"Run SFC Scannow in Command Prompt\" width=\"999\" height=\"208\"  \/><\/p>\n<p>Once executed, we wait for the scan to complete, which can take time, so we must be patient.  In case of finding any corrupt system file, this tool will repair it so we can verify if Windows Defender is damaged or not.<\/p>\n<p>In case SFC cannot fix the problem, try performing a scan with the DISM tool.  To do this, from the Command Prompt window run as administrator, enter the following command and press Enter.<\/p>\n<p> <code class=\"code-section\"> DISM \/Online \/Cleanup-Image \/restoreHealth <\/code> <\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-619713 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653253735_528_Windows-Defender-Not-Opening-–-How-To-Fix.jpg\" alt=\"Run DISM RestoreHealth\" width=\"999\" height=\"220\"  \/><\/p>\n<p>From this moment the scan will begin, which may take up to 20 minutes.  Once finished, we verify if the problem persists, otherwise we move on to the next solution.<\/p>\n<h3>Using Windows PowerShell<\/h3>\n<p>Another possible solution to this annoying Windows Defender issue is to use the PowerShell command line tool.  For this we must write <strong>power shell<\/strong> in the Start menu search box and run it with administrator rights.  Once the window appears, we must write the following command and press Enter:<\/p>\n<p> <code class=\"code-section\">Get-AppxPackage Microsoft.SecHealthUI -AllUsers | Reset-AppxPackage<\/code> <\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-694938 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653253735_592_Windows-Defender-Not-Opening-–-How-To-Fix.jpg\" alt=\"Run command in Windows PowerShell\" width=\"900\" height=\"511\"  \/><\/p>\n<p>Once this is done, it should solve the problem when opening the Windows antivirus, so we close PowerShell and restart the system to check it.  If not, we go to the next option to solve it.<\/p>\n<h3>Check Policy Editor settings<\/h3>\n<p>Whether we have Windows 11 or the Pro and Enterprise versions of Windows 10, we can make changes to the system using the Local Group Policy Editor.  It is possible that Windows Defender does not work because we have made some modification here, so we must check that it is correct.<\/p>\n<p>To do this, press the Windows + R keyboard shortcut to launch the Run command.  Here we write<strong> gpedit.msc<\/strong> and press Enter or the OK button.  Once inside we navigate to the following route:<\/p>\n<p> <code class=\"code-section\"> Configuración del equipo \/ Plantilla administrativa \/ Componentes de Windows \/ Antivirus de Microsoft Defender <\/code> <\/p>\n<p>Here we double click on the section <strong>Disable Microsoft Defender Antivirus<\/strong>.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-694932 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653253735_213_Windows-Defender-Not-Opening-–-How-To-Fix.jpg\" alt=\"Disable Microsoft Defender Antivirus\" width=\"900\" height=\"473\"  \/><\/p>\n<p>In the new screen we mark the option of <strong>not configured<\/strong> and click Apply and OK to save the changes.  We restart the PC and check if Windows Defender is already running correctly.<\/p>\n<h3>Check registry settings<\/h3>\n<p>It will also be necessary to verify that a registry modification has not been made where the use of Windows Defender has been deactivated.  This may have been caused by the installation of other antivirus software that, to avoid conflict, disable the Microsoft tool.<\/p>\n<p>To do this, we will press the Windows + R keyboard shortcut to launch the Run command.  Here, we type regedit and hit Enter or OK button.  Once the registry is open, we must navigate to the following address:<\/p>\n<p> <code class=\"code-section\"> HKEY_LOCAL_MACHINE \/ SOFTWARE \/ Policies \/ Microsoft \/ Windows Defender <\/code> <\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-694935 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653253735_685_Windows-Defender-Not-Opening-–-How-To-Fix.jpg\" alt=\"DisableAntiSpyware registry editor.  value 0\" width=\"900\" height=\"457\"  \/><\/p>\n<p>Here we must locate the key <strong>DisableAntiSpyware<\/strong>.  If it does not exist, we can create it by right-clicking on Windows Defender and selecting New and DWORD Value (32 bits) and giving it the name DisableAntiSpyware.  We double click on it and set the value data to 0.<\/p>\n<p>We close the Editor and restart the PC to check if Windows Defender is already running correctly.<\/p>\n<h3>Update Windows<\/h3>\n<p>It is important that we make sure that Windows is updated to the latest version available.  With this, we not only make sure that we have the latest functions that are added available, but also, in case of having an obsolete version, it can cause problems in Windows Defender, so an update can eliminate the error.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-744552 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653253735_417_Windows-Defender-Not-Opening-–-How-To-Fix.jpg\" alt=\"Pending installation Windows Update\" width=\"900\" height=\"472\"  \/><\/p>\n<p>To do this, we simply have to open the Start menu search engine, write, <strong>Windows Update and<\/strong> select it.  Once this is done, its section will appear in the Configuration menu.  If we have updates available, click on the button <strong>Install Now<\/strong>.  Otherwise, click Check for updates.<\/p>\n<h3>Restore Windows to a previous version<\/h3>\n<p>If at this point Windows Defender still does not work, we can choose to restore Windows to a previous version that we have saved where the Microsoft antivirus worked perfectly.<\/p>\n<p>To perform the system restore we must access the Control Panel.  Later in the upper right part in the “View by” option, we select “small icons”.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-672003 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652266443_737_Win32AppBackgroundContext-message-on-Windows-Fix.jpg\" alt=\"Open System Restore in Windows 11\" width=\"900\" height=\"277\"  \/><\/p>\n<p>Next, we click on “System” and then on the “Recovery” section, located on the right side.  This will open another window where we must click on «<strong>Open restore Sistem&#8221;<\/strong>.  Next, a new window will open where we must click on «<strong>Choose a new restore point»<\/strong>.  We select it and Windows will start the process.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-581799 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653253735_943_Windows-Defender-Not-Opening-–-How-To-Fix.jpg\" alt=\"Restore system select restore point\" width=\"900\" height=\"604\"  \/><\/p>\n<p>Once finished, we check that Windows Defender is already running correctly.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Troubleshooting steps If we have problems starting Windows Defender correctly in both Windows 10 and Windows 11, we can use the following actions to solve it. Enable real-time protection Windows Defender is an antivirus that is installed by default on Windows 10 and Windows 11 and is designed to turn itself off if it detects [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1924,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1915"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1915"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1915\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1924"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1915"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1915"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1915"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}