{"id":1932,"date":"2022-05-22T23:56:29","date_gmt":"2022-05-22T23:56:29","guid":{"rendered":"https:\/\/why-what-who.com\/differences-between-the-two-mysterious-versions\/"},"modified":"2022-05-22T23:56:29","modified_gmt":"2022-05-22T23:56:29","slug":"differences-between-the-two-mysterious-versions","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/differences-between-the-two-mysterious-versions\/","title":{"rendered":"differences between the two mysterious versions"},"content":{"rendered":"<p>Both Telegram Web K and Telegram Web Z are <strong>two new versions of Telegram Web <\/strong>that emerged as an alternative to the old one (or Legacy), although it can still be used.  How are they different from each other?  Can you change from K to Z or vice versa?  We are going to answer these questions and other doubts you may have.<\/p>\n<h2>Why two versions?<\/h2>\n<p>The company says that it believes in internal competition and that these two new versions of Telegram Web are entrusted to <strong>two independent development teams<\/strong>.  Taking into account that both versions are preliminary while waiting for a final web version that does not have any type of restriction regarding the mobile app, Pável Dúrov&#8217;s company encourages competition between both teams and the best of each will come out ahead and will come to a final version.<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1437765\" class=\"wp-caption-text\">Telgegram Web<\/p>\n<p>Why are there two versions?  Because we believe in internal competition.  Both new apps work equally well on mobile and desktop devices.&#8221;<\/p>\n<p>These two versions <strong>were released in April 2021<\/strong> and have remained since then as part of the messaging company&#8217;s catalog of solutions, within the &#8220;Applications for web browser&#8221; section.  These two applications offer the user a wide variety of functions.  They include support for animated stickers, dark mode, chat folders, among others.<\/p>\n<h2>Differences between Telegram K and Z<\/h2>\n<p>First, of course, the path.  Version K is available at https:\/\/web.telegram.org\/k\/ and version Z is available at https:\/\/web.telegram.org\/z\/.  We could say that version Z must be the one that they internally consider the best or most stable at the moment, since if we simply access the web.telegram.org web client, plain and simple, it will take us to the version that has more functions implemented and has fixed more bugs.  You can change from one to another without any problem, simply by logging in.  However, you will not be able to have two versions open at the same time.<\/p>\n<p> <img viewbox=\"0 0 3 2\" aria-describedby=\"caption-attachment-630142\" loading=\"lazy\" class=\"size-large wp-image-630142\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653263789_583_differences-between-the-two-mysterious-versions.jpg\" alt=\"telegram website\" width=\"715\" height=\"374\"  \/><\/p>\n<p id=\"caption-attachment-630142\" class=\"wp-caption-text\">telegram website<\/p>\n<p>If we take a look at the possibilities of the <strong>group chat<\/strong>, for example, we will see the first differences.  The Web Z version has functions such as List of deleted users, Edit privileges of administrators, transfer of ownership of the group or manage the list of deleted users.  Meanwhile, Web K allows users to be added to groups.<\/p>\n<p>One of the main strengths of Telegram compared to WhatsApp, the<strong> channels<\/strong>, they also have subtle differences between versions.  The Web K version lacks features like pinning conversations, editing admin permissions, or editing message signatures.  In this way, Web Z wins, although both lack Invite with the new version of the links, Transfer ownership of the Channel or Add new administrators.<\/p>\n<p>Refering to<strong> chat interface and attachments<\/strong>, Telegram Web Z will display a floating new message button, while version K has it fixed.  If we click on a chat or channel, in Z the information of said user or channel will be shown in the right margin, while in K we will have to consult the details by hand.  Telegram Web K has an enhanced media player option or the option to view voice notes within media we have sent or select multiple messages to copy.  For its part, Web Z has the possibility of zooming in on the photos you have sent or received.<\/p>\n<p>As to <strong>stickers and emojis<\/strong>, Telegram Web Z is capable of showing the original sender when we forward it and also allows us to view and edit favorite stickers.  On the other hand, Web K allows us to configure emoji suggestions.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Both Telegram Web K and Telegram Web Z are two new versions of Telegram Web that emerged as an alternative to the old one (or Legacy), although it can still be used. How are they different from each other? Can you change from K to Z or vice versa? We are going to answer these [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1935,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1932"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1932"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1932\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1935"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1932"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1932"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1932"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}