{"id":1936,"date":"2022-05-23T00:02:10","date_gmt":"2022-05-23T00:02:10","guid":{"rendered":"https:\/\/why-what-who.com\/how-much-does-it-cost-me-to-sell-an-nft-on-opensea\/"},"modified":"2022-05-23T00:02:10","modified_gmt":"2022-05-23T00:02:10","slug":"how-much-does-it-cost-me-to-sell-an-nft-on-opensea","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/how-much-does-it-cost-me-to-sell-an-nft-on-opensea\/","title":{"rendered":"How much does it cost me to sell an NFT on OpenSea?"},"content":{"rendered":"<p>The <strong>Non-Fungible-Token<\/strong>, or NFTs, are not only the new Internet &#8220;fad&#8221;, but have become very lucrative for a good number of users.  For this reason, more and more users are looking to break into this market and start selling their creations in some of the stores that are dedicated to this content.  One of the most popular, due to its simplicity and the facilities it provides so that anyone can sell whatever they want, is <strong>Open Sea<\/strong>.  However, when you go to upload a work, you have surely come across an unpleasant surprise: it&#8217;s time to checkout.<\/p>\n<p>What many of us think when we try to make our way into this market is to start, right now, to make money.  We spend some time bringing a unique creation to life, and we are ready to sell it, for example, on OpenSea.  Of course, the first thing we will need is to link an Ethereum wallet to be able to receive the money.  It doesn&#8217;t matter if it&#8217;s in Coinbase Wallet, in MetaMask, or anywhere else.  The important thing is to have a wallet available.<\/p>\n<p>We already have our creation ready, and we are going to put it up for sale.  But, when doing so, we find a notice that, in order to do so, we have to pay.  And not exactly little.  What&#8217;s going on?<\/p>\n<h2>Initialize the wallet and pay for gas<\/h2>\n<p>Until recently, creating a collection on OpenSea involved paying.  However, right now this rule has been removed, and it is possible to create collections, and upload content to them, without having to pay.  Of course, if it is the first time that we are going to do it, we will find the following.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>The first thing we are going to find is that, in order to start using our wallet, we must initialize it.  And, for this, we have to make a transaction (pay the corresponding cost of gas) so that we can start using it to buy and sell.<\/p>\n<p>This payment to initialize the wallet could be cents, or a few euros.  But, as we can see in the following screenshot, the price of ETH commissions is skyrocketing, and in order to sell we will have to pay at least 100 dollars.  And the price varies every second, being able to go up to 150 dollars, and even more.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-668694\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653264130_267_How-much-does-it-cost-me-to-sell-an-NFT.jpg\" alt=\"MetaMask OpenSea Payment\" width=\"344\" height=\"581\"\/><\/p>\n<p>$100, if that&#8217;s all it is, doesn&#8217;t mean that much either.  But it is that, because it is the first time, we must make a second single payment of 0.01 ETH, which in exchange right now is about 30 euros.<\/p>\n<p>Namely, <strong>to sell for the first time in OpenSea we need to invest between 100 and 200 dollars<\/strong>, depending on many factors.  But this does not end here.<\/p>\n<h2>The OpenSea commission and the gas<\/h2>\n<p>For every sale we make on this platform, <strong>OpenSea keeps 2.5% of the total value of the sale<\/strong>.  That is, if we sell a token for 100 euros, 2.5 euros go to the platform itself.  It&#8217;s not much (compared to the commissions other stores may charge), but it all adds up.<\/p>\n<p>And what about the gas?  By initializing our account we have already paid two gas fees, so we will be able to upload and use the platform without restrictions.  And, when it comes to selling, two situations can occur:<\/p>\n<ul>\n<li>If the seller accepts an offer from the buyer, it is up to the seller to pay the corresponding gas to carry out the transaction.<\/li>\n<li>If the buyer uses the buy button, they pay directly for the gas, and the seller is exempt.<\/li>\n<\/ul>\n<p>As we can see, selling NFT is not something free, nor exactly cheap.  We must be clear about what we want to do and how we want to do it to avoid getting more than one disappointment.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Non-Fungible-Token, or NFTs, are not only the new Internet &#8220;fad&#8221;, but have become very lucrative for a good number of users. For this reason, more and more users are looking to break into this market and start selling their creations in some of the stores that are dedicated to this content. One of the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1939,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1936"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1936"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1936\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1939"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1936"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1936"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1936"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}