{"id":1960,"date":"2022-05-23T03:46:44","date_gmt":"2022-05-23T03:46:44","guid":{"rendered":"https:\/\/why-what-who.com\/how-to-recover-google-chrome-tabs-when-closing-it-by-mistake\/"},"modified":"2022-05-23T03:46:44","modified_gmt":"2022-05-23T03:46:44","slug":"how-to-recover-google-chrome-tabs-when-closing-it-by-mistake","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/how-to-recover-google-chrome-tabs-when-closing-it-by-mistake\/","title":{"rendered":"How to recover Google Chrome tabs when closing it by mistake"},"content":{"rendered":"<br \/>\n<h2>Restore last session on open<\/h2>\n<p>In this way, in the event that we have configured <strong>Chrome<\/strong> to recover session when starting automatically, it will open as we left it when closing it.  Therefore, we must know that this is something that we can configure from the “When opening” section of the configuration section of the <strong>Program<\/strong>.  It will be here where we tell Chrome that we want to recover the session when starting, just as it was when closing.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>On the other hand, when restarting the <strong>browser<\/strong> after a failure or closing it through the <strong>Task Manager<\/strong>, Chrome has an option to recover session.  When this feature is enabled, Chrome always retrieves tabs from the last session, even when it quits unexpectedly.  Therefore, once we know this we are rarely going to lose our open session in the Google program, we just have to make some small changes.<\/p>\n<h2>Find recently closed tabs<\/h2>\n<p>Another way to view the tab history from the Google program is to click on the three vertical dots icon next to the tab image. <strong>user account<\/strong>.  Thus, in the menu that appears on the screen, we can see and select the History of all recently closed tabs.  In this way, at this point we will only have to click where the number of recently closed tabs is indicated.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-243836\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653277603_457_How-to-recover-Google-Chrome-tabs-when-closing-it-by.jpg\" alt=\"Restore Chrome tabs\" width=\"1083\" height=\"553\"  \/><\/p>\n<p>This method, in addition, will also allow us to see the recently visited tabs on other devices.<\/p>\n<h2>Three tricks to see the last tabs<\/h2>\n<p>In addition to the previous methods, which are taking advantage of functions of Chrome itself, Google&#8217;s browser also hides other tricks to allow us to reopen recently closed tabs.  Thus, we can recover the <strong>last browsing session<\/strong>.<\/p>\n<p>The first thing we must do is, once Google Chrome is opened again after an unexpected closure, it is <strong>press the keyboard shortcut Control + Shift + T<\/strong>.  It&#8217;s that simple, in this way we managed to recover what we had open before the last closure.  If we don&#8217;t want to learn this keyboard shortcut, we can do the same thing by right-clicking on the tab bar and choosing the “reopen closed tab” option.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-711534\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653277603_595_How-to-recover-Google-Chrome-tabs-when-closing-it-by.jpg\" alt=\"Reopen a closed Chrome tab\" width=\"608\" height=\"221\"  \/><\/p>\n<p>Also, the latest versions of Google Chrome include a tab browser that we can open in a moment with the<strong> keyboard shortcut Control + Shift + A<\/strong>.  This search engine will allow us to easily find any tab among all the ones that we have open, and also see the ones that we have recently closed.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-446932\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653277603_182_How-to-recover-Google-Chrome-tabs-when-closing-it-by.jpg\" alt=\"Browser tabs Chrome 88\" width=\"1000\" height=\"427\"  \/><\/p>\n<p>If we right-click on the Google Chrome icon in the taskbar, in the drop-down menu we will also be able to find all the recently closed tabs so that we can return to any of them at any time.<\/p>\n<h2>Extensions to avoid losing any website<\/h2>\n<p>In addition to the functions that Google Chrome offers us to avoid losing the pages that we close by mistake, either manually, or due to a system failure, we can also resort to extensions that not only improve the way we work with many tabs at the same time, they also help us keep a copy of them.  Let&#8217;s see them.<\/p>\n<h3>OneTab<\/h3>\n<p>With everything and with it, for greater security, we can always use some extension to <strong>recover tabs<\/strong>.  This is achieved because they store all the open tabs by themselves so we don&#8217;t lose them.  This is the case, for example, of <strong>OneTab<\/strong>.  This is a plugin that, just by clicking on its icon, saves all open tabs for later recovery.<\/p>\n<p>  <img viewbox=\"0 0 3 2\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/How-to-recover-Google-Chrome-tabs-when-closing-it-by.com\/webstore\/detail\/onetab\/chphlpgkkbolifaimnlloiipkdnihall&#038;chs=200x200&#038;chld=L|0.png\" alt=\"OneTab\"\/>  <img viewbox=\"0 0 3 2\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/How-to-recover-Google-Chrome-tabs-when-closing-it-by.jpeg\" alt=\"OneTab\"\/>     <\/p>\n<p>And this extension not only fulfills this purpose, but it is also one of the best to suspend all those tabs that we are not using and save RAM memory so that the computer runs as fast as possible.  Without a doubt, a must-have for all those interested in having more control over the websites that open in Chrome.<\/p>\n<h3>Closed tabs<\/h3>\n<p>Likewise, and in a similar way, we can also make use of <strong>Closed tabs<\/strong>another extension that by itself stores the <strong>tabs<\/strong> which we have recently closed.  This allows us to recover them if we close them by mistake, for example, and never lose anything.<\/p>\n<p>  <img viewbox=\"0 0 3 2\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/How-to-recover-Google-Chrome-tabs-when-closing-it-by.com\/webstore\/detail\/closed-tabs\/eonffnnfmbfnmjpaiigdclmfelolemah&#038;chs=200x200&#038;chld=L|0.png\" alt=\"Closed tabs\"\/>  <img viewbox=\"0 0 3 2\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653277603_318_How-to-recover-Google-Chrome-tabs-when-closing-it-by.jpeg\" alt=\"Closed tabs\"\/>     <\/p>\n<p>The simplest option to not lose any tab that we open in the browser, not even if we have closed it by mistake.<\/p>\n<h3>Tab Outliner<\/h3>\n<p>And these are not the only solutions that will allow us to have greater control over the tabs that we manage in Google Chrome.  In the same way we can use the browser extension called <strong>Tab Outliner<\/strong>.  This acts as a session and tab manager in the application program. <strong>Google<\/strong>.  At the same time, it will allow us to reduce the number of tabs open simultaneously and thus save PC resources.<\/p>\n<p>All this is achieved because in turn it allows us to easily open and close windows and tabs, which also helps to manage them and thus not lose any.  And what is more important is that it allows us to work with the saved tabs, practically in the same way as with the open ones.<\/p>\n<p>  <img viewbox=\"0 0 3 2\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/How-to-recover-Google-Chrome-tabs-when-closing-it-by.com\/webstore\/detail\/tabs-outliner\/eggkanocgddhmamlbiijnphhppkpkmkl&#038;chs=200x200&#038;chld=L|0.png\" alt=\"Tab Outliner\"\/>  <img viewbox=\"0 0 3 2\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653277603_109_How-to-recover-Google-Chrome-tabs-when-closing-it-by.jpeg\" alt=\"Tab Outliner\"\/>     <\/p>\n<h3>Tabman Tabs Manager<\/h3>\n<p>In the quite probable assumption that we habitually work with a good amount of <strong>tabs<\/strong> and we want to manage them better, this is another good alternative.  Therefore, to test it, we only have to download and install this extension in the Google browser.  In this way we will be able to move between them in a much more agile way or reorder them so that we do not lose any again if we work with many of them at the same time.<\/p>\n<p>All this will benefit us greatly, especially if we work with a good number of these elements simultaneously.  But not only that, since in addition to being able to improve our use experience in Chrome, we managed to save part of the resources of the PC itself.  This is mainly because the tabs, depending on the page loaded, consume both RAM and CPU in a significant way.<\/p>\n<p>  <img viewbox=\"0 0 3 2\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/How-to-recover-Google-Chrome-tabs-when-closing-it-by.png\" alt=\"\"\/>     <\/p>\n<h3>Better-onetab<\/h3>\n<p>This is another extension for the <strong>google browser<\/strong> that will also allow us not to lose a single tab again.  And it is that these complements that allow us to store the groups of tabs are very useful.  All this allows us to save multiple tabs that we have opened in a session, and thus free up resources or have them for later.  Sure, in the event that the program suddenly closes, the open and saved tabs will still be there.<\/p>\n<p>Therefore, another of our tips in this same sense is to make use of <strong>Better-onetab<\/strong>.  This is an extension for the Google program that will allow us to save all the tabs, only the selected ones, those to the left or right of the current position, etc.  In addition, it allows you to carry out all this from the context menu of Chrome.<\/p>\n<p>We can also make use of a function that fixes a certain <strong>ready<\/strong> it will not be deleted, set a title for it, or drag to change the order of the saved tabs.  Therefore, as we can see, all this will be very helpful for what we are looking for in this case.<\/p>\n<p>  <img viewbox=\"0 0 3 2\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/How-to-recover-Google-Chrome-tabs-when-closing-it-by.com\/webstore\/detail\/better-onetab\/eookhngofldnbnidjlbkeecljkfpmfpg&#038;chs=200x200&#038;chld=L|0.png\" alt=\"better-onetab\"\/>  <img viewbox=\"0 0 3 2\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653277603_401_How-to-recover-Google-Chrome-tabs-when-closing-it-by.jpeg\" alt=\"better-onetab\"\/>     <\/p>\n<h3>Aerys – Tab Manager<\/h3>\n<p>In the event that we have opened a good number of tabs in the <strong>google browser<\/strong>, we can find some serious drawbacks.  That is why being able to use a solution like Aerys will help us to a great extent.  The main reason for this that we are commenting on is that this is an extension for Chrome that is in charge of ordering these tabs that we are commenting on in the best possible way.<\/p>\n<p>To give you an idea of ​​what we are talking about, Aerys sorts the tabs by website.  In this way, what we manage to obtain is a very clear vision of all the tabs that we have open at that moment.  At the same time it presents very useful additional functions such as a search system by title or <strong>urls<\/strong> between all open tabs.  We can also close all these elements with a single mouse click, drag and drop them to change their order, etc.  Another point to keep in mind here is that we can see the recently closed tabs and return to them if we need them.<\/p>\n<p>  <img viewbox=\"0 0 3 2\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/How-to-recover-Google-Chrome-tabs-when-closing-it-by.com\/webstore\/detail\/aerys-tab-manager\/kclbicheojedbinfjdjjolmciodoihkl&#038;chs=200x200&#038;chld=L|0.png\" alt=\"Aerys - Tab Manager\"\/>  <img viewbox=\"0 0 3 2\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653277603_539_How-to-recover-Google-Chrome-tabs-when-closing-it-by.jpeg\" alt=\"Aerys - Tab Manager\"\/>     <\/p>\n<h3>Session Buddy<\/h3>\n<p>If Chome fails and closes unexpectedly, it is possible that we will lose all the tabs that we have open at that moment.  This may be inconsequential if we only have a couple of them open, but in the event that we are using 20 more, we must search our history to check which one it was.  Or we can use an extension like Session Budy with which we can retrieve the last visited pages.<\/p>\n<p>With this plugin for Chrome we will be able to restore old sessions in the browser, like the ones that worked perfectly together before Chrome closed and it only requires a couple of clicks.  It lists all the websites that were open in one of our saved sessions to help us recover all our open tabs after a crash.  We can even save our open tabs as collections that we can restore later to free up memory and avoid clutter.<\/p>\n<p>  <img viewbox=\"0 0 3 2\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/How-to-recover-Google-Chrome-tabs-when-closing-it-by.com\/webstore\/detail\/session-buddy\/edacconmaakjimmfgnblocblbcdcpbko&#038;chs=200x200&#038;chld=L|0.png\" alt=\"Session Buddy\"\/>  <img viewbox=\"0 0 3 2\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653277604_555_How-to-recover-Google-Chrome-tabs-when-closing-it-by.jpeg\" alt=\"Session Buddy\"\/>     <\/p>\n<h3>tabli<\/h3>\n<p>It is a tab manager for Chrome through which we will be able to make quick changes between windows and tabs.  It has the ability to save and restore windows, making it ideal for recovering the last pages visited if the browser was closed by mistake or also for recovering the last search sessions.  It can also be used to manage our shortcuts and activate the synchronization of our account in case we use several computers.<\/p>\n<p>  <img viewbox=\"0 0 3 2\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/How-to-recover-Google-Chrome-tabs-when-closing-it-by.com\/webstore\/detail\/tabli\/igeehkedfibbnhbfponhjjplpkeomghi&#038;chs=200x200&#038;chld=L|0.png\" alt=\"tabli\"\/>  <img viewbox=\"0 0 3 2\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653277604_766_How-to-recover-Google-Chrome-tabs-when-closing-it-by.jpeg\" alt=\"tabli\"\/>     <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Restore last session on open In this way, in the event that we have configured Chrome to recover session when starting automatically, it will open as we left it when closing it. Therefore, we must know that this is something that we can configure from the “When opening” section of the configuration section of the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1980,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1960"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1960"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1960\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1980"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1960"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1960"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1960"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}