{"id":1985,"date":"2022-05-23T09:49:46","date_gmt":"2022-05-23T09:49:46","guid":{"rendered":"https:\/\/why-what-who.com\/so-you-can-know-where-there-is-a-mobile-antenna-and-if-it-offers-4g-or-5g\/"},"modified":"2022-05-23T09:49:46","modified_gmt":"2022-05-23T09:49:46","slug":"so-you-can-know-where-there-is-a-mobile-antenna-and-if-it-offers-4g-or-5g","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/so-you-can-know-where-there-is-a-mobile-antenna-and-if-it-offers-4g-or-5g\/","title":{"rendered":"So you can know where there is a mobile antenna and if it offers 4G or 5G"},"content":{"rendered":"<p>Mobile phone antennas are essential so that we can have a signal with our devices. <strong>The Spanish geography is full of them<\/strong>, and although obviously there are not the same number of antennas near cities as in more rural areas, the truth is that there is a presence of them everywhere.  If you have ever wondered if there is any way to know where they are installed or to know what type of signal they offer, we will tell you a way to find out easily and from home.<\/p>\n<p>These types of structures are responsible for providing coverage to the operators.  There are methods so that we can see exactly the coverage map of each operator, something that is great to get an idea of ​​what coverage we are going to find in a certain territory.  Along with this, we can also know exactly where all the mobile antennas in our country are located, and that is possible thanks to a tool from the government of our country known as <strong>InfoAntennas<\/strong>.<\/p>\n<h2>What is InfoAntennas?<\/h2>\n<p>As you surely know, mobile phone antennas have a problem, and that is that <strong>emit a certain amount of radiation<\/strong> which can become harmful.  One of the fundamental requirements for one of these antennas to function normally is that it emit radiation levels below the scales that the government imposes, which leads the Telecommunications Inspection technicians to review these levels each time an antenna is installed. new.  These values ​​will depend, in essence, <strong>the type of frequency emitted by the antenna<\/strong>.<\/p>\n<p>All these details are stored and made available to everyone through a web portal and a tool, which is what InfoAntenas is.  Thanks to this, we have the possibility to access<strong> to an interactive map<\/strong> where all the mobile phone antennas in our territory are located.  As we say, the main objective of this tool is to show us the levels of radiation emitted by the antennas, but thanks to this we also have access to more interesting information.<\/p>\n<p>With it, it is possible to know which operator or operators are the ones that use a certain antenna, in addition to getting a very approximate idea of <strong>if it offers 4G or 5G coverage<\/strong>.  This is due precisely to the type of frequency in which each antenna operates.  In our country, <strong>5G mainly uses two of them<\/strong>: the 700 MHz (703 – 788) and the 3,500 MHz (3,400 – 3,800).  To these two frequencies we also add two others that serve as support, thanks to DSS technology, which allows frequency sharing with 4G.  These are 1,800 MHz (1,710 – 1,880) and 2,100 MHz (1,900 – 2,170).<\/p>\n<h2>It&#8217;s that easy to use<\/h2>\n<p>InfoAntenas is a tool that is accessed through the web that is accessed through this link, so we will not have to install anything on our computer.  In addition, it is completely free and does not require any type of registration.  To use it, we just have to follow <strong>the following steps<\/strong>:<\/p>\n<ul>\n<li>The map, by default, will offer us an image of the entire country<\/li>\n<li>We go to the right part of the screen, and we introduce the population that we want to check <\/li>\n<li>When we do this nothing will appear due to the scale\n<ul>\n<li>We will use the vertical bar on the left to zoom<\/li>\n<\/ul>\n<\/li>\n<li>You can move around the map as you would with other geolocation services<\/li>\n<\/ul>\n<p><\/p>\n<p id=\"caption-attachment-1670673\" class=\"wp-caption-text\">InfoAntennas shows all the antennas in purple.<\/p>\n<p><strong>All the purple dots that will appear on the screen<\/strong> (if there is one in the area you have consulted) are mobile telephone antennas.  If we click on it, the information of the operator will appear on the left part of the screen, as well as the exact address of the antenna.  In the event that there are two or more operators that have access to an antenna, a window will appear on the screen for us to choose one of them.<\/p>\n<p>Once we have already selected the antenna that interests us, all we have to do is click on <strong>the view button<\/strong> that is just below the information that we have quoted before.  This will make a new screen appear where we will have all the information collected from that specific antenna.  Here, as you can see in the following image, we can see the radiation levels obtained at different heights, as well as <strong>the assigned band for the antenna<\/strong>.  If the frequencies that we have explained a little above appear in this information, we will know that it will offer 5G coverage.<\/p>\n<p> <img viewbox=\"0 0 3 2\" aria-describedby=\"caption-attachment-1670679\" loading=\"lazy\" class=\"size-large wp-image-1670679\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653299386_10_So-you-can-know-where-there-is-a-mobile-antenna.jpg\" alt=\"\" width=\"715\" height=\"361\"  \/><\/p>\n<p id=\"caption-attachment-1670679\" class=\"wp-caption-text\">All the information offered by InfoAntenas.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Mobile phone antennas are essential so that we can have a signal with our devices. The Spanish geography is full of them, and although obviously there are not the same number of antennas near cities as in more rural areas, the truth is that there is a presence of them everywhere. If you have ever [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1988,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1985"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=1985"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/1985\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/1988"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=1985"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=1985"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=1985"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}