{"id":2017,"date":"2022-05-23T12:41:59","date_gmt":"2022-05-23T12:41:59","guid":{"rendered":"https:\/\/why-what-who.com\/how-to-identify-the-font-used-in-any-photo-or-image\/"},"modified":"2022-05-23T12:41:59","modified_gmt":"2022-05-23T12:41:59","slug":"how-to-identify-the-font-used-in-any-photo-or-image","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/how-to-identify-the-font-used-in-any-photo-or-image\/","title":{"rendered":"How to identify the font used in any photo or image"},"content":{"rendered":"<br \/>\n<h2>How to identify and download a font using Photoshop<\/h2>\n<p>In 2015, Adobe introduced a tool in Photoshop called «<strong>Font matching<\/strong>«.  This tool makes use of Adobe&#8217;s OCR recognition engine to analyze any image or any background and be able to find out what font it is.<\/p>\n<p>To do this, once the image is scanned, Photoshop makes use of the TypeKit database to compare the scanner with the recognized fonts and show us a series of suggested fonts.  Once we have found the font we were looking for, we will be able to know its name to download it from any page, or take advantage of <strong>TypeKit<\/strong> to download, install, and add it directly to Photoshop.<\/p>\n<p>This option is found within Photoshop, in the section «<strong>Text > Font Matching<\/strong>«.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>We select this tool and what we will have to do next is adjust the box that appears to the text that we want to scan.  The more accurate you are, the more accurate the results obtained by the tool will be.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-233174\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653309719_752_How-to-identify-the-font-used-in-any-photo-or.jpg\" alt=\"Photoshop TypeKit\" width=\"1200\" height=\"931\"\/><\/p>\n<p>In a few seconds a series of sources similar to the one we have scanned will appear.  Photoshop will show us in the list fonts that we have installed on the computer, and if we have <strong>signed in to Adobe Creative Cloud<\/strong>it will also show us the ones from the TypeKit database.<\/p>\n<p>We choose the font that we want to download and use and that&#8217;s it.  Now we can start working with these fonts.<\/p>\n<h2>Why do I need to identify sources of texts<\/h2>\n<p>We live in a time when technology seems to be marked by everything related to images, graphics, videos or 3D.  However, we can never leave aside something as important as the texts that we edit, use and add to all kinds of documents from a multitude of programs.  In fact, despite the widespread use of videos, photos and the like, text is still a key element in most of the work we do on a PC.  This can even be extrapolated to the design projects that are being talked about so much at the moment.<\/p>\n<p>That is precisely where the different fonts that we are talking about in these lines come into play.  The fonts, fonts or typefaces that we can use at the moment number in the thousands.  Some better known and used than others, some paid, many others free.  And it is precisely in these design projects, especially in the largest ones, where knowing the type of font used becomes more important.  This will allow us, for example, to continue working and expanding the projects of others who have used certain sources, without being out of tune.  Also, keep in mind that the ways to identify these elements that we are talking about here are very fast and effective.<\/p>\n<p>Moreover, thanks to the websites that we are going to show you below, we will save a good amount of time in this type of specific task, and without having to pay in most cases.<\/p>\n<h2>Other websites to identify and download fonts<\/h2>\n<p>If we don&#8217;t like Adobe&#8217;s tool, or don&#8217;t have access to Creative Cloud, there are also other free websites that take care of scanning any image or text to tell us what font you&#8217;re using.<\/p>\n<h3>WhatTheFont<\/h3>\n<p>One of these pages is WhatTheFont.  This application allows us to upload any image to its server so that, using its OCR recognition engine, it identifies the text of the image and allows us to analyze any typography in search of its identity.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-233176\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653309719_707_How-to-identify-the-font-used-in-any-photo-or.jpg\" alt=\"WhatTheFont\" width=\"903\" height=\"582\"  \/><\/p>\n<p>We will be able to see several results similar to the source that we have analyzed.  Next to each result we can see its name (to search for it on other sites) and the possibility of buying said font in this store.  This will be very useful for us, since, from this same website, once we access it, we can carry out various tasks related to these sources that we mentioned.<\/p>\n<h3>WhatFontIs<\/h3>\n<p>Another similar alternative is WhatFontIs.  This website also allows us to upload any image from our computer to analyze it and be able to identify the sources it uses.  If we register, the OCR will recognize all characters automatically.  If not, we will have to introduce some ourselves (we recommend the most characteristic of the source) to be able to compare it.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-233180\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653309719_855_How-to-identify-the-font-used-in-any-photo-or.jpg\" alt=\"WhatFontIs\" width=\"942\" height=\"848\"  \/><\/p>\n<p>This website will show us the names of the fonts and the possibility of buying it, if it is paid, or downloading it.  We can also filter between free fonts and commercial fonts.  We must bear in mind that depending on the type of use of these contents, sometimes it will be profitable for us to acquire paid sources, more so if we are going to use them in professional environments.<\/p>\n<h3>Identifont<\/h3>\n<p>Identifont is another alternative that will help us identify any typographic font that we can see on the Internet.  This website not only allows us to upload a fragment of the font to be able to analyze it and tell us which one it is (or which one is similar to it), but it also allows us to guess which font it is based on a series of questions.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-342892\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653309719_108_How-to-identify-the-font-used-in-any-photo-or.jpg\" alt=\"Identifont\" width=\"1000\" height=\"674\"  \/><\/p>\n<p>In addition to uploading a photo with the font that we want to guess, we can also identify it by appearance, on the one hand, from the name or by similarity.  It even allows us to search for fonts based on their creator.  A most complete option to be able to discover new fonts and use them in our projects.<\/p>\n<h3>FontFace Ninja<\/h3>\n<p>In this specific case we find an option to find sources that is somewhat different from those previously exposed.  We tell you all this because when we talk about <strong>FontFace Ninja<\/strong>we are actually referring to an extension for Google <strong>Chrome<\/strong>.  The main task of this, as you can imagine, is to identify the fonts of the web pages that we visit.  To do this, all we have to do is install it in the web browser and click on the extension icon so that it starts working by itself.<\/p>\n<p>In this way, the mouse pointer itself becomes a powerful tool to identify sources of all kinds.  This is something that we achieve by passing it over the text that interests us.  At that moment we will be shown the typography that is in addition to other data corresponding to it.  Of course, we must bear in mind that the extension works with <strong>texts<\/strong> as such, not with texts in <strong>images<\/strong>.  With everything and with it, its operation is very effective with the elements that we commented on.<\/p>\n<h3>FontSquirrel Matcherator<\/h3>\n<p>Despite the fact that we do not know what the page is about by its name, the truth is that we are facing an important web page, from where we can download a wide range of different sources.  From here we will be able to identify an image source with text.  It is possible both to load an image from our PC, simply with drag and drop or by providing an image URL, and it is compatible with OneType functions.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-732885 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653309719_321_How-to-identify-the-font-used-in-any-photo-or.jpg\" alt=\"FontSquirrel Matcherator\" width=\"920\" height=\"409\"  \/><\/p>\n<p>It is a fairly precise tool since it will offer us different fonts so that we can choose the one that has the best match with respect to the image that we have added.  It is compatible with JPG or PNG formats and we can also manually specify the characters in case the results provided do not convince us.  When obtaining the results of the searches we will discover that the fonts have to be paid for.<\/p>\n<p>We can use FontSquirrel Matcherator by accessing its official website.<\/p>\n<h3>Fontspring Matcherator<\/h3>\n<p>We are talking about a web tool to detect the font used in any image, quite easy to use, since it will only be necessary to click on the font so that it can be identified.  Its design is simple as well as attractive and intuitive.  We only have to take care of loading the image that contains the font that we want to identify or use a URL link to the image.  In a matter of a few seconds, the page will compare the typographic forms and we will obtain the most similar results.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-732891 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653309719_99_How-to-identify-the-font-used-in-any-photo-or.jpg\" alt=\"Fontspring Matcherator\" width=\"920\" height=\"409\"  \/><\/p>\n<p>Its main drawback is that, if we need to download the fonts, they are quite expensive, so it is a recommended tool only if we want to know the name of the font.  If we want to use Fontspring Matcherator to detect the source of any image, all we have to do is access its web page.<\/p>\n<h2>How to use the font in other programs?<\/h2>\n<p>We have seen how we can identify the font, or typography, of an image, something very useful if, for example, we are making a photomontage and we do not want to leave evidence.  But what if we liked the font and want to use it in other programs, such as Word?<\/p>\n<p>In that case, what we must do is install it in Windows as if it were just another font.  We can do this in two different ways, on the one hand, from the Configuration panel, within Personalization > Fonts, and on the other by right-clicking on it and choosing the install option.  Be that as it may, we must have previously downloaded the source.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-230832\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653309719_860_How-to-identify-the-font-used-in-any-photo-or.jpg\" alt=\"Install fonts setup Windows 10\" width=\"1200\" height=\"875\"\/><\/p>\n<p>Once installed as one more system font, we can use it in practically any program.  Of course, if, for example, we have Word (or whatever program) open, we must close it and reopen it to load the font.<\/p>\n<h2>I made the wrong font, what do I do?<\/h2>\n<p>As we have seen, programs and font identification tools can sometimes give us several similar but different options.  And, although we may think that one of them is quite similar to the font we were looking for, when we download it, install it and start working with it we can find some nuances that show us that it is not.<\/p>\n<p>If we have already installed the font on the computer, what can I do?  A font installed on the computer does not mean anything either.  As standard, surely in Windows we have installed a few fonts that we have never needed, and will never use again.  Some of them were installed by default with Windows, while others may have been installed by programs such as Office, LibreOffice, Acrobat or Photoshop.<\/p>\n<p>The fonts that we don&#8217;t need are just there, installed in Windows.  But they take up virtually no space on your hard drive, nor do they affect your computer&#8217;s performance.  Therefore, unnecessary fonts is not something we need to worry about.<\/p>\n<p>If we have installed a font thinking that it was the one we needed, but later it turns out that it was not, we can forget about it and install any other one to see if we are right this time.  But, if we are one of those who prefer to have the most minimalist and tidy system possible, we will also be able to <strong>uninstall the fonts we don&#8217;t want to have<\/strong> in the system from this same configuration panel.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>How to identify and download a font using Photoshop In 2015, Adobe introduced a tool in Photoshop called «Font matching«. This tool makes use of Adobe&#8217;s OCR recognition engine to analyze any image or any background and be able to find out what font it is. To do this, once the image is scanned, Photoshop [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2026,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2017"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2017"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2017\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2026"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2017"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2017"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2017"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}