{"id":2045,"date":"2022-05-23T13:52:52","date_gmt":"2022-05-23T13:52:52","guid":{"rendered":"https:\/\/why-what-who.com\/mega-operation-against-pirate-iptv-in-spain\/"},"modified":"2022-05-23T13:52:52","modified_gmt":"2022-05-23T13:52:52","slug":"mega-operation-against-pirate-iptv-in-spain","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/mega-operation-against-pirate-iptv-in-spain\/","title":{"rendered":"Mega-operation against pirate IPTV in Spain"},"content":{"rendered":"<p>In recent years, we have seen how businesses based on pirate IPTV have been flourishing all over the world.  Many people are attracted by everything they offer, which is generally a great offer of content for a price much less than what it would all cost by legal means.  Soccer stars in quite a few of these pirate IPTV services, and in fact in our country they are <strong>many efforts made by LaLiga so that these cease to exist<\/strong>.<\/p>\n<p>We have been able to see in recent years how LaLiga has put all kinds of efforts into trying to root out any type of service that would allow fraudulently enjoying domestic competition matches.  Although in this time we have been able to witness several closures of pirate IPTV, it seems that there is still work to be done, and on Thursday of last week there was <strong>another large-scale blow against this type of services<\/strong>.<\/p>\n<h2>More than 150 establishments used the service<\/h2>\n<p>As reported by LaLiga on its website, this new major operation began through a complaint filed by this body <strong>early present 2022<\/strong>.  The complaint echoed a series of catering establishments throughout the Spanish territory that were illegally distributing the match signal without the authorization of the owners of said content.<\/p>\n<p>These types of complaints and operations are nothing new in the world of pirate IPTV, both in Spain and in the rest of the world.  The operation confirmed that <strong>166 establishments were involved<\/strong> in this fraudulent use of LaLiga football matches.  All these establishments were spread over the following cities: Seville, Malaga, Cordoba, Zaragoza, Valladolid, Murcia, Palma de Mallorca, Gijón, Madrid, Vigo, Las Palmas, Bilbao and Barcelona.<\/p>\n<p>The operation also <strong>has affected another 1,200 public establishments<\/strong>, which have also been the subject of various lawsuits.  The establishments reported to the police headquarters were not new in terms of fraudulent emissions: they had been repeat offenders during the last 3 seasons.<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1672287\" class=\"wp-caption-text\">Another victory for LaLiga over pirate IPTV.<\/p>\n<p>Gathered all the necessary information, <strong>the police operation was launched in a coordinated manner<\/strong> and there was an inspection of the premises during one of the LaLiga days.  The operation dismantled the entire infrastructure, identifying those responsible.  During the operation, a large number of devices configured to broadcast pirate IPTV were seized, including the Amazon Fire TV Stick.<\/p>\n<h2>A million dollar loss<\/h2>\n<p>As we have said a little above, pirate IPTV services allow content to be offered to their users for an infinitely lower price than the same service would have legally.  This makes these services so lucrative for those behind them, and hence, although some are closing, it seems that there is always more to discover.  In this particular case, it is estimated that <strong>the economic damage of this network amounts to 1,066,386 euros<\/strong>a not insignificant amount.<\/p>\n<p>The owners of the investigated establishments are charged with a crime against intellectual property and against the market and consumers as allegedly responsible for distributing audiovisual content fraudulently. <strong>Another victory for LaLiga<\/strong>which does not stop in its particular &#8220;war&#8221; against pirate IPTV.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In recent years, we have seen how businesses based on pirate IPTV have been flourishing all over the world. Many people are attracted by everything they offer, which is generally a great offer of content for a price much less than what it would all cost by legal means. Soccer stars in quite a few [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2047,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2045"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2045"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2045\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2047"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2045"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2045"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2045"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}