{"id":2048,"date":"2022-05-23T14:57:26","date_gmt":"2022-05-23T14:57:26","guid":{"rendered":"https:\/\/why-what-who.com\/how-to-view-the-windows-activation-key\/"},"modified":"2022-05-23T14:57:26","modified_gmt":"2022-05-23T14:57:26","slug":"how-to-view-the-windows-activation-key","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/how-to-view-the-windows-activation-key\/","title":{"rendered":"How to view the Windows activation key"},"content":{"rendered":"<p>In fact, the operating system itself, or rather its developer company, Microsoft, offers us different types of licenses to choose from.  Here we find the usual OEM, Retail especially indicated for end users, or the Volume plus for companies.  We have the possibility of downloading the operating system itself for its installation and use from the <strong>own official website of the firm<\/strong>.  However, since this version does not have any associated license, it will not be fully functional.<\/p>\n<h2>Different types of Windows licenses<\/h2>\n<p>Therefore, to be able to use it legally and take advantage of all its advantages, it is advisable to acquire a Windows license.  Whatever the modality we opt for, we will have to pay for one of them.  In fact, in most cases when we buy a new computer already assembled, it usually includes Windows with an OEM license.<\/p>\n<p>These modalities offer us some very important characteristics and differences between them.  In short, while the <strong>OEM licenses<\/strong> they are somewhat more affordable in terms of price, they have certain important limitations.  Also, if we make important changes to the hardware of the purchased equipment, we will probably lose it.  At this point it could be said that the licenses <strong>Retail<\/strong> are the most suitable in the long term.  Although they are a little more expensive, they are more interesting if we are going to build our own computer, in case we plan to make major changes to its hardware in the future.<\/p>\n<p>Regardless of the modality we have opted for, or even if we do not know the type of license we have, sometimes we will need to know this information.  And it is that for whatever reason it may be the case that we need to find this important key in the operating system.<\/p>\n<h3>Different type depending on its origin<\/h3>\n<p>At first glance we may not know if our license is of the Retail, OEM, or even KMS type.  But, depending on where we have obtained this license, it is possible to get a very rough idea of ​​the type of license we have.<\/p>\n<ul>\n<li>Yes we have <strong>bought Windows in a physical store<\/strong>with its corresponding box, then the license will be of the <strong>retail type<\/strong>.  This license, as we know, will always be ours and we can use it on several computers (not at the same time), so we will not lose it when changing some hardware components.<\/li>\n<li>If the license <strong>It was included with a computer<\/strong>this will be without a doubt <strong>OEM<\/strong>.  This license will only be valid for the computer where it was installed, and if we change any key part of the PC it will no longer be valid.<\/li>\n<li>In case you have bought the <strong>digital key in a chinese store<\/strong>then we will be before a <strong>OEM reactivated<\/strong>, a very cheap Windows key that we can use to activate our PC.  Of course, once activated for the first time it will be linked to the PC&#8217;s hardware.<\/li>\n<li>If the license comes from some company, then it&#8217;s probably a <strong>batch license<\/strong>, or KMS.  Using these licenses outside of the company is illegal, something to be aware of.  And it will be the administrator himself who is in charge of controlling its validity.<\/li>\n<\/ul>\n<p>But, if we want to know the license, and make a copy of it, then we will have to use the methods that we describe to you right now.<\/p>\n<h2>View Windows license key on PC<\/h2>\n<p>What at first should be a fairly simple task, we mean locating this system key, we actually have to know how to do it.  That is why, below, we are going to show you several ways to locate what data is to use it later for what we need.  For example, we want to store the key of our operation in a safe place in case we need it later.  It is worth mentioning that there are several methods to access it.<\/p>\n<p>It is for all this that we are going to show you how to find that product key below. <strong>Windows<\/strong>.<\/p>\n<h3>In the box where we bought the operating system<\/h3>\n<p>One of the most effective methods, and one that we have been using for many years, is to use the box or package where we bought the operating system.  Most likely, inside it, specifically in one of the elements that are part of the package, we will find a sticker with the corresponding product key.  This will allow us to keep that same element in a safe place, take a photo of it for later use, write it down to make a <strong>backup<\/strong>.<\/p>\n<p>However, and with the enormous growth of the digital world, this is a method that is gradually becoming outdated.  And it is that in most cases we acquire the Microsoft system through <strong>Internet<\/strong>, not physically as before.  Precisely for this reason we are going to have to use other systems to locate this data.<\/p>\n<h3>Use the Windows registry<\/h3>\n<p>Another of the internal elements of the Microsoft operating system that we can use for this task that we are commenting on is the system registry.  Sometimes it is not convenient to modify this element if we do not know exactly what we are doing.  Otherwise we could damage the own <strong>operating system<\/strong>.  With everything and with it, the registry can be of enormous use to us when carrying out certain tasks, as is the case with the one that concerns us now.<\/p>\n<p>In this case, the first thing we will do is access the functionality that we mentioned.  We just type the command <strong>regedit<\/strong> in the search box that sits on the taskbar, for example.  Next, all we have to do is place ourselves on the following path:<\/p>\n<p> <code class=\"code-section\">HKEY_LOCAL_MACHINE \/ SOFTWARE \/ Microsoft \/ Windows NT \/ CurrentVersion \/ SoftwareProtectionPlatform<\/code> <\/p>\n<p>Once we are here, in the BackupProductKeyDefault value that we see in the right panel of the screen, we can find our system license.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<h3>View the license from CMD<\/h3>\n<p>In the same way we have the possibility of using a command prompt or CMD window to find out the data we are talking about.  In this way we dispense with having to install <strong>additional programs<\/strong> and find out the key directly from the system.  In the event that we need to find out, for whatever reason, the original Windows product key to save it, this option that we show you is very useful.<\/p>\n<p>The first thing we must do is open a command prompt window to execute the corresponding command.  This is something we can achieve by simply typing regedit again in the taskbar search box.  In addition, we are interested in running this functionality with administrator permissions.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-591534 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653317846_831_How-to-view-the-Windows-activation-key.jpg\" alt=\"open cmd admin\" width=\"955\" height=\"485\"  \/><\/p>\n<p>Once we have done what we are telling you about, the window we are looking for will appear on the screen.  Next, we only have to launch a certain command that we are going to show you.  This will be the one that provides us with the path to obtain the Windows product license and that appears on the screen.  So all we have to do at this point is enter the following command in the <strong>window<\/strong>:<\/p>\n<p> <code class=\"code-section\">wmic path softwarelicensingservice get OA3xOriginalProductKey<\/code> <\/p>\n<p>After pressing the enter key, what we are looking for will appear on the screen in these same lines.<\/p>\n<h3>Use Powershell to check out the license<\/h3>\n<p>As with the command prompt window that we talked about earlier, we can also use PowerShell for these key tasks that we discussed.  Initially, this is the functionality that is called to replace the aforementioned CMD.<\/p>\n<p>Therefore, in many aspects it is similar, but it offers us many more advantages, especially for more advanced Windows users.  It is for this reason that we have the possibility to see the license we are looking for on the screen in a simple way.  We open such a window by typing the name <strong>PowerShell<\/strong> back in the search box.  Once the window appears, all we have to do is type the following command:<\/p>\n<p> <code class=\"code-section\">wmic path softwarelicensingservice get OA3xOriginalProductKey<\/code> <\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-619149\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653317846_809_How-to-view-the-Windows-activation-key.jpg\" alt=\"\" width=\"737\" height=\"280\"  \/><\/p>\n<h2>Create a VBS file and find the key<\/h2>\n<p>In the event that we are an advanced user, we can create a VBS file that will help us obtain our license key again.  To do this we must create a sheet in Notepad with the following script as shown in the image:<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-744333 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653317846_760_How-to-view-the-Windows-activation-key.jpg\" alt=\"notepad script find key\" width=\"920\" height=\"484\"  \/><\/p>\n<p>Once we have copied all the code, we click Save As and select all the files.  Next, we assign it a name that can help us identify it, such as<strong> FindWindowsKey.vbs<\/strong> or something similar.  It is essential that we use the .VBS format for it to work.  It only remains for us to keep it somewhere safe.<\/p>\n<p>Once saved, just double click on the VBS file that we have created and the product key will appear.  We can also use the keyboard shortcut Windows + C when it appears to copy the key to our clipboard.<\/p>\n<h2>Know this Windows data with third-party programs<\/h2>\n<p>Everything that we have told you so far can be carried out from Microsoft&#8217;s own operating system.  Thanks to some of the internal functions of this software, we can simply obtain the product key in a simple way.  But at the same time we have the possibility of making use of some <strong>third party software solution<\/strong> to find out the same information.  This is something that we will talk about next.<\/p>\n<h3>ProduKey<\/h3>\n<p>Here we find an interesting application that gives us the possibility to see the activation keys of the installed Microsoft products on the screen.  As it could not be otherwise, here is included the <strong>windows operating system<\/strong>.  In addition, it presents a fairly simple user interface to use and we can run it whenever we need to find out these passwords.  It should be noted that it is compatible with practically all of the most modern versions of the system.<\/p>\n<h3>ShowKeyPlus<\/h3>\n<p>This is another open source software solution very similar to the ones mentioned above.  Therefore, with ShowKeyPlus we will have an application that allows us to recover and show the Windows key that is stored inside it.  We can carry out all of this in a fairly affordable and simple way and thus obtain the version of the system, its license, the edition and its <strong>identifier<\/strong>.<\/p>\n<h3>Magical Jelly Bean Keyfinder<\/h3>\n<p>This application will allow us to obtain the Windows 10 key extremely quickly.  To do this, it will only be necessary to install and run the application and a window will immediately open showing us the version of Windows installed, the system key, the name of the computer, etc.  It also has a community-updated configuration file that retrieves product keys for many other applications.  Another feature is the ability to recover product keys from unbootable Windows installations.  We can download the application for free from its official website.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In fact, the operating system itself, or rather its developer company, Microsoft, offers us different types of licenses to choose from. Here we find the usual OEM, Retail especially indicated for end users, or the Volume plus for companies. We have the possibility of downloading the operating system itself for its installation and use from [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2053,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2048"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2048"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2048\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2053"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2048"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2048"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2048"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}