{"id":2054,"date":"2022-05-23T15:00:57","date_gmt":"2022-05-23T15:00:57","guid":{"rendered":"https:\/\/why-what-who.com\/how-to-apply-blur-effect-on-a-video-with-adobe-premiere\/"},"modified":"2022-05-23T15:00:57","modified_gmt":"2022-05-23T15:00:57","slug":"how-to-apply-blur-effect-on-a-video-with-adobe-premiere","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/how-to-apply-blur-effect-on-a-video-with-adobe-premiere\/","title":{"rendered":"How to apply blur effect on a video with Adobe Premiere"},"content":{"rendered":"<p>And it is that we cannot deny that, at present, blurring or blurring is a fundamental aspect for a video editor.  With this we will be able to create impressive text backgrounds up to extraction effects of a false focus, as well as blur faces in case we want to keep a person anonymous.  This is something that we can do in different ways.<\/p>\n<p>To be able to make a blur effect or blur videos, we will need to have installed<strong> Adobe Premiere<\/strong> on our computer.  If we do not have it, we must pay a subscription of 24.19 euros per month to be able to use it.  If we want to test it beforehand, we can download a 7-day trial version with all its functions and features available, so we can carry out the blur or blur effect on any video.<\/p>\n<h2>Import the video to blur<\/h2>\n<p>To begin with, we open Premiere and create a new project for which we click on the File tab and then on «New» and «Project».  Alternatively we can use the keyboard shortcut “Ctrl + Alt + N”.  We give a name to the project that we are going to carry out and select a destination location.  Of the rest of the available options, unless we have some special needs, we can leave the parameters that are included by default and click on Accept.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>Later the program interface will appear, so we will add the video on which we want to apply a blur or blur effect. To do this, we can use the «<strong>Media Browser»<\/strong> that appears at the bottom left of the window.  Once the video is located, we will only have to drag it to the timeline that is located on the right.<\/p>\n<p>Once the video is loaded into the program, we can start applying a blur effect to an entire page or to a specific element.<\/p>\n<h2>Apply blur to full screen<\/h2>\n<p>Next, we are going to focus on a blur that fills the screen.  To do this, the first thing will be to click on the “Effects” tab that we find in the upper central part of the program.  Later we go to the right column where we will find the different effects that we have available.  Here, we expand the “Video effects” folder and expand the “Blur and sharpen” folder.  Among the options we find, we focus on the use of <strong>&#8220;Camera Blur&#8221;<\/strong>.  Click on it and drag and drop it on our video.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-720750 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653318057_979_How-to-apply-blur-effect-on-a-video-with-Adobe.jpg\" alt=\"Premiere camera blur\" width=\"920\" height=\"472\"  \/><\/p>\n<p>Now, on the left side of the screen, we go to the <strong>&#8220;Effects Controls&#8221;<\/strong>.  From here, we will be able to both increase and decrease the effect on the image.  To do this, click on the “Configure” icon that we find to the right of the “Camera blur” option.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-720753 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653318057_978_How-to-apply-blur-effect-on-a-video-with-Adobe.jpg\" alt=\"Premiere camera blur settings\" width=\"920\" height=\"477\"  \/><\/p>\n<p>This will bring up a small window, where the camera blur settings appear.  We will see a small box with a preview of the video image and a lower bar with a percentage.  As we move the bar to the left or right, the percentage of blur effect that will be added to the image will be added or reduced, being able to see the result in real time in the same box.  Once adjusted to our liking, click OK.<\/p>\n<p>In case we want to animate our blur, we go to the stopwatch icon and click on it to adjust the values ​​over time.<\/p>\n<h2>Add blur to a specific element<\/h2>\n<p>We can also focus the blur on a single element of what appears on the screen so that it appears blurred.  To carry it out, click on the “Effects” tab located at the top of the program.  Next, we go to the right column and within the different available effects we display the “Video effects” folder and then the “Blur and focus” folder.  Among the options we find, we focus on the use of <strong>Gaussian blur.<\/strong> Click on it and drag and drop it onto the video.<\/p>\n<p>Now we go to the left part of the screen, specifically to the “Effect Controls” column.  Here, we use<strong> one of the skinning tools available<\/strong> either, “Create eclipse mask”, “Create four-point polygonal mask” or “Freehand curve” to be able to create a mask around the object on which we want to apply the blur effect.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-720756 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653318057_981_How-to-apply-blur-effect-on-a-video-with-Adobe.jpg\" alt=\"Premiere Gaussian Blur\" width=\"920\" height=\"479\"  \/><\/p>\n<p>Once the mask is created, we use the buttons found on the mask path to animate the mask forward, tracking the object.  You may need to intervene to make sure the mask stays where we want it to go.<\/p>\n<p>For <strong>track or trace<\/strong>, we have some tools located to the right of the “Mask Path”.  Here, we find an arrow located to the left that will affect the tracking of the camera backwards and the arrow located to the right will affect it forwards.  This helps us to do it frame by frame.  On the other hand, the «Wrench» tool will help us to track different options: position, position and rotation or position, scale and rotation.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-720759 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653318057_729_How-to-apply-blur-effect-on-a-video-with-Adobe.jpg\" alt=\"Premiere Blur Tracking\" width=\"920\" height=\"477\"  \/><\/p>\n<p>Click on the forward arrow icon to track the selected mask forward.  Next, the program will put the processor to the maximum trying to render all the frames that will be going forward.<\/p>\n<p>Finally, we only have to give a value to the blur.  For which we go to the “Blur” section and establish the desired value.  The higher the number, the higher the degree of blur that we will apply.<\/p>\n<h2>Export the final result<\/h2>\n<p>Once we have made the blur of the video we can save the clip.  To do this, click on the “File” tab and select “Export” within its options and then from its export options we choose “Media”.  It is also possible to access it directly by pressing the shortcut “Ctrl + M”.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-720765 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653318057_67_How-to-apply-blur-effect-on-a-video-with-Adobe.jpg\" alt=\"Premiere export settings\" width=\"920\" height=\"482\"  \/><\/p>\n<p>This will cause a new window to open with the “Export Settings”.  Now we set the values ​​with the desired quality of the video, which will vary depending on the quality of the original video.  We also select the location to save the file.  We can choose from a wide variety of formats such as AVI, GIF, MPEG4, etc.  In addition, it is possible to adjust the video and audio codecs, as well as the subtitles in case the video includes them.  Once finished, we click on “Export” to save the new video.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>And it is that we cannot deny that, at present, blurring or blurring is a fundamental aspect for a video editor. With this we will be able to create impressive text backgrounds up to extraction effects of a false focus, as well as blur faces in case we want to keep a person anonymous. This [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2061,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2054"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2054"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2054\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2061"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2054"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2054"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2054"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}