{"id":2062,"date":"2022-05-23T15:02:57","date_gmt":"2022-05-23T15:02:57","guid":{"rendered":"https:\/\/why-what-who.com\/so-you-can-know-where-someone-lives-just-by-sending-them-a-song-on-whatsapp\/"},"modified":"2022-05-23T15:02:57","modified_gmt":"2022-05-23T15:02:57","slug":"so-you-can-know-where-someone-lives-just-by-sending-them-a-song-on-whatsapp","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/so-you-can-know-where-someone-lives-just-by-sending-them-a-song-on-whatsapp\/","title":{"rendered":"So you can know where someone lives just by sending them a song on WhatsApp"},"content":{"rendered":"<p>Nowadays it is very difficult for us to imagine our life without WhatsApp.  Meta&#8217;s messaging app has become, on its own merits, a tool that millions of people use around the world, either to communicate with loved ones or even to work, as well as to send files and photos.  This app even allows us to share the location as we please, something that we must always do with our heads.  The problem is that there may be some other way of knowing where we are, <strong>even without us noticing<\/strong>.<\/p>\n<p>One of WhatsApp&#8217;s main concerns is the privacy of its users.  Through this app there are many people who share <strong>most personal information<\/strong> with others, even its location as we have said a little above.  As long as we are the ones who do it consciously, there will be no problem, but there seems to be a new way to know someone&#8217;s location and it is in a most &#8220;innocent&#8221; way.<\/p>\n<h2>Your location revealed by a song<\/h2>\n<p>The way that we are going to explain to you to know the location is actually quite simple to understand, although to carry it out you do have to have certain prior technical knowledge.  In this case, the way to obtain the IP does not differ much from others that we have already explained here, and that are mainly based on making <strong>the victim clicks on a URL<\/strong> which, without my knowledge, will record your IP address.<\/p>\n<p>How to make this happen?  Well, everything is done with a song.  The hook is not very suspicious, since what the affected person receives is nothing more than a message to listen to a song through a platform like Spotify.  The &#8220;trick&#8221; is not going to be in the song itself, but in the URL that will appear to listen to it.  This would look very similar to the platform URL;  however, it would be an address that would take the user to a page controlled by the one who sent the song <strong>and where your IP address will be registered<\/strong>.<\/p>\n<p>   <\/p>\n<p id=\"caption-attachment-1671741\" class=\"wp-caption-text\">Process to know the IP (The side of evil)<\/p>\n<p>When this happens, this web portal redirects the victim to the real Spotify address.  In this way, <strong>the victim never really realizes what has happened<\/strong>, since this will only see on your device how the address you press takes you to the song that would appear in the WhatsApp conversation window.  It is a process that does not have too many limitations, beyond the fact that if the same address is used for several contacts it will be very difficult to know which IP belongs to each person who clicks on the link.  To do this, all you have to do is create different addresses, or send the same to different people in stages.<\/p>\n<p>With this IP address, it will only be necessary to address <strong>to any GeoIP service<\/strong> and enter it to know details about the location of the victim.  It is true that depending on some factors it is possible that the information provided by this IP location service is not entirely accurate, but it will serve to give <strong>a pretty good idea of ​​where the victim currently is<\/strong>.<\/p>\n<p>These kinds of security holes <strong>they are really hard to patch<\/strong>, since the fault is not within the application itself.  To do this, the only thing that WhatsApp could do would be to notify the user that they are leaving the app to go to a portal that may not be secure, although as always this will depend on the user and whether or not they trust the person who sent them the message. URLs.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Nowadays it is very difficult for us to imagine our life without WhatsApp. Meta&#8217;s messaging app has become, on its own merits, a tool that millions of people use around the world, either to communicate with loved ones or even to work, as well as to send files and photos. This app even allows us [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2064,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2062"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2062"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2062\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2064"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2062"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2062"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2062"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}