{"id":2082,"date":"2022-05-23T21:59:46","date_gmt":"2022-05-23T21:59:46","guid":{"rendered":"https:\/\/why-what-who.com\/the-secrets-of-dumbledore-already-has-a-free-premiere-date-on-hbo-max\/"},"modified":"2022-05-23T21:59:46","modified_gmt":"2022-05-23T21:59:46","slug":"the-secrets-of-dumbledore-already-has-a-free-premiere-date-on-hbo-max","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/the-secrets-of-dumbledore-already-has-a-free-premiere-date-on-hbo-max\/","title":{"rendered":"The Secrets of Dumbledore already has a free premiere date on HBO Max"},"content":{"rendered":"<p>Next, we are going to tell you how and when you can see the new film from the magical universe of Harry Potter.<\/p>\n<h2>New Harry Potter spin-off<\/h2>\n<p>Dumbledore&#8217;s Secrets is the<strong> third installment of the Fantastic Beasts spin-off<\/strong> after Fantastic Animals and Where to Find Them (2016) and Fantastic Animals: The Crimes of Grindelwald (2018).  They are a spin-off of the magical world of Harry Potter also created by JK Rowling and set several years before the films starring Daniel Radcliffe.<\/p>\n<p> <iframe title=\"Animales Fantásticos: Los Secretos de Dumbledore - Tráiler Oficial 2\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/oImEeiCiYTk?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe> <\/p>\n<p>In this installment, with controversy after the<strong> replacement of Johnny Depp in the role of the villain<\/strong>, Professor Albus Dumbledore (Jude Law) knows that the powerful dark wizard Gellert Grindelwald (now Mads Mikkelsen) is moving to gain control of the wizarding world.  Unable to stop it on his own, he entrusts magizoologist Newt Scamander (Eddie Redmayne) to lead a fearless group of wizards, witches and a plucky Muggle baker on a perilous adventure where they will encounter beasts new and old as they clash with Grindelwald&#8217;s followers. .  But with so much at stake, how long can Dumbledore stay on the sidelines?<\/p>\n<p>the movie is<strong> again starring Oscar winner Eddie Redmayne<\/strong>, two-time Oscar nominee Jude Law, Ezra Miller, Dan Fogler, Alison Sudol, Callum Turner, Jessica Williams, Katherine Waterston, and Mads Mikkelsen.  It has been directed by David Yates, with a screenplay by JK Rowling &#038; Steve Kloves, based on the work of JK Rowling.  It was produced by David Heyman, JK Rowling, Steve Kloves, Lionel Wigram, and Tim Lewis.  Neil Blair, Danny Cohen, Josh Berger, Courtenay Valenti and Michael Sharp serve as executive producers.<\/p>\n<h2>Dumbledore&#8217;s Secrets Coming to HBO Max<\/h2>\n<p>Fantastic Beasts 3<strong> It premiered in theaters on April 8, 2022<\/strong> with quite poor results at the box office, where it has only achieved 388 million euros worldwide according to BoxOfficeMojo.  Now you will have a second chance at HBO Max, as the film will be released soon on the WarnerMedia platform at no additional cost beyond your subscription.<\/p>\n<p>On May 30, 2022, <strong>less than two months after its theatrical release<\/strong>you will be able to see the film again if you have already been to the cinema or find out what happens to Newt Scamander, Albus Dumbledore and Gellert Grindelwald in this latest installment of the Fantastic Beasts trilogy.<\/p>\n<p>The first two installments, Fantastic Beasts and Where to Find Them and Fantastic Beasts: The Crimes of Grindelwald, are now available on HBO Max, so you can set aside a weekend to binge-watch these magical movies.<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1671849\" class=\"wp-caption-text\">Fantastic Beasts: Dumbledore&#8217;s Secrets<\/p>\n<p><strong>Fantastic Beasts was originally conceived as a pentalogy<\/strong>but after the premiere of the third film, and having only reaped 388 million dollars worldwide (notably lower figures than the previous two, 811 million the first and 648 million the second), it is still up in the air and can that if it is successful on HBO Max they are encouraged to continue with it.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Next, we are going to tell you how and when you can see the new film from the magical universe of Harry Potter. New Harry Potter spin-off Dumbledore&#8217;s Secrets is the third installment of the Fantastic Beasts spin-off after Fantastic Animals and Where to Find Them (2016) and Fantastic Animals: The Crimes of Grindelwald (2018). [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2084,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2082"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2082"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2082\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2084"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2082"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2082"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2082"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}