{"id":2117,"date":"2022-05-24T09:09:48","date_gmt":"2022-05-24T09:09:48","guid":{"rendered":"https:\/\/why-what-who.com\/how-to-apply-price-and-what-to-know\/"},"modified":"2022-05-24T09:09:48","modified_gmt":"2022-05-24T09:09:48","slug":"how-to-apply-price-and-what-to-know","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/how-to-apply-price-and-what-to-know\/","title":{"rendered":"How to apply, price and what to know"},"content":{"rendered":"<p>All operators allow us to request a duplicate SIM card, although the process and price depend on each one of them.  Yes, you should bear in mind that everyone will force us to be the holders of the card and the contract if we want<\/p>\n<h2>What is a duplicate SIM?<\/h2>\n<p>We must bear in mind that a duplicate SIM is not the same as the MultiSIM service offered by some operators.  That is, have the <strong>MultiSIM service activated<\/strong> (as allowed by O2 or as allowed by Vodafone, Orange and other operators) it allows us to have the same service on two different devices but the same number, the same contract&#8230; but using it interchangeably on two devices if we have a tablet and a mobile phone, for example.  In this case, we have to pay monthly to have this service activated.<\/p>\n<p>But a duplicate SIM card is not this.  A duplicate SIM can have a specific cost or be free, depending on the operator.  This allows us to have a<strong> new SIM card that will cancel the previous one.<\/strong> When we make a duplicate, the card we had is canceled and the new one starts to work so we cannot have it on two devices but only one device.<\/p>\n<p>We make a duplicate SIM card when we lose our mobile phone, when it is stolen, when it breaks.  The most common thing is that we do it if someone steals our mobile phone or it is lost because we will prevent the person who finds it or who has stolen it from us from using our mobile rate and we will avoid extra charges on the bill for fraudulent use. of our contract, for example.  As soon as we activate the new SIM, the previous one will be deactivated, so this will help us avoid scares at the end of the month or prevent them from taking advantage of our rate for calls abroad, for extra costs&#8230;<\/p>\n<h2>How to apply<\/h2>\n<p>If we want to request a duplicate SIM, we can do so by calling Digi or from a store or establishment that works with the operator.<\/p>\n<p>If we do it by phone we must <strong>call 1200 if we have a DIGI number<\/strong> or it is that card that we want to duplicate.  If we do it from a number of another operator we can<strong> call 642 642 642<\/strong> to request the requested card.  We will have to give our data to confirm that we are the holders of the account and that the SIM card we want to duplicate belongs to us.<\/p>\n<p>In the case of wanting to do it physically, we can go to any of Digi&#8217;s points of sale with the identity document.  Here we can give our data to confirm that we are the holders of the account and that we have the right to duplicate the SIM card to insert it into the phone we use.<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1309848\" class=\"wp-caption-text\">digi<\/p>\n<p>How much does it cost?  There are operators that charge us a small amount for this new card.  N price that is usually around five euros.  But in Digi&#8217;s case, no.  Make <strong>a SIM duplicate at Digi is totally free<\/strong> and it&#8217;s immediate if we go to an establishment: when we go to the store and give our data we will receive a card that we can activate immediately to start using it.  Of course, as we have already explained in previous paragraphs, you must be the owner of the account or the service if we want to request the duplicate, since this avoids privacy and security problems of people who can clone our card.<\/p>\n<h2>What should we consider<\/h2>\n<p>There are a number of aspects that we must take into account and the main thing is what codes are written on the card that we are going to receive or what those codes are that we are going to receive when we make a Digi SIM duplicate.  Although it can vary depending on the operator, there are usually three different codes: <strong>the PIN code, the PUK code and the serial number or iCC number of the received SIM card.<\/strong><\/p>\n<p>The first is the PIN code and it is the four-digit code that we have to enter whenever we turn on the mobile and want to access the SIM card.  The second is the PUK code, which is an eight-digit code that you must take into account and know why we will need it whenever we enter the PIN number incorrectly.  An eight-digit code that will unlock the phone if you don&#8217;t know the PIN or you&#8217;ve entered it wrong three times.  The last one is the ICC code or serial number and it is the identification of that card that you will need to carry out any procedure such as portability, activate a card or change it. <strong>They are usually 19 digits<\/strong> but it will depend on the operator and will also depend on the time of purchase.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1328712 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/How-to-apply-price-and-what-to-know.jpg\" alt=\"SIM cards\" width=\"1000\" height=\"673\"  \/><\/p>\n<p>Another question that we can ask ourselves when making a duplicate SIM card is what will change in our contract or in our rate once we have changed the SIM card.  Are we going to have the same number?<strong> Yes, the phone number will not change.<\/strong> Is it the same rate and is the permanence maintained if there is one?  Neither will anything change here and we will continue to have the same rate, the same telephone number or the same conditions with the operator.  It will not change anything in what we have but we are simply going to have a new card.<\/p>\n<p>We must bear in mind that contacts are not always <strong>are associated with the SIM card<\/strong> or to the phone so making this change or duplication will have nothing to do with being able to keep them or not because it will depend on where you have them stored and the most advisable thing is that you do it in the Google account.  In addition, it will also depend on whether you have lost your smartphone or simply if your card has been broken but you keep everything intact on your mobile: contacts, agenda, messages, photos&#8230;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>All operators allow us to request a duplicate SIM card, although the process and price depend on each one of them. Yes, you should bear in mind that everyone will force us to be the holders of the card and the contract if we want What is a duplicate SIM? We must bear in mind [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2120,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2117"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2117"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2117\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2120"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2117"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2117"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2117"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}