{"id":2121,"date":"2022-05-24T09:21:56","date_gmt":"2022-05-24T09:21:56","guid":{"rendered":"https:\/\/why-what-who.com\/qualifying-for-the-2022-qatar-world-cup-is-over-real-madrid-results\/"},"modified":"2022-05-24T09:21:56","modified_gmt":"2022-05-24T09:21:56","slug":"qualifying-for-the-2022-qatar-world-cup-is-over-real-madrid-results","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/qualifying-for-the-2022-qatar-world-cup-is-over-real-madrid-results\/","title":{"rendered":"Qualifying for the 2022 Qatar World Cup is over: Real Madrid results"},"content":{"rendered":"<p style=\"text-align: justify;\">With the dispute of the last matches yesterday, both in the UEFA zone and in the South American CONMEBOL, the qualifiers for the Qatar 2022 World Cup have come to an end and in some of which there was a leading role for Madrid.<\/p>\n<p>Dani Carvajal during the Spain match against Greece last Thursday in Hellenic territory<\/p>\n<p style=\"text-align: justify;\">First of all, it must be said that <strong>Daniel Carvajal<\/strong> managed to qualify on the fast track to the world championship after achieving the two wins that Spain needed.  The Madrid winger started in the first match against Greece, which ended with a narrow victory for Luis Enrique&#8217;s men (1-0), but he did not play in the second and final match, against Sweden, which ended with the same result.<\/p>\n<p style=\"text-align: justify;\">For its part, <strong>Eden Hazard and Thibaut Courtois<\/strong> They have managed to qualify directly for the World Cup with Belgium.  The two madridista players, who started in the comfortable 3-1 victory against Estonia, signed their passport to Qatar with this victory, regardless of what they did in the game they played against Wales in Cardiff on Tuesday.  This meeting ended with a tie at one and in which neither Courtois nor Hazard were present since Roberto Martínez, the Belgian coach, gave them <strong>permission to return<\/strong> to Madrid.<\/p>\n<p style=\"text-align: justify;\">Precisely, Wales, which had <strong>Gareth Bale<\/strong> during halftime in Saturday&#8217;s 5-1 win over Belarus but was sidelined by one <strong>untimely injury to a twin<\/strong>, known a few hours before the match against Belgium, will have to wait to see if he plays the World Cup.  By qualifying second in Group E, they will play the playoffs along with 12 other countries.<\/p>\n<p><img loading=\"lazy\" class=\"wp-image-26946 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653384115_989_Qualifying-for-the-2022-Qatar-World-Cup-is-over-Real.jpg\" alt=\"\" width=\"720\" height=\"405\"  \/>Luka Modric will be in the next World Cup after his victory against Russia<\/p>\n<p style=\"text-align: justify;\">Another who will also be with his team in the next World Cup is <strong>Luka modric<\/strong>.  The veteran midfielder and captain of Croatia signed his pass that Sunday after winning 2-0 against Russia, in the direct confrontation between the first two of group H. Previously, in Thursday&#8217;s game, Croatia thrashed Malta 7-1, with a goal and an assist from the Real Madrid player, who played both games.<\/p>\n<p style=\"text-align: justify;\">The France of <strong>Karim Benzema<\/strong> It was also one of the first European teams to qualify for the World Cup, after Saturday&#8217;s 8-0 rout against Kazakhstan, including a brace from the Madrid striker.  A Benzema in a state of grace that he scored again in Tuesday&#8217;s inconsequential match against Finland and that ended with a new French victory, in this case 2-0.<\/p>\n<p style=\"text-align: justify;\"><strong>Luka Jović<\/strong> He also managed to seal his passport to Qatar 2022 with Serbia (which only had one game left to play in this qualifying group) thanks to a surprising victory achieved in extremis against the group favorites, Portugal, in a match in which the Real Madrid striker barely played a few minutes.  Of course, Jovic scored the second of the four goals with which Serbia beat Qatar in a friendly played on Thursday.<\/p>\n<p style=\"text-align: justify;\">he was less lucky <strong>David Alaba<\/strong> with Austria, although at least he will play the World Cup play-off thanks to the two victories achieved with his team, against Israel and Moldova, which did not allow him to approach the first two of Group F.<\/p>\n<p style=\"text-align: justify;\">Finally, Austria finished in fourth position, far behind Denmark and Scotland but thanks to their role in the Nations League, they have earned a place in the play-offs together with the Czech Republic.<\/p>\n<p><img loading=\"lazy\" class=\"wp-image-26947 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653384116_702_Qualifying-for-the-2022-Qatar-World-Cup-is-over-Real.jpg\" alt=\"\" width=\"1200\" height=\"675\"  \/>Karim Benzema was key in France&#8217;s victories against Kazakhstan and Finland with his three goals<\/p>\n<p style=\"text-align: justify;\">For their part, with regard to the South American qualifiers, the three Real Madrid players called up by Brazil, <strong>Militao, Casemiro and Vinicius<\/strong>they return to Madrid with their homework done.<\/p>\n<p style=\"text-align: justify;\">After their narrow win against Colombia on Friday, Tité&#8217;s team mathematically qualified for the World Cup, becoming the first South American team to do so.  In this match, Casemiro -who played the 90 minutes- saw his second yellow card and the Brazilian coach allowed him<strong> fly back to Madrid<\/strong>.<\/p>\n<p style=\"text-align: justify;\">In the cases of Vinicius and Militao, it must be said that they were not in the game against Colombia and only the striker was able to have a few minutes, after replacing Neymar.  However, both were starters this Tuesday against Argentina, playing the entire game and, in the case of Vinicius, leaving a spectacular lambretta in a play that almost ended in a goal.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>With the dispute of the last matches yesterday, both in the UEFA zone and in the South American CONMEBOL, the qualifiers for the Qatar 2022 World Cup have come to an end and in some of which there was a leading role for Madrid. Dani Carvajal during the Spain match against Greece last Thursday in [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2122,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2121"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2121"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2121\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2122"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2121"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2121"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2121"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}