{"id":2161,"date":"2022-05-24T19:06:22","date_gmt":"2022-05-24T19:06:22","guid":{"rendered":"https:\/\/why-what-who.com\/you-will-not-be-able-to-have-new-books-in-these-kindle\/"},"modified":"2022-05-25T13:05:12","modified_gmt":"2022-05-25T13:05:12","slug":"you-will-not-be-able-to-have-new-books-in-these-kindle","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/you-will-not-be-able-to-have-new-books-in-these-kindle\/","title":{"rendered":"You will not be able to have new books in these Kindle"},"content":{"rendered":"<p>Reading is possibly one of the most enriching activities we can do.  Leaving aside the different student levels where it is mandatory to read according to which books, the truth is that reading is capable of transporting you and making you live stories of all kinds.  Taking books away from home can be cumbersome due to their weight or size, but that&#8217;s what electronic books like Amazon&#8217;s Kindle are for.  The company has some quite modern, <strong>but it seems that some older ones have &#8220;their days numbered&#8221;<\/strong>.<\/p>\n<p>If we go to Amazon right now and look to buy a new Kindle, we will find that there are some different models available on the platform, but all quite recent.  Before these came others who, to this day, <strong>are discontinued on this platform<\/strong>and in fact Amazon seems hell-bent on making users abandon them to buy a new one.<\/p>\n<h2>The Store disappears from these Kindle<\/h2>\n<p>If you have <strong>a base model of Kindle 2nd to 5th generation<\/strong> either <strong>a Kindle DX<\/strong>, you should know that we have bad news for you.  As we can read in Techradar, the users of these 5 devices have begun to receive an email informing them that very soon <strong>they will not have access to the Kindle Store<\/strong>.  This is a serious blow to these users, since they are basically taking away one of the fundamental parts of the Kindle experience.<\/p>\n<p>The Kindle Store is the place where we have access to buy and download the books that Amazon has for its users.  Removing this from Kindles is preventing users from <strong>can buy new books<\/strong> <strong>to use them on your devices<\/strong>.  Obviously, the limitation of access to the Kindle store is not immediate, and users are always in time to download all the books purchased up to that moment.  Of course, when they stop being able to access the store, they will no longer be able to download the books from it.<\/p>\n<p><\/p>\n<p id=\"caption-attachment-1676616\" class=\"wp-caption-text\">Kindle model that will no longer have access to the Store.<\/p>\n<p>In these same emails, <strong>Amazon would be offering a 30% discount to buy a new Kindle<\/strong>, as well as a $40 coupon to buy books.  At the moment, we do not have confirmation that this promotion will reach our country, but it would certainly be great news to alleviate the hard &#8220;blow&#8221; that owners of older Kindle models are about to suffer.<\/p>\n<h2>Don&#8217;t worry: you can continue using them<\/h2>\n<p>As we say, removing the Kindle store from these devices is going to take away many arguments to continue using them, although despite this, it must be taken into account that there are <strong>some legal ways so that we can continue to use new books on them without problems<\/strong>.  The first of these options is really simple, and that is that we will only have to <strong>buy the books on another device<\/strong> with our same Amazon account.  It does not matter if we do it through the PC or a smartphone, when buying it we will be given the option to send that book to one of our devices, so we can send it to one of these Kindles without problems (as long as we have it synchronized with that account).<\/p>\n<p>The other option we have may seem a bit more cumbersome, but it&#8217;s actually quite simple as well.  To do this, all we have to do is put our books on the Kindle through Caliber, a solution that works great and that we can even use <strong>without connecting the Kindle to the computer<\/strong>.  For this, it will be necessary for us to download or buy the books on another site, although that also means that we have more options when choosing a store.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Reading is possibly one of the most enriching activities we can do. Leaving aside the different student levels where it is mandatory to read according to which books, the truth is that reading is capable of transporting you and making you live stories of all kinds. Taking books away from home can be cumbersome due [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2163,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2161"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2161"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2161\/revisions"}],"predecessor-version":[{"id":2223,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2161\/revisions\/2223"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2163"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2161"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2161"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2161"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}