{"id":2164,"date":"2022-05-24T19:18:26","date_gmt":"2022-05-24T19:18:26","guid":{"rendered":"https:\/\/why-what-who.com\/save-battery-life-on-your-laptop-when-using-ubuntu-linux-with-these-tips\/"},"modified":"2022-05-24T19:18:26","modified_gmt":"2022-05-24T19:18:26","slug":"save-battery-life-on-your-laptop-when-using-ubuntu-linux-with-these-tips","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/save-battery-life-on-your-laptop-when-using-ubuntu-linux-with-these-tips\/","title":{"rendered":"Save battery life on your laptop when using Ubuntu Linux with these tips"},"content":{"rendered":"<p>Many users and for various reasons, prefer to use an open source operating system such as <strong>Ubuntu<\/strong>, instead of the usual Windows.  The reasons for this are very varied, although Linux developers today are working to convince them.<\/p>\n<p>We mention Ubuntu because it is about <strong>one of the most loved distros<\/strong> and used all over the world.  It is true that we have a wide range of products here to choose from and install on our equipment.  However, over the years this distro has earned the trust of millions.  That is precisely why its developers work continuously to convince a growing number of users to migrate to their proposal.<\/p>\n<p>Unlike the operating system <strong>microsoft<\/strong>we must bear in mind that we can install most of the <strong>Linux distributions completely free<\/strong>.  And it is that these also present us with more and more functions of great utility and accessible even for novice users.  With these we mean that all those who are afraid to enter this type of operating system, have it easier than ever, so it is highly recommended.<\/p>\n<p>A clear example of all this we will find in the <strong>functions offered by the aforementioned Ubuntu<\/strong> Linux in general terms.  That is why we are going to talk about the changes that you can make to <strong>save battery<\/strong> if you use it on a laptop.  And it is that one of the main premises that this set of software and hardware must meet is to offer us maximum autonomy.  For this, the aforementioned open source operating system can be very helpful, as we will see below.<\/p>\n<h2>Changes in Linux Ubuntu to save battery<\/h2>\n<p>By default, a Linux operating system is usually configured to offer us the best user experience.  However, we work with a laptop and do not have access to mains power at the moment, we should make some effective changes.<\/p>\n<p style=\"display:inline-block; width:100%;\"><strong>reduce brightness<\/strong>: If we take a look at the top right corner of the main interface on the Ubuntu desktop, we see an icon in the shape of a battery.  We only have to click on it so that a slider bar appears on the screen that allows us to decrease its brightness.  If we lower this to the minimum, enough to be able to work, we will save a huge amount of battery.<\/p>\n<p><strong>Schedule screen off<\/strong>: Another available function that we access from the operating system configuration is the programming of the screen shutdown.  What we achieved is that one of the elements that most <strong>consumes energy<\/strong>stop working when we are not using the laptop, all automatically.<\/p>\n<p><strong>automatically suspend<\/strong>: This is something that Ubuntu also allows us to do, not only with the mentioned screen, but with the whole team.  With this, what we want to tell you is that we have the possibility of programming the <strong>pc sleep<\/strong> completely to save as much battery as possible.  This does not mean that we turn it off completely, but a good part of its components will stop working and consuming energy.<\/p>\n<p><strong>close apps<\/strong>: but if we need to use it constantly without having access to the electricity network, we recommend opening only what we really need.  Computer resource consumption <strong>negatively affects battery consumption<\/strong>.  Therefore, a movement that we can carry out is to close all those programs that we do not need.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Many users and for various reasons, prefer to use an open source operating system such as Ubuntu, instead of the usual Windows. The reasons for this are very varied, although Linux developers today are working to convince them. We mention Ubuntu because it is about one of the most loved distros and used all over [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2166,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2164"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2164"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2164\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2166"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2164"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2164"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2164"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}