{"id":2167,"date":"2022-05-24T19:32:34","date_gmt":"2022-05-24T19:32:34","guid":{"rendered":"https:\/\/why-what-who.com\/tickets-sold-out-for-the-formula-1-spanish-grand-prix\/"},"modified":"2022-05-25T13:05:26","modified_gmt":"2022-05-25T13:05:26","slug":"tickets-sold-out-for-the-formula-1-spanish-grand-prix","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/tickets-sold-out-for-the-formula-1-spanish-grand-prix\/","title":{"rendered":"Tickets sold out for the Formula 1 Spanish Grand Prix"},"content":{"rendered":"<p>Barcelona, ​​Spain.- The <strong>Spanish Grand Prix<\/strong> of the <strong>Formula 1<\/strong> -the sixth of the World Cup-, which will be held at the Barcelona-Catalonia Circuit from May 20 to 22, has already sold out after the last two years with public restrictions due to the pandemic.<\/p>\n<p>This was announced last Wednesday by Josep Lluís Santamaría, director of the Barcelona track, during the presentation of the race at the Tibidabo Amusement Park. An event that was also attended by Roger Torrent, Minister of Business and Labor of the Generalitat and president of the <strong>Circuit of Barcelona-Catalonia<\/strong>; Jaume Collboni, first deputy mayor of the Barcelona City Council; Pere Rodríguez, Mayor of Montmeló; Josep Mateu, president of the RACC; and former Formula 1 driver Pedro Martínez de la Rosa.<\/p>\n<p>“After two very sad years in which we have not been able to tell the atmosphere of the public, we have them by our side again and we have already hung the &#8216;no tickets&#8217; sign. That is great news,” Santamaría stressed.<\/p>\n<p>Layout of the Barcelona-Catalonia Circuit of the Spanish GP\/@spanishgp_<\/p>\n<p>In fact, to meet the demand for tickets, the circuit has had to expand two grandstands and install a new one. &#8220;And we&#8217;ve just put on sale a package of slightly smaller viewing seats at a special price,&#8221; he explained.<\/p>\n<p>So that <strong>Barcelona<\/strong> breathe more <strong>Formula 1<\/strong> More than ever before, the circuit and the City Council of the Catalan capital have created the Village Barcelona &amp; Circuit, which will be open to the public (admission is free) on the Barceloneta wharf in Port Vell, from May 13 to 21. &#8220;This Grand Prix is ​​one of the great examples of how the city is reactivating itself, of how the great sporting and economic events have returned,&#8221; said the first deputy mayor of the Barcelona City Council, Jaume Collboni.<\/p>\n<p><strong>We recommend you read<\/strong><\/p>\n<p>The &#8216;village&#8217; will have a stage and a giant screen with music and revitalizers, the Arrows that Pedro de la Rosa piloted in 1999 and the recreation of a box inside with &#8216;pit-stop&#8217; displays. Fans will have the opportunity to change tires on a single-seater and will also have a slot car track and an eSports simulator area. And the little ones can enjoy a pedal car circuit.<\/p>\n<p>An <strong>Spanish Grand Prix<\/strong> revitalized that generates a business of 28 million euros and 2,000 jobs and that this year will count for the first time since 2018 in <strong>Formula 1<\/strong> with two Spanish drivers: Carlos Sainz and Fernando Alonso.<\/p>\n<p class=\"authorbox__description\">He has a degree in Communication Sciences from the Universidad de Occidente, Guasave Unit, specializing in Media. In his career as a journalist he has carried out works focused on the agricultural, fishing, health, economic sectors, among others. In 2016 he joined EL DEBATE, where he worked as a local reporter in Guasave, where he also covered the news, sports and police sections. Since 2017 he entered the digital area as a reporter for the EL DEBATE newspaper portal at www.debate.com.mx specializing in the Sports section. In addition to studying and passing the &#8220;Sports Journalism Workshop&#8221; at the University of Guadalajara in its Virtual University system.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Barcelona, ​​Spain.- The Spanish Grand Prix of the Formula 1 -the sixth of the World Cup-, which will be held at the Barcelona-Catalonia Circuit from May 20 to 22, has already sold out after the last two years with public restrictions due to the pandemic. This was announced last Wednesday by Josep Lluís Santamaría, director [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2168,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2167"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2167"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2167\/revisions"}],"predecessor-version":[{"id":2224,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2167\/revisions\/2224"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2168"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2167"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2167"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2167"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}