{"id":2169,"date":"2022-05-24T19:50:42","date_gmt":"2022-05-24T19:50:42","guid":{"rendered":"https:\/\/why-what-who.com\/problems-with-liberbank-migration\/"},"modified":"2022-05-25T13:05:32","modified_gmt":"2022-05-25T13:05:32","slug":"problems-with-liberbank-migration","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/problems-with-liberbank-migration\/","title":{"rendered":"Problems with Liberbank migration"},"content":{"rendered":"<p>In recent years, we have been able to attend some fairly important mergers of banking entities in our country.  One of the last mergers agreed was between Unicaja and Liberbank, two entities that last July agreed to unify to become the fifth largest bank in Spain.  Since then, the merger process has been advancing little by little, but <strong>one of the last steps of this seems to have caused the Unicaja app to stop working<\/strong>.<\/p>\n<p>As we say, the merger of banking entities <strong>It is not a new process at all.<\/strong>.  With this process, both banking entities add clients and infrastructures, giving rise to a single much more solid entity.  These processes are not simple at all, and although they do not usually cause any type of consequence towards the clients of both entities, it seems that on this occasion it is not the case.<\/p>\n<h2>A problematic client migration<\/h2>\n<p>The merger between Unicaja and Liberbank has not been quick.  The last step that needed to be taken so that both entities act as one in all aspects (like Unicaja, since Liberbank disappears as such) is <strong>the migration of clients from Liberbank to Unicaja&#8217;s technological infrastructure<\/strong>.  This change was already agreed last year, since the technological services provider that Liberbank had has disappeared.  It must be taken into account that this migration not only implies that Liberbank customers will have to operate with Unicaja tools, but also that <strong>your IBANs will change to accommodate the new entity<\/strong>.<\/p>\n<p>This process was scheduled for last Thursday, May 19, and it was estimated that it would last until Sunday the 22nd. As of Friday the 20th at 3:00 p.m., Liberbank&#8217;s online banking platform ceased to exist forever.  All clients of this entity had to start from that moment to <strong>operate through Unicaja online banking<\/strong> or with its application for mobile devices.<\/p>\n<p>Despite the fact that, in theory, all Unicaja services should be available and fully operational last Sunday (for both Unicaja and Liberbank customers), what has really happened is that since then <strong>they keep reporting bugs<\/strong>.  The Unicaja application has registered a million download requests in a very short time, which has caused a massive saturation in the app, leaving thousands of customers of both entities throughout Spain without service.  We are talking about an almost total limitation of banking movements, leaving without access to services as popular as Bizum.  Unicaja has promised that these bugs will be solved very soon, so you have to be patient.<\/p>\n<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"es\" dir=\"ltr\">Good evening, we are very sorry for the inconvenience caused, we are finalizing some migration processes that are affecting the speed of access to digital banking.  If you wish, you can contact us privately.  All the best<\/p>\n<p>– Unicaja Banco (@UnicajaBanco) May 23, 2022<\/p><\/blockquote>\n<h2>This is how Liberbank customers will operate after the merger<\/h2>\n<p>As we have said before, the merger of both entities will result in the disappearance of Liberbank.  From now on, all Liberbank customers must use the Unicaja platform solely and exclusively, both online banking and through the app.  To do this, customers must access through these platforms <strong>with the same credentials they were using in Liberbank<\/strong>.<\/p>\n<p>For credit and debit cards, they will remain valid and fully functional until their expiration date.  Of course, when changing platforms it will be necessary to re-register them through the Unicaja app to pay with the mobile (only on Android).  Lastly, it should be noted that <strong>the conditions of your financial products will continue to remain intact<\/strong>, and they will also be able to withdraw money without problems at Liberbank ATMs that are still active, as well as at Unicaja ones.  Obviously, customers who were already Unicaja will continue to operate exactly as they have been to date.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In recent years, we have been able to attend some fairly important mergers of banking entities in our country. One of the last mergers agreed was between Unicaja and Liberbank, two entities that last July agreed to unify to become the fifth largest bank in Spain. Since then, the merger process has been advancing little [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2170,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2169"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2169"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2169\/revisions"}],"predecessor-version":[{"id":2225,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2169\/revisions\/2225"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2170"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2169"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2169"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2169"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}