{"id":2171,"date":"2022-05-24T20:18:56","date_gmt":"2022-05-24T20:18:56","guid":{"rendered":"https:\/\/why-what-who.com\/do-you-want-to-learn-programming-dont-make-these-mistakes\/"},"modified":"2022-05-24T20:18:56","modified_gmt":"2022-05-24T20:18:56","slug":"do-you-want-to-learn-programming-dont-make-these-mistakes","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/do-you-want-to-learn-programming-dont-make-these-mistakes\/","title":{"rendered":"Do you want to learn programming?  Don&#8217;t make these mistakes"},"content":{"rendered":"<p>There are many users who are currently launching <strong>programming industry<\/strong> thanks to the facilities available today.  They have at their fingertips a multitude of platforms, services and applications that will be very helpful for this type of task.<\/p>\n<p>It must be taken into account that at the moment everything related to programming and software development is in high demand at a professional level.  In addition, there are many others who choose to enter this field either for issues related to education or for personal growth.  To all this, we can add that it is enough that we have a PC and a <strong>Internet connection<\/strong> to start from scratch even on our own.<\/p>\n<p>In turn, and as we mentioned before, the means available today are much greater in number than just a few years ago.  In addition, thanks to the internet we have access to a huge amount of <strong>online help<\/strong>, many of it for free.  All this that we are commenting on can be extended both to the development of all kinds of applications, to being part of larger projects, or even to the creation of our own video games.<\/p>\n<p>With everything and with it and despite the <strong>means available in full 2022<\/strong>, there are certain mistakes that we should not make before entering this sector of programming.  This is something that is especially evident if we are new to this type of task and want to start from scratch.  It is for all these reasons that we are going to talk about a series of mistakes that you should avoid before starting to <strong>learn programming from scratch<\/strong>.<\/p>\n<h2>Mistakes to avoid when learning programming<\/h2>\n<p>Possibly one of the main objectives that we seek here is to obtain tangible results as soon as possible.  But as for almost everything, in the <strong>software development industry<\/strong> patience is important.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<ul>\n<li><strong>Being in a hurry to get results<\/strong>: before starting with the development as such, we should learn and be clear about some basic concepts.  Here we refer to acceptably function in everything related to the <strong>boolean and binary algebra<\/strong>, for example.  It wouldn&#8217;t hurt to know either. <strong>arithmetic<\/strong> and the internal operation at the software level of the PC.<\/li>\n<li><strong>Think carefully about goals and means<\/strong>: before starting with the development of applications, we must bear in mind that this is not easy.  It is a learning process that may last a lifetime, as this is an industry where there is always something to learn.  Therefore, before starting we should be clear about the type of developments we want to start with, and look for a <strong>suitable programming language<\/strong>.  Next, we would ideally focus on that particular language until we can have some control over it.  This will save us a lot of time in the future when it comes to getting into other platforms and programming languages.<\/li>\n<li><strong>learn without help<\/strong>: We have already told you before that right now we have a great advantage, which is the internet.  Here we can find a wide community of developers willing to help us with our doubts.  In the same way we have a multitude of documentation and even <strong>video tutorials<\/strong> that will allow us to start with the learning watch programming little by little.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>There are many users who are currently launching programming industry thanks to the facilities available today. They have at their fingertips a multitude of platforms, services and applications that will be very helpful for this type of task. It must be taken into account that at the moment everything related to programming and software development [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2173,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2171"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2171"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2171\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2173"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2171"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2171"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2171"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}