{"id":2194,"date":"2022-05-25T09:24:02","date_gmt":"2022-05-25T09:24:02","guid":{"rendered":"https:\/\/why-what-who.com\/press-the-red-button-on-your-smart-tv-remote\/"},"modified":"2022-05-25T13:06:10","modified_gmt":"2022-05-25T13:06:10","slug":"press-the-red-button-on-your-smart-tv-remote","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/press-the-red-button-on-your-smart-tv-remote\/","title":{"rendered":"Press the red button on your Smart TV remote"},"content":{"rendered":"<p>Mediaset Spain has reported the arrival of <strong>The Uncheck<\/strong>its sports information brand, to national Smart TVs through an app that will allow users to access data and statistics in real time on national and international soccer matches.<\/p>\n<p>This app is the <strong>first sports for HbbTV in Spain<\/strong>.  If you are a sports fan, you will be happy to know that you can now see live sports information from your Smart TV.<\/p>\n<h2>El Desmarque, now in app<\/h2>\n<p>In terms of sports information, El Desmarque already stands out as a television program on Cuatro and for its digital sports information in web format.  An application will now be available that will be accessible by pressing the red button on the remote control of your Smart TV or through a link sponsored by an advertiser inserted in display format and in the shape of an &#8216;L&#8217; during the programming of the different Mediaset España channels. .<\/p>\n<p><\/p>\n<p id=\"caption-attachment-1676340\" class=\"wp-caption-text\">The Uncheck App<\/p>\n<p>According to the latest data from the IAB annual study “Mobile and connected devices 2021”, <strong>7 out of 10 Spaniards already have a Smart TV<\/strong>.  This boom in smart televisions represents a growth of 17% compared to 2019 data. With such a percentage, it is normal for large communication groups to see in this type of content a great opportunity for growth and profit from advertising.<\/p>\n<p>The clients of Publiespaña, the advertising subsidiary of Mediaset España in charge of the commercial exploitation of its channels, also have at their disposal to include advertising messages within the application.  Smart TV users in Spain make up a very attractive qualitative profile for advertisers: mostly male, with an age range between 25 and 54 years, belonging to the active population and connected to the Internet at home.<\/p>\n<h2>What content does the app offer?<\/h2>\n<p>Mainly, El Desmarque will be a sports results app with<strong> live sports information<\/strong>.  There will be no lack of match schedule, results and updated rankings.  The Spanish First and Second Division Leagues, the Copa del Rey and the two main European competitions, the Champions League and the Europa League, are the first competitions that can be consulted in the application.<\/p>\n<p><img viewbox=\"0 0 3 2\" aria-describedby=\"caption-attachment-1676337\" loading=\"lazy\" class=\"size-full wp-image-1676337\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653470642_574_press-the-red-button-on-your-Smart-TV-remote.jpg\" alt=\"The Uncheck App\" width=\"640\" height=\"360\"><\/p>\n<p id=\"caption-attachment-1676337\" class=\"wp-caption-text\">The Uncheck App<\/p>\n<p>Mediaset was the <strong>The only Spanish audiovisual company awarded by the HbbTV Association<\/strong>, a global initiative dedicated to providing open standards for advanced interactive television services, which recognizes excellence in the sector with its annual awards.  At the end of last year, the jury recognized initiatives such as the launch of the version of Mitele for Smart TV, apps for sporting events such as the 2018 World Cup in Russia or the 2020 European Championship, the LOVEStv content platform and advertising formats adapted to television connected, among others.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Mediaset Spain has reported the arrival of The Uncheckits sports information brand, to national Smart TVs through an app that will allow users to access data and statistics in real time on national and international soccer matches. This app is the first sports for HbbTV in Spain. If you are a sports fan, you will [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2197,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2194"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2194"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2194\/revisions"}],"predecessor-version":[{"id":2231,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2194\/revisions\/2231"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2197"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2194"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2194"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2194"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}