{"id":2200,"date":"2022-05-25T10:44:04","date_gmt":"2022-05-25T10:44:04","guid":{"rendered":"https:\/\/why-what-who.com\/windows-3-0-is-32-years-old-use-its-file-explorer-now\/"},"modified":"2022-05-25T10:44:04","modified_gmt":"2022-05-25T10:44:04","slug":"windows-3-0-is-32-years-old-use-its-file-explorer-now","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/windows-3-0-is-32-years-old-use-its-file-explorer-now\/","title":{"rendered":"Windows 3.0 is 32 years old, use its File Explorer now"},"content":{"rendered":"<p>The software of the giant Microsoft has been with us for several decades and succeeding in most cases.  Much of today&#8217;s desktop computers have <strong>Windows 10 and 11<\/strong>but to get to this point the firm launched a multitude of previous versions that many of you will surely remember.<\/p>\n<p>Right now we want to focus on <strong>Windows 3.0<\/strong>as <strong>just turned 32<\/strong> and it still evokes fond memories for many users around the world.  We cannot forget that the Windows environment was the one that <strong>replaced the MS-DOS operating system<\/strong> which basically focused on the use of commands.  Therefore, this graphical interface, which later became an independent operating system, was a huge advance.  In fact, the aforementioned Windows 3.0 could be considered as the first <strong>graphic software<\/strong> of these Microsoft features that really succeeded.<\/p>\n<p>It was launched in 1990 and to give you an idea, this was the predecessor of the first <strong>Windows 3.1 that saw the light in 1992<\/strong>.  Among the main features of this version, its developers included an improved user interface compared to the previous version, 2.1x.  In addition, interesting functions arrived here that delighted users, such as the <strong>memory management for intel processors<\/strong> of the time.  In addition, elements such as run windows, the <strong>program manager<\/strong> and a Control Panel comparable to the current one.<\/p>\n<p>At the same time, one of the functions that attracted the most attention at first in this Windows 3.0 graphical interface was its <strong>File Browser<\/strong>.  This allowed us to work with our content in the form of files and folders in a much more fluid and functional way than using commands.<\/p>\n<h2>Use Windows File Explorer 3.0 in Windows 10 and 11<\/h2>\n<p>In fact, and as you all know, this is a basic element in current Microsoft systems such as Windows 10 and 11. Obviously, this feature has evolved a lot in recent years, although less than what many users require.  It is possible that some of the nostalgic still want to use in the <strong>latest system versions <\/strong>operating system, the File Explorer of the aforementioned version of Windows that has just turned 32 years old.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>Therefore, if you want to experience the file explorer again and use it in the current versions of the system, it is something that you can easily do.  We tell you all this because at any time you have the possibility of downloading a <strong>standalone application<\/strong>.  With this, you will be able to install that Explorer that is already somewhat out of date on our computers.  This is something that we can carry out directly from the official Microsoft store itself.<\/p>\n<p>Thus, after downloading Windows File Manager we can return to <strong>live that experience of years ago with our files and folders<\/strong> in the computer.  Of course, we must bear in mind that this Explorer is much more limited than the most current versions that we find in Windows by default.  But with everything and with them, surely more than one will smile.  All by recalling those times in a software that has just turned nothing more and nothing less than 32 years.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The software of the giant Microsoft has been with us for several decades and succeeding in most cases. Much of today&#8217;s desktop computers have Windows 10 and 11but to get to this point the firm launched a multitude of previous versions that many of you will surely remember. Right now we want to focus on [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2202,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2200"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2200"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2200\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2202"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2200"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2200"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2200"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}