{"id":2210,"date":"2022-05-25T12:59:47","date_gmt":"2022-05-25T12:59:47","guid":{"rendered":"https:\/\/why-what-who.com\/this-is-how-you-see-screenshots-and-videos-of-your-games-purchased-on-the-epic-store\/"},"modified":"2022-05-25T12:59:47","modified_gmt":"2022-05-25T12:59:47","slug":"this-is-how-you-see-screenshots-and-videos-of-your-games-purchased-on-the-epic-store","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/this-is-how-you-see-screenshots-and-videos-of-your-games-purchased-on-the-epic-store\/","title":{"rendered":"This is how you see screenshots and videos of your games purchased on the Epic Store"},"content":{"rendered":"<p>One of the ones that is growing the most in recent times and that wants to compete one day face to face with the aforementioned <strong>Steam<\/strong>, is the Epic Games store.  With the passage of time, the availability of titles is increasing, one of the biggest attractions for game lovers.  But that&#8217;s not all, because the functionality of the game store client that we installed on the computer is also gradually improving.  To all this, we can add an interesting movement that this store offers us weekly, and that is that it allows us to get hold of <strong>normally paid games, for free<\/strong>.<\/p>\n<p>This is something that most of the regulars take advantage of in the Epic Store every Thursday afternoon.  All this allows us to increase our content library here <strong>without spending a single euro<\/strong>.  In fact, those who have been taking advantage of this movement for a long time on the part of <strong>Epic<\/strong>, now sport an interesting library of games with zero financial outlay.  But as our library grows, maybe <strong>let&#8217;s forget some content<\/strong> that we have here bought or saved.<\/p>\n<p>That is why before <strong>download and install that game <\/strong>specifically on our computer, we may be interested in taking a look at some screenshots or demonstration videos.  It goes without saying that this will help us to know first-hand the type and quality of the title before its installation.<\/p>\n<h2>Remember the type of game you are going to install from the Epic Store<\/h2>\n<p>However, we must bear in mind that, from the library itself and its direct accesses to purchased titles, <strong>we can only install the game<\/strong>.  But in case we do not remember what the title was about, the library does not offer us many facilities except for a small cover photo.  At this point, the most interesting thing would be to be able to access some of its <strong>official screenshots or some video<\/strong> Show us how it works.<\/p>\n<p>But for this we do not need to use external solutions such as Google or YouTube, since the Epic Store client helps us.  This is precisely what we want to talk about so that we can take a first-hand look at the content of the title as such before installing it.  At this point, the best we can do to access these contents that we are commenting on is to click on the button represented by three vertical dots next to each game.  Here we can click on <strong>Go to store page<\/strong>.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>Actually, this will allow us to locate ourselves on the page corresponding to that title of the Epic store where we will have direct access to the <strong>game samples<\/strong>.  From here we can already see the captures that the Store offers us, as well as the videos that we often find to see first-hand how the content works.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-756456\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653483587_563_This-is-how-you-see-screenshots-and-videos-of-your.jpg\" alt=\"alien epic store\" width=\"1000\" height=\"536\"  \/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>One of the ones that is growing the most in recent times and that wants to compete one day face to face with the aforementioned Steam, is the Epic Games store. With the passage of time, the availability of titles is increasing, one of the biggest attractions for game lovers. But that&#8217;s not all, because [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2213,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2210"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2210"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2210\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2213"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2210"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2210"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2210"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}