{"id":2214,"date":"2022-05-25T13:01:04","date_gmt":"2022-05-25T13:01:04","guid":{"rendered":"https:\/\/why-what-who.com\/opening-this-pdf-can-lead-to-your-data-being-stolen\/"},"modified":"2022-05-25T13:01:04","modified_gmt":"2022-05-25T13:01:04","slug":"opening-this-pdf-can-lead-to-your-data-being-stolen","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/opening-this-pdf-can-lead-to-your-data-being-stolen\/","title":{"rendered":"Opening this PDF can lead to your data being stolen"},"content":{"rendered":"<p>We live in an era where virtually all of our vital information is on a computer or mobile device.  For this reason, computer security has gained enormous weight in recent years, since it is absolutely essential that our computers are as well protected as possible to deal with attacks of all kinds.  The problem is that cybercriminals take advantage of any loophole to attack us, and this PDF file is a pretty clear proof of that.<\/p>\n<p>We are all more than used to constantly checking our email, especially now that it is a fundamental tool for work.  If we are not careful and open the wrong file, we could be installing malware on our computer <strong>that can be very expensive<\/strong>.<\/p>\n<h2>A PDF file with a dangerous keylogger<\/h2>\n<p>The first thing to note is that it is quite curious that the cybercriminals responsible for this &#8220;wave&#8221; of infected PDFs have opted for this type of file.  As a general rule, these types of attempts are usually related to Microsoft Office files, such as Word and Excel.  In this case, what the fraudulent PDF is looking for is to install on our computer <strong>a type of malware called Snake<\/strong>.<\/p>\n<p>This is actually <strong>a keylogger<\/strong>.  What this type of malicious software does is record all the keystrokes that a user makes on their keyboard, so in this way it is capable of recording passwords and credentials of all kinds to transmit them to a server controlled by a cybercriminal. <strong>This was first detected back in 2020<\/strong>and since then there are several waves that have been recorded.<\/p>\n<p>   <\/p>\n<p id=\"caption-attachment-1554132\" class=\"wp-caption-text\">A keylogger records all our keystrokes.<\/p>\n<p><strong>The way this attack proceeds is really curious<\/strong>.  The PDF that reaches the trays has the name “REMMITANCE INVOICE.pdf” and has a Word embedded with a very strange name.  This, translated into Spanish, would be something like “has been verified.  However PDF, jpeg, xlsx, .docs».  The reason for this name is why we say that it is a rather curious attempt, since precisely with it what it is looking for is to catch people off guard who open the mail quickly and without paying attention, since when Adobe opens the file will appear to indicate that it is verified and that opening it is safe.<\/p>\n<h2>Be careful when opening unknown files<\/h2>\n<p>When analyzing the interior of the Word file that we have mentioned above, it was possible to verify that there was an embedded URL inside that downloads an Object Linking and Embedding (OLE) object to the computer.  This would contain inside a shellcode that <strong>exploits the registered vulnerability CVE-2017-11882<\/strong>and thanks to it, an executable called fresh.exe, which is actually the Snake malware, would be downloaded to our computer.<\/p>\n<p>The fact that this malware has been active for several years now, and continues to be used to exploit vulnerabilities like this, indicates that although the security of our computers is improving, we can never say that we are 100% covered.  As we always tell you around here, <strong>avoid downloading or opening any type of file if you do not know its origin<\/strong> or ask the sender if it is indeed a legitimate file.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We live in an era where virtually all of our vital information is on a computer or mobile device. For this reason, computer security has gained enormous weight in recent years, since it is absolutely essential that our computers are as well protected as possible to deal with attacks of all kinds. The problem is [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2216,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2214"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2214"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2214\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2216"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2214"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2214"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2214"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}