{"id":2236,"date":"2022-05-25T14:01:34","date_gmt":"2022-05-25T14:01:34","guid":{"rendered":"https:\/\/why-what-who.com\/save-the-steps-you-took-turn-on-history-log-in-photoshop\/"},"modified":"2022-05-25T14:01:34","modified_gmt":"2022-05-25T14:01:34","slug":"save-the-steps-you-took-turn-on-history-log-in-photoshop","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/save-the-steps-you-took-turn-on-history-log-in-photoshop\/","title":{"rendered":"Save the steps you took, turn on History Log in Photoshop"},"content":{"rendered":"<p>All of this is something that can be extended to both end users and those focused on more professional use.  It goes without saying that we are facing one of the great references in the image editing sector.  But first of all we must bear in mind that it is a <strong>commercial software and therefore payment<\/strong>.  The software giant Adobe has many prestigious titles to its credit.  Many of them focus on working with multimedia content where <strong>Photoshop<\/strong> perhaps the best known.<\/p>\n<p>Despite being able to serve new users in this type of task, the truth is that the potential of this application is enormous.  This means that getting the most out of a program with these characteristics is not easy.  For all this we need a good part of patience and to acquire knowledge from experience.  With everything and with it, its developer tries to make things easier for us as much as possible with certain <strong>built-in functions<\/strong>.  This is precisely a clear case of it and which we will talk about next.<\/p>\n<h2>What is the Story feature in Photoshop<\/h2>\n<p>One of the functionalities that this photo editing application presents to us and that is considered basic and fundamental in its operation, is the <strong>History<\/strong> that he proposes to us.  This is a feature that we see on the screen in the form of a panel that we can view in the program at all times.  Here all the steps that we are taking as we edit and introduce changes in the image with which we work are stored.  The main advantage of History is that it allows us to <strong>move along it forwards and backwards<\/strong> depending on what we need.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>This is something that will be of us <strong>huge help if we make mistakes<\/strong> in the tasks of <strong>edition<\/strong> or if we want to reload some changes made.  As you can imagine, if we know how to take advantage of this functionality, it can be very useful in Photoshop.<\/p>\n<p>Because of all that this feature has to offer, we&#8217;re going to enhance it below by turning on History Log which we&#8217;re going to dive into.<\/p>\n<h2>Turn on History Log when editing photos<\/h2>\n<p>Once we are clear about what the <strong>history function<\/strong> in the Adobe program, we will get even more benefit from this.  And it is that we have the possibility of saving all these steps stored in the metadata of an image once we have finished with it.  As you can imagine this will allow us <strong>have all that history of steps about editing<\/strong> if we upload the image later or share it with others.<\/p>\n<p>However, this is a function that <strong>by default it is disabled<\/strong> in the Adobe program, so first of all we will have to put it into operation.  This is something that we must do before starting with the edition as such so that Photoshop stores in the image itself all the steps that we are taking and that are shown in the aforementioned History function.  for this we open the preferences of the program from the Edit menu.<\/p>\n<p>Next, in the new window that appears, we just have to go to the History record section and activate the selector.  In addition, we will have the possibility of <strong>choose where to save this history<\/strong>in the image metadata, or in an additional file.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-756312\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653487294_650_Save-the-steps-you-took-turn-on-History-Log-in.jpg\" alt=\"log history photoshop\" width=\"1000\" height=\"498\"  \/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>All of this is something that can be extended to both end users and those focused on more professional use. It goes without saying that we are facing one of the great references in the image editing sector. But first of all we must bear in mind that it is a commercial software and therefore [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2239,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2236"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2236"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2236\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2239"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2236"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2236"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2236"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}