{"id":2251,"date":"2022-05-25T16:06:54","date_gmt":"2022-05-25T16:06:54","guid":{"rendered":"https:\/\/why-what-who.com\/there-are-websites-that-sell-libreoffice-are-they-special-and-reliable-versions\/"},"modified":"2022-05-25T16:06:54","modified_gmt":"2022-05-25T16:06:54","slug":"there-are-websites-that-sell-libreoffice-are-they-special-and-reliable-versions","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/there-are-websites-that-sell-libreoffice-are-they-special-and-reliable-versions\/","title":{"rendered":"There are websites that sell LibreOffice. Are they special and reliable versions?"},"content":{"rendered":"<p>Perhaps these two are the best known proposals in this software sector, but there are many other very interesting ones.  It is worth mentioning that the main difference between these alternatives that we mention is that the first one is paid, while the second <strong>suite is open source and free<\/strong>.  It is true that, if we have to mention a reference here, without a doubt Office is the most popular set of applications in the world.  That does not mean that it is the best, but it is the most used.<\/p>\n<p>That is why the developers of the open source proposal that we mentioned do not stop working on their project and <strong>improve compatibility with Microsoft suite<\/strong>.  The advantages of this are obvious, and it is that those who wish to migrate from the paid proposal to the free one, will be able to do so without any problem.  And it is that we are reaching a moment in which a multitude of users are opting for the <strong>Open Source<\/strong> and ceasing to pay for historical commercial programs.<\/p>\n<p>As it could not be otherwise, LibreOffice puts at our disposal the usual solutions in this sense corresponding to the office automation sector.  We have a <strong>text editor<\/strong>a program of <strong>spreadsheets<\/strong>another to create multimedia presentations, diagrams, <strong>databases<\/strong>, a formula editor, and more.  However, sometimes they can ask us for a payment to download and use all of it.<\/p>\n<h2>When do you have to pay to download and use LibreOffice<\/h2>\n<p>We tell you this because over the last few years many users have reported to the developers of the suite that they have come across versions of it, but for a fee.  Specifically, some web pages offer certain versions of these office software for which they ask for a fee to be able to download it and use it on their PCs. It is precisely for all this that <strong>The Document Foundation<\/strong>wanted to step out and explain this situation.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>In fact, in his own <strong>suite developers website<\/strong> open source explain and clarify that those versions for which a disbursement is requested are not from The Document Foundation itself.  Here they want to clarify that LibreOffice is free software that can be redistributed by others.  But <strong>must abide by license terms<\/strong> from the same suite.<\/p>\n<p>Thus, they recommend that, if we want to obtain the official version of the suite of applications, <strong>we must always download it from its official website<\/strong>.  Of course, they also comment that some of their certified developers offer their own versions of LibreOffice.  They offer long-term technical service options, but everything from the official website of the creators.  In short, those web pages other than the official LibreOffice one that ask us to pay for the suite, we should discard them.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Perhaps these two are the best known proposals in this software sector, but there are many other very interesting ones. It is worth mentioning that the main difference between these alternatives that we mention is that the first one is paid, while the second suite is open source and free. It is true that, if [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2253,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2251"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2251"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2251\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2253"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2251"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2251"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2251"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}