{"id":2260,"date":"2022-05-25T18:44:05","date_gmt":"2022-05-25T18:44:05","guid":{"rendered":"https:\/\/why-what-who.com\/millions-of-spanish-children-were-spied-on-with-school-websites-during-the-pandemic\/"},"modified":"2022-05-25T18:44:05","modified_gmt":"2022-05-25T18:44:05","slug":"millions-of-spanish-children-were-spied-on-with-school-websites-during-the-pandemic","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/millions-of-spanish-children-were-spied-on-with-school-websites-during-the-pandemic\/","title":{"rendered":"Millions of Spanish children were spied on with school websites during the pandemic"},"content":{"rendered":"\n<p>This process was carried out through a series of educational applications and websites used for this purpose, the so-called <strong>edtech<\/strong>, which in most cases collected all kinds of browsing data from minors in the background and without proof by parents or children.  Obviously, it was not accidental, but the data of minors was later shared with advertising or technology companies.  Specifically, they were shared and sold with 199 online advertising companies.<\/p>\n<p>&#8220;The data was collected in most cases secretly and <strong>without the consent of children or their parents<\/strong>collecting data on who they are, where they are, what they do in the classroom, who their family and friends are, and what kind of device their families can afford,” says EdTech Exposed research by Human Rights Watch.<\/p>\n<p>This research has analyzed a total of 164 educational platforms from 49 countries, including Spain.  146 of them, 89% of those analyzed, have shown positive results in terms of collecting data from minors without parental consent or from the spied on themselves.  Among the set of data stolen without consent are the location, visits to different web pages or their behavior outside of online classes.  Even <strong>cameras and microphones were activated<\/strong> for purposes other than the video calls themselves to receive classes.<\/p>\n<p>Generally, these same educational tools were endorsed and recommended by the educational authorities themselves (sometimes even developed), so no one distrusted the treatment that would be given to their privacy.<\/p>\n<h2>The Ministry of Education in the spotlight<\/h2>\n<p>Our country has the dishonor of appearing in said investigation.  More specifically, four applications promoted by both state and regional governments have been exposed in the report. <strong>A state platform of the Ministry of Education, two websites of the Generalitat of Catalonia and one of the Junta de Andalucía<\/strong>.<\/p>\n<p>Starting with the state platform, the Ministry of Education is responsible for the Aprendo en Casa website, which was created with the aim of channeling quality educational resources, tools and applications available to teachers, families and students themselves.  The investigation found in their code that two ad trackers were sending children&#8217;s data to Google through the domains google-analytics.com and googletagmanager.com.  The privacy policy, however, only announced the use of Google Analytics for web analytics purposes.<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1679955\" class=\"wp-caption-text\">Web Learning at home<\/p>\n<p>The Ministry currently headed by Pilar Alegría (Isabel Celaá at the time of closure at the start of the pandemic) assures, however, that “there was no possibility of sharing data, since there was no data to share.  The data of the students did not have the ministry either.  The students did not enter with a user, they did not identify themselves and they did not offer their data to anyone [ni al ministerio ni a Google]«.<\/p>\n<h2>Andalusia and Catalonia also used trackers<\/h2>\n<p>Traveling to the south of the country, the Junta de Andalucía promoted the eLearning platform among Andalusian educational centers.  Here, too, two ad trackers were found that were sending children&#8217;s data to Google.  In this case, through the domains google-analytics.com and doubleclick.net.<\/p>\n<p> <img viewbox=\"0 0 3 2\" aria-describedby=\"caption-attachment-1679961\" loading=\"lazy\" class=\"size-large wp-image-1679961\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653504245_753_Millions-of-Spanish-children-were-spied-on-with-school-websites.jpg\" alt=\"eLearning\" width=\"715\" height=\"347\"  \/><\/p>\n<p id=\"caption-attachment-1679961\" class=\"wp-caption-text\">eLearning<\/p>\n<p>According to the Board, «this portal, in its beginnings, used a Google web analytics system solely and exclusively to measure the number of visits it had within the Educational Community in order to improve those pages and\/or services that had less visualization .  Based on the large number of eLearning visits, it was decided to host this portal on its own server in August 2020. Due to the migration to a dedicated server for this portal, and at the beginning of the course in face-to-face format, the connection with the Google analytics system in September 2020 ».<\/p>\n<p>In Catalonia, incidents have been found in both EDU365.cat and Super3, two educational websites dependent on the Department of Education of the Generalitat.  In EDU365 there were ad trackers that sent through the domains google-analytics.com and googletagmanager.com.  For Super 3, they were submitted to Adobe via adobedtm.com, demdex.net, everesttech.net, and omtrdc.net and to Siteimprove via siteimproveanalytics.io and siteimproveanalytics.com.<\/p>\n<p>The Generalitat also wanted to qualify these results: «The portal is anonymous, public, without authentication and with static information, that is, without exchange of information or any database.  The infrastructure provider has analyzed the entire ecosystem (machines) with which EDU365 interacts and at this time has not found any file containing personal data.  The corporate Google Analytics account used by EDU365 has features for advertisers turned off.  Only the IP from where the connection to the portal has existed is collected to obtain geographic data.<\/p>\n<p> <img viewbox=\"0 0 3 2\" aria-describedby=\"caption-attachment-1679982\" loading=\"lazy\" class=\"size-large wp-image-1679982\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653504245_986_Millions-of-Spanish-children-were-spied-on-with-school-websites.jpg\" alt=\"EDU365\" width=\"715\" height=\"375\"  \/><\/p>\n<p id=\"caption-attachment-1679982\" class=\"wp-caption-text\">EDU365<\/p>\n<p>As for Super3, as it depends on TV3, the Catalan public television, «It is TV3&#8217;s children&#8217;s channel, with entertainment, information and outreach television content, but it is not intended for distance learning.  Oomtrdc.net is a server for Adobe Analytics, a digital audience measurement tool used by the CCMA (Catalan Corporation of Audiovisual Media) and the browsing data is used for statistical purposes to understand the behavior of the digital audience, but we do not send &#8216;children&#8217;s data&#8217; to Adobe&#8217;s servers.&#8221;<\/p>\n<p>As for the SiteImprove sites, “they are domains where the only personal data collected is the IP.  Personalized advertising to users of the super3.cat website can only be if this advertising has been authorized through the CMP (Creative Management Platforms) ».<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This process was carried out through a series of educational applications and websites used for this purpose, the so-called edtech, which in most cases collected all kinds of browsing data from minors in the background and without proof by parents or children. Obviously, it was not accidental, but the data of minors was later shared [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2264,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2260"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2260"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2260\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2264"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2260"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2260"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2260"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}