{"id":2267,"date":"2022-05-26T08:49:49","date_gmt":"2022-05-26T08:49:49","guid":{"rendered":"https:\/\/why-what-who.com\/this-program-helps-you-so-that-windows-11-cannot-spy-on-you\/"},"modified":"2022-05-26T08:49:49","modified_gmt":"2022-05-26T08:49:49","slug":"this-program-helps-you-so-that-windows-11-cannot-spy-on-you","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/this-program-helps-you-so-that-windows-11-cannot-spy-on-you\/","title":{"rendered":"This program helps you so that Windows 11 cannot spy on you"},"content":{"rendered":"<p>Ever since the advent of Windows 8, and especially with Windows 10, spying and data collection by Microsoft has been worrying users.  Windows went from being a normal operating system, which collected just telemetry data, to collecting a large amount of information, including personal information, from all its users.  As expected, with the arrival of Windows 11 things have not improved, quite the contrary.  Luckily, there are projects that help us reduce this telemetry and improve our privacy.  That&#8217;s how it is <strong>DoNotSpy11.<\/strong><\/p>\n<p>In 2015, a group of developers released a free tool that allowed users to control Windows 10 data collection: <strong>DoNotSpy10.<\/strong> Thanks to this program it was possible to configure more than 140 privacy options in a very simple way, becoming in a very short time a must-have tool for all Windows users.<\/p>\n<p>With the release of Windows 11, data collection by Microsoft skyrocketed.  As expected, the company collects much more information from all the connected computers with which it can continue to improve its service.  Due to the changes introduced by the company, the previous program, designed for Windows 10, did not work correctly, so there was a choice: either try the latest from Microsoft in exchange for our data, or stay on Windows 10. Luckily, this is over.<\/p>\n<h2>DoNotSpy11 is now available for Windows 11<\/h2>\n<p>Although it took almost a year, the developers of DoNotSpy10 have released a new version of their program: DoNotSpy11.  This new version, as we can imagine, is designed to allow us to configure in detail everything related to the privacy of the new Windows 11. What&#8217;s more, the same program is now compatible with both Windows 10 (up to 21H2 build 19044) and Windows 11 ( up to 22H2 build 22621).<\/p>\n<p>In order to take control of the privacy of Windows 11, what we must do is download the new version of the program from the previous link.  Once downloaded, we run it.  Of course, by not having a valid digital signature, we will see a SmartScreen message that will indicate that the program may be dangerous.  We ignore it and run the program anyway.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>Once the program is open, we will be able to see a list with all the privacy options that it offers us.  And we simply have to choose those options that we want to deactivate.  All the privacy options will show us a description of what they do when they are selected, and we will find them sorted by category:<\/p>\n<ul>\n<li><strong>Advertising:<\/strong> options related to advertising, apps or third-party ads.<\/li>\n<li><strong>apps:<\/strong> It allows us to deactivate unwanted applications that are included in the system.<\/li>\n<li><strong>Defend:<\/strong> we can adjust Windows antivirus options.<\/li>\n<li><strong>Privacy:<\/strong> disable the privacy options of the operating system.<\/li>\n<li><strong>Search:<\/strong> adjust the options related to the search engine.<\/li>\n<li><strong>Updates:<\/strong> we can configure everything related to Windows Update and other updates.<\/li>\n<li><strong>Office:<\/strong> privacy options related to the office suite.<\/li>\n<li><strong>edge:<\/strong> everything related to the Microsoft browser.<\/li>\n<\/ul>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-759474\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653554989_85_This-program-helps-you-so-that-Windows-11-cannot-spy.jpg\" alt=\"DoNotSpy11\" width=\"740\" height=\"509\"  \/><\/p>\n<p>It will be enough to mark the options that we want to configure, click on the “Apply” button, and that&#8217;s it.  The program will take care of everything else.  In case of regret, we have two options: either use the program again to revert the changes, or restore a previously created restore point.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ever since the advent of Windows 8, and especially with Windows 10, spying and data collection by Microsoft has been worrying users. Windows went from being a normal operating system, which collected just telemetry data, to collecting a large amount of information, including personal information, from all its users. As expected, with the arrival of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2270,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2267"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2267"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2267\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2270"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2267"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2267"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2267"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}