{"id":2296,"date":"2022-05-26T10:20:32","date_gmt":"2022-05-26T10:20:32","guid":{"rendered":"https:\/\/why-what-who.com\/prevent-windows-11-from-spying-on-you-so-much-with-the-new-version-of-this-tool\/"},"modified":"2022-05-26T10:20:32","modified_gmt":"2022-05-26T10:20:32","slug":"prevent-windows-11-from-spying-on-you-so-much-with-the-new-version-of-this-tool","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/prevent-windows-11-from-spying-on-you-so-much-with-the-new-version-of-this-tool\/","title":{"rendered":"Prevent Windows 11 from spying on you so much with the new version of this tool"},"content":{"rendered":"<p>Although it is obviously not the only operating system that exists, Windows has been the most used in the world for many years.  Microsoft&#8217;s operating system offers very good features and, above all, great ease of use.  However, not all the words that we can say about it are good, and there are many users who have been complaining for years that this <strong>collects personal data to send them to company servers<\/strong>.  This can be avoided, and that is precisely where it comes in. <strong>DoNotSpy<\/strong>.<\/p>\n<p>This espionage of Windows is one of the weak points of the Microsoft system, especially if we take into account the great importance that privacy has gained for users in recent times.  The operating system itself allows us to change certain parameters to avoid the collection of some data, but in that sense the tools are somewhat limited.  DoNotSpy is a great free software that gives us a lot more options, and that <strong>from today we can enjoy in Windows 11<\/strong>.<\/p>\n<h2>What is DoNotSpy?<\/h2>\n<p>You may be reading these lines and do not know what DoNotSpy is, so we are going to explain what this software is.  As we say, Windows itself already gives us some options to adjust the privacy of the system, as well as data collection.  Nevertheless, <strong>these options are a bit confusing and are somewhat hidden<\/strong>to the point that an average user of the system may not even know of its existence.<\/p>\n<p>This is precisely why DoNotSpy was born.  This completely free software launched its version 10 for the previous Windows back in 2015, and in essence it is still a very simple interface for us to adjust dozens of privacy values. <strong>The program is really easy to use<\/strong>since what we will have on the screen will simply be a window that will show us all the available options, and all we have to do is check (or uncheck) those that interest us.<\/p>\n<p>   <\/p>\n<p id=\"caption-attachment-1678272\" class=\"wp-caption-text\">DoNotSpy11 interface (Ghacks)<\/p>\n<p>A couple of preliminary considerations about DoNotSpy.  As we say, the tool is completely free although it has advertising.  In fact, when we go to install it, it will ask us if we want to <strong>install third-party adware<\/strong>, so if we are not attentive we may suffer the &#8220;harassment&#8221; of these.  The second is that despite being a fairly secure program, the truth is that if we don&#8217;t use it correctly we may cause a problem in our operating system.  Of course, before starting to use it, it will ask us if we want to create <strong>a restore point<\/strong>so we will not have problems in case we do something wrong.<\/p>\n<h2>Version 11 is now available<\/h2>\n<p>A few hours ago, those responsible for DoNotSpy made available to everyone <strong>version 11 of your program<\/strong>.  This comes when Windows 11 has been in our homes for a few months, although it is true that there is still a large mass of users who have not dared to make the jump to version.  The good thing about this new version 11 is that it uses exactly the same interface and operation as the previous one, so in fact <strong>is compatible with both Windows 10 and Windows 11<\/strong>.<\/p>\n<p>By maintaining the interface, we will be able to see few changes in terms of its functionality.  DoNotSpy11 will keep showing <strong>privacy settings by category<\/strong>, indicating in blue those that are safe to use, in red those that are not recommended for most users, and in orange others that have an associated explanation.  The only notable changes in this new version are to be found in <strong>some settings specific to Microsoft Office<\/strong>as well as others related to new features in Windows 11.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Although it is obviously not the only operating system that exists, Windows has been the most used in the world for many years. Microsoft&#8217;s operating system offers very good features and, above all, great ease of use. However, not all the words that we can say about it are good, and there are many users [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2298,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2296"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2296"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2296\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2298"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2296"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2296"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2296"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}