{"id":2302,"date":"2022-05-26T11:57:22","date_gmt":"2022-05-26T11:57:22","guid":{"rendered":"https:\/\/why-what-who.com\/use-wikipedia-in-the-program-to-improve-your-work\/"},"modified":"2022-05-30T13:48:20","modified_gmt":"2022-05-30T13:48:20","slug":"use-wikipedia-in-the-program-to-improve-your-work","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/use-wikipedia-in-the-program-to-improve-your-work\/","title":{"rendered":"Use Wikipedia in the program to improve your work"},"content":{"rendered":"<p>Over time, programs focused on the office automation sector have improved tremendously.  While a few years ago they focused solely and exclusively on their basic purpose, for example, to create text documents without further ado, today they go much further.  We find a clear example of all this with one of the referents here, we talk about <strong>Microsoft Word<\/strong>.<\/p>\n<p>Undoubtedly this is a program to edit texts that most of you know more than enough and that is part of the <strong>Office office suite<\/strong>.  It is true that its basic operation focuses on editing and creating text documents.  However, nowadays we can say that we have the possibility of carrying out many other office tasks from the application itself.  Much of this is due to the possibility of using all kinds of additional elements.<\/p>\n<p>In addition to using <strong>words and paragraphs of text<\/strong>we can also add <strong>images<\/strong>create <strong>boards<\/strong>, insert objects of all kinds, etc.  This opens up a wide range of possibilities when it comes to generating truly impressive documents.  But with everything and with it we cannot forget that here what we are looking for in most cases is a document rich in text content.  And it is that on many occasions users make use of this application to focus more on the content than on anything else.<\/p>\n<p>As a general rule, for all this we use a multitude of <strong>external sources that help us enrich said content<\/strong> of the documents.  But here we want to talk about an integrated function that will surely be extremely useful for these tasks.<\/p>\n<h2>Make queries on Wikipedia directly from Word<\/h2>\n<p>Actually, we are referring to the possibility of searching for information in the universal internet encyclopedia, the <strong>Wikipedia<\/strong>, directly from the program.  As you can imagine, this encyclopedia that most of you know is a very valuable source of information that we find on the internet.  Therefore, being able to access it directly from Word itself will be very useful when it comes to <strong>develop certain jobs<\/strong>.<\/p>\n<p>In addition, all of this is something that we find by default in the Microsoft text editor without having to do anything additional.  So, as we work on our document, to perform <strong>online consultations in the aforementioned encyclopedia<\/strong>, at first we just have to go to the Insert menu option.  From here is where we usually add objects and all kinds of content to our jobs.  But at the same time we find ourselves, in the section of <strong>Accessories<\/strong>with a button called precisely Wikipedia.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>After clicking on it, a new panel will open to the right of the document with a search box so that we can enter the terms that interest us.  in that instant <strong>Word will access the internet encyclopedia<\/strong> to show us the included definitions of those terms.  Say that we can extract the texts directly if we are interested in using them in our work in the program.  Of course, we must bear in mind that to take advantage of this functionality it is essential that we have an Internet connection.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Over time, programs focused on the office automation sector have improved tremendously. While a few years ago they focused solely and exclusively on their basic purpose, for example, to create text documents without further ado, today they go much further. We find a clear example of all this with one of the referents here, we [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2304,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2302"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2302"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2302\/revisions"}],"predecessor-version":[{"id":2824,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2302\/revisions\/2824"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2304"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2302"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2302"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2302"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}