{"id":2319,"date":"2022-05-26T12:43:45","date_gmt":"2022-05-26T12:43:45","guid":{"rendered":"https:\/\/why-what-who.com\/how-to-use-and-supported-services\/"},"modified":"2022-05-26T12:43:45","modified_gmt":"2022-05-26T12:43:45","slug":"how-to-use-and-supported-services","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/how-to-use-and-supported-services\/","title":{"rendered":"How to use and supported services"},"content":{"rendered":"<p>IFTTT allows us to create routines with different <strong>tools, applications or services.<\/strong> We can do it for free and there are many services that are included or that are compatible, so its use is essential for many people.<\/p>\n<h2>What is IFTTT<\/h2>\n<p>IFTTT means “If This, Then That” or what is the same “if this, then that”.  In other words, it is a service or tool that allows us to create routines or actions.  If X happens, let Y happen. We can <strong>schedule actions with different applications or tools<\/strong> and this will allow us that if we do something with one of them, another action will automatically be executed in the same application or in another.<\/p>\n<p>For example, as we do with the routines with the smart speaker: if we say good night, the light will go out and the blinds will go down.  Or if we turn on the light in the bedroom in the morning, it will automatically turn on the coffee maker with the smart plug, for example, having everything ready to start the day.IFTTT Compatible Services<\/p>\n<p>There are more than 300 services supported by IFTTT and we can combine them with each other.  For example, you can combine Instagram with Flickr or with Facebook or with Pinterest.  But there are not only the best known ones such as the social networks you use every day, but also a large number of specialized tools such as Airtable, AirPatrol WiFi, Coinbase&#8230; <strong>Specific tools like Fitbit<\/strong> to measure your health or your exercise but others like Fing to detect WiFi intruders or others that can make you have a smart home, like iRobot or Mysa Thermostat.<\/p>\n<p>To find out which services are compatible with IFTTT, we simply have to go to its website and go to “explore”.  Here, click on &#8220;Services&#8221; and we can filter according to different categories such as education, clocks, business tools, calendar, finance, gaming, email, payments, cloud tools&#8230; Or we simply use the search engine to find the service we want.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1639977 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653569025_513_How-to-use-and-supported-services.jpg\" alt=\"iftt\" width=\"1200\" height=\"474\"\/><\/p>\n<h2>How to use it and how much is it worth<\/h2>\n<p>To use IFTT we have to create an account on its official website by filling in our data or using accounts that we already have such as Google or Facebook.  We can use it for free and there is a &#8220;free&#8221; plan, but there are also payment plans that allow us more options or that do not have as many limitations in terms of actions.  In addition, paid plans have a seven-day free trial at no cost.<\/p>\n<p>The Pro Plan is priced at 4.8 euros per month and the Pro+ Plan is priced at 9.5 euros per month.  The Pro Plan allows up to twenty actions, more speed in them, etc.  The superior plan includes all of the above but allows you to connect multiple accounts, allows unlimited actions, development tools&#8230;<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1639989 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653569025_369_How-to-use-and-supported-services.jpg\" alt=\"iFTTT Plans\" width=\"1200\" height=\"629\"\/><\/p>\n<p>But if we want to use it without cost <strong>just create an account and start managing our “applets”<\/strong> at all times.  We look for the application or service that we want to automate and we will see what we can connect it with.  For example: you can have your Instagram photos published on your Twitter profile or you can synchronize your Instagram photos with boards on Pinterest every time you upload one and without having to repeat the process on the two different websites or services.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1639983 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653569025_973_How-to-use-and-supported-services.jpg\" alt=\"create iftt\" width=\"1200\" height=\"627\"\/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>IFTTT allows us to create routines with different tools, applications or services. We can do it for free and there are many services that are included or that are compatible, so its use is essential for many people. What is IFTTT IFTTT means “If This, Then That” or what is the same “if this, then [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2324,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2319"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2319"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2319\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2324"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2319"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2319"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2319"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}