{"id":2344,"date":"2022-05-26T15:07:12","date_gmt":"2022-05-26T15:07:12","guid":{"rendered":"https:\/\/why-what-who.com\/check-out-the-new-accounts-feature-in-windows-11-now-you-can-try-it\/"},"modified":"2022-05-26T15:07:12","modified_gmt":"2022-05-26T15:07:12","slug":"check-out-the-new-accounts-feature-in-windows-11-now-you-can-try-it","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/check-out-the-new-accounts-feature-in-windows-11-now-you-can-try-it\/","title":{"rendered":"Check out the new accounts feature in Windows 11, now you can try it"},"content":{"rendered":"<p>One of the most important software products that Microsoft has made available to us lately has been its new <strong>Windows 11 operating system<\/strong>.  This does not mean that it has abandoned Windows 10, but now a good part of its efforts are directed towards this new version, as is the case with build 25126.<\/p>\n<p>This is something that the software giant itself sends to those users enrolled in the insider program on a regular basis.  In this way we have the opportunity to know the latest developments that lead to the operating system and that will probably be implemented in the final version of it.  Now with this new <strong>Windows 11 build<\/strong> Microsoft is rolling out new improvements to the account settings section, among other things.  To all this, we can add a good set of corrections that are included here almost mandatory.<\/p>\n<h2>Windows 11 build 25126: Account management improvements<\/h2>\n<p>As we have mentioned before, one of the main novelties that we are going to find in this new compilation of the recent operating system refers to user accounts.  A few thoughts ago Microsoft introduced the management of subscriptions to firm products in Settings \/ Accounts.  This allows a first-hand look at Microsoft 365 subscriptions on Windows 11, for example.  However, the software giant now wants to make things a little easier for us in this regard.<\/p>\n<p>That is why the new <strong>compilation 25126<\/strong> makes it easy for you to view all supported Office products.  Here we refer to software elements of the importance of Office 2019 or 2021. These will be associated with our account in the same Configuration \/ Accounts section.  So we can see all <strong>Supported Microsoft 365 and Office products<\/strong> with license associated with our account, directly.  In turn, the details of these products will be displayed here, and we can even install Office by clicking the See details button.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>All this information is displayed on the page. <strong>Microsoft account management<\/strong> and now it&#8217;s available in Windows 11. One thing to keep in mind is that this is a feature that&#8217;s being rolled out gradually for Windows 11. <strong>insider<\/strong>.  Depending on its acceptance and the tests carried out with it, the brief will reach other users around the world.<\/p>\n<h2>Fixes coming to the new operating system<\/h2>\n<p>In addition to this novelty to which we refer you, as usual, Microsoft includes in its <strong>new builds<\/strong> known bug fixes.<\/p>\n<ul>\n<li>Fixed issue that caused a version rollback when trying to install the latest on the <strong>DEV channel<\/strong>.<\/li>\n<li>Fixed issue causing the Program Compatibility Service to use a <strong>huge amount of CPU<\/strong> after upgrading to the latest versions.<\/li>\n<li>If we use a touch keyboard, you no longer have to disconnect when editing the name of a folder in the <strong>start menu<\/strong>.<\/li>\n<li>Fixed a bug in the <strong>Explorer<\/strong> that occurred when using search in Windows 11.<\/li>\n<li>The preview image in the Personalization \/ Lock Screen section has been fixed.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>One of the most important software products that Microsoft has made available to us lately has been its new Windows 11 operating system. This does not mean that it has abandoned Windows 10, but now a good part of its efforts are directed towards this new version, as is the case with build 25126. This [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2346,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2344"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2344"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2344\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2346"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2344"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2344"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2344"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}