{"id":2347,"date":"2022-05-26T15:29:22","date_gmt":"2022-05-26T15:29:22","guid":{"rendered":"https:\/\/why-what-who.com\/how-to-free-up-space-on-your-google-drive\/"},"modified":"2022-05-26T15:29:22","modified_gmt":"2022-05-26T15:29:22","slug":"how-to-free-up-space-on-your-google-drive","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/how-to-free-up-space-on-your-google-drive\/","title":{"rendered":"How to free up space on your Google Drive"},"content":{"rendered":"<p>The first thing you need to know is how much space you have on Google Drive and how much space you have left.  Please note that your storage space is shared between Google Drive, Gmail and Google Photos.  In fact, if your account reaches the storage limit, you could be left without such an important function as not being able to send or receive emails.  So that this does not happen, we are going to give you a series of recommendations so that you can free up space in your account.<\/p>\n<h2>Drive Trash<\/h2>\n<p>Let&#8217;s start with the simplest.  Once you log into your Google Drive account, you can choose the files you want to delete by hand and move them to the trash.  They will remain in the trash for a period of 30 days, during which you can restore them again.<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1488786\" class=\"wp-caption-text\">google drive<\/p>\n<p>In case you want to delete them permanently, you do not have to wait those 30 days, but you can empty the trash.  If you temporarily or permanently delete or restore multiple files or folders at once, it may take some time for the changes to be reflected in your account.<\/p>\n<ol>\n<li>On your computer, go to drive.google.com.<\/li>\n<li>On the left, click Trash.<\/li>\n<li>Click on a file.<\/li>\n<li>At the top, click Permanently delete.<\/li>\n<\/ol>\n<p>You can use various filters to remove files.  One of the most useful is “delete Drive files by size”.  In this way, you will be able to simplify the process and directly release the largest possible size.  To do this, you need to access your account on a PC and consult your files ordered from the one that uses the most space to the one that uses the least.<\/p>\n<h2>Delete large emails in Gmail<\/h2>\n<p>It may be your email account that is weighing down the available space in Google Drive.  To do this, we can also simply access a filter that will detect those emails that weigh the most, either because of the content of the mail itself or because of the attachments it contains.<\/p>\n<p> <img viewbox=\"0 0 3 2\" aria-describedby=\"caption-attachment-1676745\" loading=\"lazy\" class=\"size-large wp-image-1676745\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653578962_602_How-to-free-up-space-on-your-Google-Drive.jpg\" alt=\"Filter heavy emails Gmail\" width=\"715\" height=\"403\"  \/><\/p>\n<p id=\"caption-attachment-1676745\" class=\"wp-caption-text\">Filter heavy emails Gmail<\/p>\n<p>To locate these heavy emails, simply type in the Gmail search box «<strong>has:attachment larger:*M<\/strong>«, being the asterisk replaced by the number of megabytes that you want the emails that appear in the results to weigh as a minimum.  For example, has:attachment larger:10M will show emails that are 10MB or larger.<\/p>\n<p>Once located, select the emails you don&#8217;t need and click Delete.  To permanently delete them, on the left side of the page, click Menu and then Trash.  At the top, click Empty Trash Now.<\/p>\n<p>To permanently remove emails from the Spam folder regardless of their weight, at the top, click Delete all spam messages now.  You can also select specific emails and click Delete permanently.<\/p>\n<h2>Google One Storage Manager<\/h2>\n<p>If you want to automate the process to a certain extent, you can use the Google One manager. It reviews the files you have stored in Google services, such as Gmail, Google Drive or Google Photos and deletes what you no longer need so that you enjoy more storage space.<\/p>\n<p> <img viewbox=\"0 0 3 2\" aria-describedby=\"caption-attachment-1676748\" loading=\"lazy\" class=\"size-large wp-image-1676748\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653578962_640_How-to-free-up-space-on-your-Google-Drive.jpg\" alt=\"Google One storage manager\" width=\"715\" height=\"374\"  \/><\/p>\n<p id=\"caption-attachment-1676748\" class=\"wp-caption-text\">Google One storage manager<\/p>\n<p>This manager will group together those items where you can quickly free up space, such as emails and files that you have sent to the trash but have not yet been permanently deleted, emails marked as spam, large files or emails with large attachments.<\/p>\n<p>This tool can be somewhat chaotic if you&#8217;re not sure which files you want to delete and which ones to safeguard, but it&#8217;s certainly the most appropriate for freeing up space if you consider that you don&#8217;t have anything important in Google Drive and you can brute force it.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The first thing you need to know is how much space you have on Google Drive and how much space you have left. Please note that your storage space is shared between Google Drive, Gmail and Google Photos. In fact, if your account reaches the storage limit, you could be left without such an important [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2351,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2347"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2347"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2347\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2351"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2347"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2347"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2347"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}