{"id":2358,"date":"2022-05-26T16:58:07","date_gmt":"2022-05-26T16:58:07","guid":{"rendered":"https:\/\/why-what-who.com\/the-dgt-will-monitor-in-real-time-if-your-car-is-connected\/"},"modified":"2022-05-26T16:58:07","modified_gmt":"2022-05-26T16:58:07","slug":"the-dgt-will-monitor-in-real-time-if-your-car-is-connected","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/the-dgt-will-monitor-in-real-time-if-your-car-is-connected\/","title":{"rendered":"The DGT will monitor in real time if your car is connected"},"content":{"rendered":"<h2>A tool for the most relevant information<\/h2>\n<p>The DGT began working in 2017 on a connected car platform, also known as DGT 3.0.  Its function is that of <strong>connect in real time<\/strong> and comprehensively all the elements involved in traffic.  From vehicles and their drivers to infrastructure, services and security and emergency bodies.<\/p>\n<p>A tool, in any case, of which both the General Directorate of Traffic and road users <strong>have access to relevant information<\/strong> for your safety, as well as the improvement of traffic on the roads.  As indicated by Marcos Sierra de Vozpópuli, it will collect, in real time, all the data of the new vehicles with Internet connections.  These types of cars are in the high range, but they will begin to hatch in all segments.<\/p>\n<p>In this sense, and with the premise of the connected car, the road agency will know and will know at all times the <strong>real location of all vehicles<\/strong> that circulate in Spain.  However;  how will this tool work?<\/p>\n<h2>It will be a high performance service<\/h2>\n<p>In this way, the driving experience will be much safer than today, where road users will know at all times the <strong>Incidents being recorded<\/strong> on the road.  For example, they will receive an alert if a damaged car occupies part of the road or they will be informed if there are traffic jams or the road has been closed to traffic due to an emergency.<\/p>\n<p>And it is that, from the one known as connected car 3.0 of the DGT, these will be able to indicate <strong>when they want to be visible<\/strong> for others, either because of these stops or because they must travel at excessively low speed due to breakdown or poor visibility.  At the same time, and beyond these, it will also be the ambulances, security services or cyclists who will be able to send a signal to the new platform to be warned by other drivers beyond the line of sight.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>As such, its use will be done with features already used in applications such as Google Maps.  So, this works as a service <strong>cloud-hosted<\/strong>scalable and high performance, which will be able to receive data from numerous sources and process it in real time to obtain useful information that is sent back to users.  All this for free, maintaining the security of the information and respecting the <strong>anonymity<\/strong> of the users.<\/p>\n<h3>You will also be able to know what happens on the road<\/h3>\n<p>According to the same source, it is the Spanish project of the DGT for which in the future vehicles will be allowed <strong>drive autonomously<\/strong>with no one behind the wheel, which is why it is essential to have the location of each of them.<\/p>\n<p>In fact, this comes as the Spanish extension of the platform at a European level of Data for Road Safety, in which the traffic authorities of the countries of Germany, Austria, Belgium, Finland, Holland, Luxembourg, United Kingdom, and now also Spain.  For the project, which aims to create a <strong>safer road ecosystem<\/strong>have invested more than 3,300 million euros.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1683564 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653584287_443_The-DGT-will-monitor-in-real-time-if-your-car.jpg\" alt=\"DGT 3.0 connected car urban road\" width=\"768\" height=\"425\"  \/><\/p>\n<p>It is also important to mention that the DGT tool on the connected car will not only contemplate the information of the vehicles, but will also be able to know everything that happens with <strong>elements of the road and its furniture<\/strong>, such as signs, streetlights or traffic lights.  These, connected to the Internet, will provide the data by sending it to the drivers.<\/p>\n<p>The information dictates that Spain considers the year <strong>2026 as the departure date<\/strong> of this connection system.  And it is that it is expected that by that date urban areas, main roads and railway lines already have 5G coverage, which will facilitate connectivity and reduce latency (that is, delay times) in communications.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A tool for the most relevant information The DGT began working in 2017 on a connected car platform, also known as DGT 3.0. Its function is that of connect in real time and comprehensively all the elements involved in traffic. From vehicles and their drivers to infrastructure, services and security and emergency bodies. A tool, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2361,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2358"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2358"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2358\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2361"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2358"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2358"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2358"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}