{"id":2390,"date":"2022-05-26T19:15:13","date_gmt":"2022-05-26T19:15:13","guid":{"rendered":"https:\/\/why-what-who.com\/how-to-sign-jnlp-files-from-the-social-security-website-with-the-pros-system\/"},"modified":"2022-05-26T19:15:13","modified_gmt":"2022-05-26T19:15:13","slug":"how-to-sign-jnlp-files-from-the-social-security-website-with-the-pros-system","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/how-to-sign-jnlp-files-from-the-social-security-website-with-the-pros-system\/","title":{"rendered":"How to sign JNLP files from the Social Security website with the Pros@ system"},"content":{"rendered":"<p>Carrying out procedures with the Public Administrations can be a real headache.  Being in possession of an Electronic DNI or digital certificate should open all the doors of online public services, but sometimes, as in the<strong> Social Security<\/strong>another series of actions is needed.<\/p>\n<p>One of them is to sign JNLP files in some procedures.  If you have been stuck in this situation, we are going to tell you how to carry out the complete procedure.<\/p>\n<h2>What are JNLP files<\/h2>\n<p>JNLP is an acronym for Java Network Launching Protocol or <strong> Java Network Protocol Execution<\/strong>.  Unlike others, JNLP files do not run inside a user&#8217;s web browser.  These files are actually downloaded to a user&#8217;s computer and then run as normal Java applications.<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1680948\" class=\"wp-caption-text\">JNLP Compatibility<\/p>\n<p>In Firefox and Chrome, the user must accept the JNLP download and then run the downloaded file by clicking on the item shown in the download bar (bottom of the window).  In Safari for Mac, when the JNLP is downloaded, it does not show the user any warning so that it can be executed by the JNLP.  The user must open the downloads window and run the latest JNLP that was downloaded.  In the case of Linux, it has not worked with any of the usual versions, neither for 64 bits nor for 32 bits.<\/p>\n<p>Once downloaded, you will need a program to open it: Java Web Start.  Once that is done, you would have to associate this extension with the program, so that it opens them in the future.  This can be done in two ways: one is to manually edit the Windows Registry and keys <i>HKEY_CLASSES_ROOT<\/i>.  The second way is simpler and definitely recommended for less advanced users.<\/p>\n<ul>\n<li>Right click on the unknown JNLP file you want to open.<\/li>\n<li>Select &#8220;Open With&#8221; from the menu.<\/li>\n<li>Click on “Choose another app”.<\/li>\n<li>Click on “More apps”.<\/li>\n<li>Click on “Look for more apps on this PC” and indicate the installation location of the appropriate program.<\/li>\n<li>Finally, select the “Always use the selected program to open JNLP files” option and confirm the whole operation.<\/li>\n<\/ul>\n<h2>Sign files for Social Security<\/h2>\n<p>Some Social Security procedures will require a digital signature using this file format.  For security reasons, web pages do not execute JNLP files on the computer without the user&#8217;s consent, so the first step would be to authorize the download.<\/p>\n<p> <img viewbox=\"0 0 3 2\" aria-describedby=\"caption-attachment-1680945\" loading=\"lazy\" class=\"wp-image-1680945 size-medium\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653592513_688_How-to-sign-JNLP-files-from-the-Social-Security-website.jpg\" alt=\"Select certificate or digital signature\" width=\"400\" height=\"282\"  \/><\/p>\n<p id=\"caption-attachment-1680945\" class=\"wp-caption-text\">Selection of certificate or digital signature<\/p>\n<p>Once you have the JNLP file downloaded, as we have already associated the extension with the program, the signature process itself starts.  In this, the system analyzes the security of the downloaded JNLP module, displaying a window with information on the security of the certificate with which the JNLP module itself was signed.  This signature certifies the integrity and authenticity of the JNLP module.<\/p>\n<p>After clicking on Execute, the certificate selection window will appear to perform the signature.  We will need to select valid certificates from the system store or from a cryptographic card.  Whichever one is chosen, make sure you choose the same one you selected when entering the web service.  If there have been no incidents in the process, the document will be sent correctly.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Carrying out procedures with the Public Administrations can be a real headache. Being in possession of an Electronic DNI or digital certificate should open all the doors of online public services, but sometimes, as in the Social Securityanother series of actions is needed. One of them is to sign JNLP files in some procedures. If [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2393,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2390"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2390"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2390\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2393"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2390"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2390"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2390"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}