{"id":2397,"date":"2022-05-26T21:22:33","date_gmt":"2022-05-26T21:22:33","guid":{"rendered":"https:\/\/why-what-who.com\/can-i-do-without-an-antivirus-if-i-make-backup-copies\/"},"modified":"2022-05-26T21:22:33","modified_gmt":"2022-05-26T21:22:33","slug":"can-i-do-without-an-antivirus-if-i-make-backup-copies","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/can-i-do-without-an-antivirus-if-i-make-backup-copies\/","title":{"rendered":"Can I do without an antivirus if I make backup copies?"},"content":{"rendered":"<p>As the years go by and technology improves, the use of sensitive and personal data on their computers increases by most users.  One of the main reasons for this is the trust we place in the security features of programs in general, and of <strong>antivirus<\/strong> in particular.<\/p>\n<p>In this way we have the possibility of working with all types of files, applications and platforms from our computers, in theory without risk.  And we say in theory because we must bear in mind that antiviruses and the rest of <strong>security solutions are not 100% foolproof<\/strong>.  However, if we keep this kind of software properly updated and take some precautionary measures on the internet, we shouldn&#8217;t have too many problems.<\/p>\n<p>On many occasions, much of the fault of the <strong>attacks of which we are victims<\/strong> it&#8217;s ours.  Whether due to a mistake or overconfidence about certain files, programs or websites, these end up being malicious and entering our computer.  On the contrary, we also find many users who trust their skills and knowledge and prefer <strong>dispense with installing and using an antivirus<\/strong> on their teams.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>It is true that this particular software often carries out a <strong>high consumption of system resources<\/strong>.  Keep in mind that these programs are constantly running in the background to <strong>offer active protection<\/strong>.  That is why some might ask about the possibility of complementing or substituting the use of antiviruses for a <strong>backup system<\/strong>.  Next, we will talk about this possibility that more and more users choose to use.<\/p>\n<h2>Use an antivirus or backup copies, which is better<\/h2>\n<p>For years we have been telling you that the regular backup copies that we must make of all the content on our computer is something basic.  These allow us to store all the content that we program on external drives in order to recover them in the event of a disaster.  For example, if we cannot access the content of our computer due to an attack derived from <strong>malware<\/strong>we can always <strong>get hold of these backups<\/strong>.<\/p>\n<p>That is precisely why many uninstall or do not deactivate their antivirus trusting these copies, freeing up PC resources.  However, we can say that in most cases this will be a mistake.  Yes <strong>we uninstall or deactivate the antivirus we are exposed to all kinds of malicious codes<\/strong> constantly.  It is true that we have a backup copy of our data in case of disaster, but it is not worth taking that risk.<\/p>\n<p>If we have performance problems when the antivirus is active, we can configure it so that it does not affect the PC as much.  But <strong>disabling it completely is a mistake<\/strong>all of it <strong>despite backups<\/strong>.  What we mean by this is that both elements should complement each other in most teams.  We have already told you before that antiviruses are not always reliable, so keeping a backup of our data will save us from possible disappointment.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-405571\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653600153_667_Can-I-do-without-an-antivirus-if-I-make-backup.jpg\" alt=\"Uranium Backup create backup\" width=\"800\" height=\"424\"  \/><\/p>\n<p>For example, we can <strong>reduce the impact of antivirus<\/strong> on the computer, spacing out their analyses.  In the same way we can program the scanning of the disk units, but in a more superficial way and that only the key elements are analyzed.  But under no circumstances should we do without this software, despite having backup copies.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As the years go by and technology improves, the use of sensitive and personal data on their computers increases by most users. One of the main reasons for this is the trust we place in the security features of programs in general, and of antivirus in particular. In this way we have the possibility of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2400,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2397"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2397"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2397\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2400"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2397"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2397"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2397"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}