{"id":2410,"date":"2022-05-27T03:53:54","date_gmt":"2022-05-27T03:53:54","guid":{"rendered":"https:\/\/why-what-who.com\/nobody-wants-open-football-in-spain\/"},"modified":"2022-05-27T03:53:54","modified_gmt":"2022-05-27T03:53:54","slug":"nobody-wants-open-football-in-spain","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/nobody-wants-open-football-in-spain\/","title":{"rendered":"Nobody wants open football in Spain"},"content":{"rendered":"<p>Last December the auction of the rights to &#8220;exploitation of audiovisual content of the <strong>National League Championship in Spain<\/strong> starting in the 2022\/2023 season″, with Movistar and DAZN dividing up the First Division football cake and subsequently reaching an agreement with the streaming sports platform to be able to broadcast all pay-per-day matches.<\/p>\n<p>However, after the auction of these lots (D.1 bis, D.2 bis and D.3 bis to be more exact), LaLiga opened another procedure on April 26, in this case Lots 4, 5 and 6 for <strong>open broadcast<\/strong> and it does not seem that there has been much interest because yesterday the term closed without bids.<\/p>\n<h2>Open football auction lots<\/h2>\n<p>The three lots up for auction correspond to open matches, both in the First Division (which until now had been broadcast by Gol Televisión), and in the Second Division.  There was also a third set aside for weekly highlights summaries.<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1061781\" class=\"wp-caption-text\">Javier Tebas, president of LaLiga<\/p>\n<ul>\n<li><strong>Lot 4:<\/strong> One match from each matchday of the First Division National League Championship, live and exclusively, for broadcast on open television (without prejudice to the marketing of this same audiovisual content simultaneously and live in other batches for broadcast on pay TV).  The match that is part of this lot may not include teams that are currently participating in European competitions organized by UEFA nor, <strong>in no case, to the following teams: Real Madrid, FC Barcelona, ​​Valencia Club de Fútbol and Club Atlético de Madrid<\/strong>.<\/li>\n<li><strong>Lot 5:<\/strong> One match of each day of the Second Division National League Championship, live and exclusively, for broadcast on open television (without prejudice to the marketing of this same audiovisual content simultaneously and live in other Lots for broadcast on pay TV).<\/li>\n<li><strong>Lot 6:<\/strong> Summaries lasting twelve minutes, deferred and exclusively, of each of the matches of the First Division and Second Division National League Championship (including the play-offs), for broadcast on open television (without prejudice to the marketing of this same audiovisual content simultaneously and live in other Lots for broadcast on pay television).<\/li>\n<\/ul>\n<p>LaLiga offered interested operators the possibility of submitting one or several bids for each of the lots described, since there was the possibility of submitting, on the same form, up to three economic bids for each Lot, taking into account the different time periods: three, four and\/or five seasons.<\/p>\n<h2>No offers, there will be a second chance<\/h2>\n<p>The deadline for the presentation of these economic proposals closed yesterday and the result is far from being what Javier Tebas and company would have expected. <strong>No offer has been received for Lots 4 and 5<\/strong>.  Lot 6 of open summaries have received them, but none have reached the assigned seasonal reserve price for this lot.  If this was the case, LaLiga reflected three major scenarios:<\/p>\n<p> <img viewbox=\"0 0 3 2\" aria-describedby=\"caption-attachment-1280295\" loading=\"lazy\" class=\"size-large wp-image-1280295\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653623634_432_Nobody-wants-open-football-in-Spain.jpg\" alt=\"money league\" width=\"715\" height=\"374\"  \/><\/p>\n<p id=\"caption-attachment-1280295\" class=\"wp-caption-text\">LaLiga will look for offers in a second round<\/p>\n<ul>\n<li>Choose to award the lot to the candidate who has made the highest financial offer.<\/li>\n<li>Hold a new round, after communication of the reserve price.<\/li>\n<li>Proceed to the non-exclusive commercialization of the audiovisual content offered, object of this Procedure.<\/li>\n<\/ul>\n<p>After the meeting of the Control Body for the management of LaLiga&#8217;s audiovisual rights, it has been decided to take advantage of the second point and carry out a second round of marketing.  The offers in this second round must be presented as a maximum date next Monday, June 6, which could be provisionally awarded that same day.  Once said reserve prices have been communicated, the amounts are as follows: <strong>€4 million (Lot 4), €1 million (Lot 5) and €10 million (Lot 6)<\/strong>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Last December the auction of the rights to &#8220;exploitation of audiovisual content of the National League Championship in Spain starting in the 2022\/2023 season″, with Movistar and DAZN dividing up the First Division football cake and subsequently reaching an agreement with the streaming sports platform to be able to broadcast all pay-per-day matches. However, after [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2413,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2410"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2410"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2410\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2413"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2410"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2410"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2410"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}