{"id":2414,"date":"2022-05-27T03:58:32","date_gmt":"2022-05-27T03:58:32","guid":{"rendered":"https:\/\/why-what-who.com\/scammers-sell-up-to-ten-times-more-expensive-tickets-for-the-2018-russia-world-cup\/"},"modified":"2022-05-27T03:58:32","modified_gmt":"2022-05-27T03:58:32","slug":"scammers-sell-up-to-ten-times-more-expensive-tickets-for-the-2018-russia-world-cup","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/scammers-sell-up-to-ten-times-more-expensive-tickets-for-the-2018-russia-world-cup\/","title":{"rendered":"Scammers sell up to ten times more expensive tickets for the 2018 Russia World Cup"},"content":{"rendered":"<p class=\"p1\">São Paulo.- Kaspersky Lab experts have identified phishing emails sent by scammers offering users the chance to get much-requested &#8220;guest&#8221; tickets for the 2018 FIFA World Cup, but at a price of up to ten times more expensive than the original.<\/p>\n<p class=\"p1\">Although the tickets may not be usable, due to a strict registration and transfer procedure, scammers are taking users&#8217; money and private data, including payment information, to steal more funds in this monetization scam. double.<\/p>\n<p class=\"p1\">Big events attract the attention of scammers, and the noise and excitement that surrounds them make it easy for attackers to take advantage of their potential victims&#8217; lack of vigilance.  Recipients are attracted to seemingly legitimate emails that focus on world sports championships watched by large audiences around the world.<\/p>\n<h4>The upcoming soccer World Cup is no exception.<\/h4>\n<p class=\"p1\">This event is particularly interesting because there are a number of obstacles that complicate the process of purchasing game tickets.  For example, tickets can only be purchased on the official FIFA website and the procedure is multifaceted and complicated for security reasons. <\/p>\n<p class=\"p1\">Ordering a ticket is done in three stages and only one ticket per person is allowed.  The exception is guest tickets, in which case the participant is allowed to purchase up to three additional tickets.  However, these tickets are registered under specific names and can only be changed if the holder requests to transfer the intended recipient to another.  Despite this rigorous process, scammers have been able to use it to their advantage.<\/p>\n<p class=\"p1\">When the window to buy tickets was opened, the official website experienced a massive increase in users trying to buy their tickets, leading to connection issues.  During the process, the scammers bought as many tickets as they could in order to sell them to a desperate fan base.  With tickets now sold out, many people have no choice but to go to resellers or third parties in order to attend a game.<\/p>\n<p class=\"p1\">Scammers have created hundreds of domains with words related to the World Cup to sell their guest tickets.  Many of them have increased the price to more than double the face value, and some of the tickets are available for up to 10 times the original cost, according to experts at Kaspersky Lab. <\/p>\n<p class=\"p1\">Because they require full payment up front, there is no guarantee that the scammers will deliver the tickets, that tickets reserved for other people will be accepted at a given stadium, or that they are legitimate tickets.  What is guaranteed, however, is that the payment information used to purchase the tickets will give the scammers everything they need to extract additional money from the user in the future.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>São Paulo.- Kaspersky Lab experts have identified phishing emails sent by scammers offering users the chance to get much-requested &#8220;guest&#8221; tickets for the 2018 FIFA World Cup, but at a price of up to ten times more expensive than the original. Although the tickets may not be usable, due to a strict registration and transfer [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2415,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2414"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2414"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2414\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2415"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2414"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2414"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2414"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}