{"id":2426,"date":"2022-05-27T09:05:31","date_gmt":"2022-05-27T09:05:31","guid":{"rendered":"https:\/\/why-what-who.com\/share-the-screen-or-your-folders-in-ubuntu-linux-with-this-change\/"},"modified":"2022-05-27T09:05:31","modified_gmt":"2022-05-27T09:05:31","slug":"share-the-screen-or-your-folders-in-ubuntu-linux-with-this-change","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/share-the-screen-or-your-folders-in-ubuntu-linux-with-this-change\/","title":{"rendered":"Share the screen or your folders in Ubuntu Linux with this change"},"content":{"rendered":"<p>Much of the blame for these tests lies with the developers of the aforementioned Linux distros.  And it is that little by little they are getting all kinds of users to try their projects due to the simplicity of use that they offer us.  Those times when Linux was limited to a few experts in this software, have been left behind in most cases.  In this way many of those who do not agree at all with the way of <strong>running microsoft windows<\/strong>they launch to test an open source system.<\/p>\n<p>Here we find all kinds of functions, most comparable to the Microsoft system, and even better.  But for many the most important thing in these times is the ease of use that the whole set provides us to take advantage of the operating system.  It is true that delving into it through the <strong>Terminal<\/strong>it already requires more advanced knowledge, but that is not a problem for most who do not want complications.<\/p>\n<p>As a clear example of all this, the functions that we are going to talk about below that allow us to <strong>share the screen or certain folders<\/strong> in a matter of seconds on the aforementioned Ubuntu.  What a few years ago was a somewhat complex task that required <strong>Linux knowledge<\/strong> advanced, today it is within the reach of the majority.<\/p>\n<h2>Share screen or certain folders in Ubuntu Linux<\/h2>\n<p>Keep in mind that the Ubuntu configuration section, like in most Linux systems, can be very helpful.  From here we can customize and adapt a multitude of sections and parameters of the software itself to our needs.  In addition, to access this window that we are commenting on, we only have to click with the right mouse button on the desktop and select the option <strong>Setting<\/strong>.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>This movement will give way to a new window in which, if we take a look at its left panel, we find the different sections available.  Well, in the case that occupies us in these lines we are going to place ourselves in the section called <strong>Share<\/strong>.  By default the features available here are disabled.<\/p>\n<p>The main reason for this is obviously for security reasons.  But this is a state that we can quickly modify and thus share, on the one hand, our screen, and on the other, certain folders that we have in the system.  Of course, before being able to activate these options, it is mandatory <strong>change selector state<\/strong> located at the top of the window, next to the Share message.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-762363\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653642331_30_Share-the-screen-or-your-folders-in-Ubuntu-Linux-with.jpg\" alt=\"share ubuntu\" width=\"967\" height=\"586\"  \/><\/p>\n<p>From that moment we will be able to customize how we are going to share the system screen, for example, <strong>setting an access password<\/strong>.  In fact, this is highly recommended for security and privacy reasons.  In the same way we can change the name of the computer or specify the specific folders that we want to share with other users.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Much of the blame for these tests lies with the developers of the aforementioned Linux distros. And it is that little by little they are getting all kinds of users to try their projects due to the simplicity of use that they offer us. Those times when Linux was limited to a few experts in [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2429,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2426"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2426"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2426\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2429"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2426"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2426"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2426"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}