{"id":2452,"date":"2022-05-27T13:58:00","date_gmt":"2022-05-27T13:58:00","guid":{"rendered":"https:\/\/why-what-who.com\/meet-the-highest-paid-players-in-the-world-cup\/"},"modified":"2022-05-27T13:58:00","modified_gmt":"2022-05-27T13:58:00","slug":"meet-the-highest-paid-players-in-the-world-cup","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/meet-the-highest-paid-players-in-the-world-cup\/","title":{"rendered":"Meet the highest paid players in the World Cup"},"content":{"rendered":"<p><h2>Their on-court play isn&#8217;t the only thing these players are known for;  his salary exceeds what many mortals will not get for the rest of their lives.<\/h2>\n<\/p>\n<p class=\"content-element-p mb-6\">They are virtuous on the field and the reward has to be proportional to what they make us vibrate with their work.  However, some of the stars that are shining in this World Cup in Russia, reach salaries that have endless zeros.<\/p>\n<p class=\"content-element-p mb-6\">Well, maybe not so much, but the figures are enough to be considered the best paid in the world.  They, being stars, receive truckloads of money for playing football in an amazing way.<\/p>\n<p>ADVERTISING &#8211; KEEP READING BELOW<\/p>\n<p class=\"content-element-p mb-6\">Leo Messi<\/p>\n<p class=\"content-element-p mb-6\">The player of the Argentine National Team has earnings that reach 126 million euros.  Messi, who has made a difference due to his way of dominating the ball and the overflow he achieves along the pitch, made his debut at Futbol Club Barcelona in 2004. <\/p>\n<p class=\"content-element-p mb-6\">Messi is the only player in history to achieve four football awards in a single season: Ballon d&#8217;Or, Best Player of the International Federation of Football Association, Pichichi and Golden Shoe, all in the 2011-2012 season.  In addition, Lionel has the most goals scored in the same year with a single club: 79 goals in 60 games, made in 2012.<\/p>\n<p>ADVERTISING &#8211; KEEP READING BELOW<\/p>\n<p class=\"content-element-p mb-6\">Messi easily destroys goalkeepers.  (Video: YouTube, via Joga Sport)<\/p>\n<p class=\"content-element-p mb-6\">Cristiano Ronaldo<\/p>\n<p class=\"content-element-p mb-6\">CR7 has earnings of 94 million euros.  The Portugal player is a crack when he has contact with the ball and, like Messi, he makes the difference on the pitch.  They are players who are always at the right time.<\/p>\n<p>ADVERTISING &#8211; KEEP READING BELOW<\/p>\n<p class=\"content-element-p mb-6\">Cristiano made his debut for the Spanish club Real Madrid in 2009, where he plays as a striker until now.  He went through the English league leaving good numbers at Manchester United, from 2003 to 2009. In addition, he is the top scorer for Real Madrid in its entire history, with 450 goals in 438 games.<\/p>\n<p>ADVERTISING &#8211; KEEP READING BELOW<\/p>\n<p class=\"content-element-p mb-6\">2018 has been a great year for Cristiano Ronaldo and here is the proof (Video: YouTube, via George 11!)<\/p>\n<p class=\"content-element-p mb-6\">Neymar<\/p>\n<p class=\"content-element-p mb-6\">The player of the Brazilian National Team reaches earnings of up to 81 million 500 thousand euros.  Neymar has good control of the ball throughout the field, he is forceful when entering the small area, just where he defines with great precision.  He debuted with Barcelona in 2013 and remained there until 2017, before moving on to the French League with Paris Saint-Germain.<\/p>\n<p>ADVERTISING &#8211; KEEP READING BELOW<\/p>\n<p class=\"content-element-p mb-6\">Neymar was declared the most valuable young player in the world, designated by the International Federation of Football Association, in 2012. The Brazilian won the Ballon d&#8217;Or at the Confederations Cup in 2013.<\/p>\n<p>ADVERTISING &#8211; KEEP READING BELOW<\/p>\n<p class=\"content-element-p mb-6\">Here we bring you ten Neymar goals that surprised the world (Video: YouTube, via RedConectate) <\/p>\n<p class=\"content-element-p mb-6\">Gareth Bale<\/p>\n<p class=\"content-element-p mb-6\">Although Wales did not qualify for the World Cup, we must include in this list Gareth Bale, who is one of the highest paid in the world.  The player has winnings of up to 44 million euros.  The Real Madrid player was also considered one of the most talented in the Premier League of all time.<\/p>\n<p>ADVERTISING &#8211; KEEP READING BELOW<\/p>\n<p class=\"content-element-p mb-6\">At some point he received recognition as the Best Player in the Premier League (2012-2013), as well as being named the Best Young Player in the Premier League, in the 2012-2013 season.<\/p>\n<p>ADVERTISING &#8211; KEEP READING BELOW<\/p>\n<p class=\"content-element-p mb-6\">Gareth Bale&#8217;s top ten goals are compiled in this video.  (Video: YouTube, via El Fratalasca)<\/p>\n<p class=\"content-element-p mb-6\">Gerard Piqué<\/p>\n<p class=\"content-element-p mb-6\">The culé receives earnings of up to 29 million euros.  The player from Spain made his debut with Barcelona in 2008 and performs in an extraordinary way as a defender.  He was world champion with Spain in 2010, during the World Cup in South Africa.<\/p>\n<p>ADVERTISING &#8211; KEEP READING BELOW<\/p>\n<p class=\"content-element-p mb-6\">Gerard Piqué and his performances with Barcelona are compiled in this video.  (Video: YouYube via Pelon from Brazzers)<\/p>\n<p>ADVERTISING &#8211; KEEP READING BELOW<\/p>\n<p class=\"content-element-p mb-6\">You might be interested in:<\/p>\n<p class=\"content-element-p mb-6\">Maradona, the controversial character that Argentines love and hate<\/p>\n<p class=\"content-element-p mb-6\">Mexico will face Brazil in the Round of 16 in Russia<\/p>\n<p>ADVERTISING &#8211; KEEP READING BELOW<\/p>\n<p class=\"content-element-p mb-6\">Jared Leto will be in a new Spider-Man film<\/p>\n<p>might interest you<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Their on-court play isn&#8217;t the only thing these players are known for; his salary exceeds what many mortals will not get for the rest of their lives. They are virtuous on the field and the reward has to be proportional to what they make us vibrate with their work. However, some of the stars that [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2453,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2452"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2452"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2452\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2453"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2452"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2452"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2452"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}