{"id":2457,"date":"2022-05-27T14:02:00","date_gmt":"2022-05-27T14:02:00","guid":{"rendered":"https:\/\/why-what-who.com\/7-changes-you-have-to-make-now-in-your-router\/"},"modified":"2022-05-27T14:02:00","modified_gmt":"2022-05-27T14:02:00","slug":"7-changes-you-have-to-make-now-in-your-router","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/7-changes-you-have-to-make-now-in-your-router\/","title":{"rendered":"7 changes you have to make now in your router"},"content":{"rendered":"\n<p>Little by little, WPA3 encryption is being established, the safest known.  It still remains for this to steal the site from WPA2, but what you should never do is keep WEP encryption on your computer, since it arrived in 1997 and today counts <strong>with many major security holes<\/strong>.<\/p>\n<h2>Disable WAN admin access<\/h2>\n<p>In case you don&#8217;t know it, the term WAN means Wide Area Network, or in Spanish, <strong>Wide Area Network<\/strong>.  Explained in this case in a simple way, the WAN administrator can remotely access our router.<\/p>\n<p>The operators install the device in our house with this active administrator in case they have to solve a problem remotely, but obviously it can also lead someone undesirable to use this access at will. <strong>Try to disable it as soon as possible<\/strong>.<\/p>\n<h2>Disable WPS, uPnP and NAT-PMP<\/h2>\n<p>WPS is a system that some routers have.  This allows you to connect to the WiFi network<strong> without the need to enter the password of this<\/strong>, just by entering an 8-digit PIN code.  It is true that it can be very useful in case we do not remember the WiFi password or simply do not want to put it, but it is also a &#8220;very juicy&#8221; door for an attack.<\/p>\n<p>On the other hand, uPnP and NAT-PMP are essentially the same and therefore just as dangerous.  What these two protocols allow is that the devices that we connect to our router do not have any problem with its ports, since <strong>the device will open them automatically<\/strong>.  This is usually very useful for some very specific cases, such as game consoles.  However, with them we are practically giving the keys to someone who knows how to enter our network.<\/p>\n<h2>Change the default WiFi password<\/h2>\n<p>As I&#8217;m sure you know, all routers on the market <strong>come with a WiFi password set by default<\/strong>.  The most common is that this is located under the device with a sticker, and many users do not usually change it throughout the life of the router.  This is completely a mistake, as some of these passwords are too easy to guess.<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1558410\" class=\"wp-caption-text\">Our WiFi can be the gateway for undesirables.<\/p>\n<p>In fact, over time your password may show up in databases or on the Dark Web, so you should change it to your old one.  We recommend that you do not use a password that is easy to guess or that you are already using elsewhere.  Also, <strong>try to change it periodically<\/strong>.<\/p>\n<h2>Do not have two identical passwords<\/h2>\n<p>This tip can be a &#8220;staple&#8221; that you can use pretty much anywhere you can think of.  It is very important that we do not have two identical passwords, and many people place <strong>the same password for WiFi and to access the router<\/strong> with the aim of having to remember only one password.<\/p>\n<p>Logically, this can be a terrible mistake that should not even cross your mind. <strong>Always try to have a different password for everything<\/strong>a basic measure, but one that is vital to protect the security of your computers.<\/p>\n<h2>Change the name of the SSID<\/h2>\n<p>SSID stands for “Service Set Identifier”, although it is popularly known <strong>as network name<\/strong>.  The SSID is the name with which our network appears when searching for WiFi networks, and as with the password, our router usually has one by default.<\/p>\n<p><strong>All routers allow us to change this SSID without problems<\/strong>, something that we recommend you do as soon as possible.  When doing so, try to establish a name that does not indicate data such as the model of your router, or details that allow it to be associated with you.  Some routers also allow you to disable the SSID so that it does not appear when searching for a network, so the only way to connect to these devices is to enter the name manually.<\/p>\n<h2>Enable automatic updates on your router<\/h2>\n<p>The router is a technological device like any other, so it has a firmware.  It is not at all uncommon for security holes to be discovered in all routers, which is why manufacturers spend a lot of effort to detect them. <strong>to be able to patch them<\/strong>.<\/p>\n<p>Therefore, it is very important that we always have our device as updated as possible.  We can do it manually by entering our router as administrators, but we also have the possibility of activating an option so that these <strong>are updated automatically<\/strong> whenever there is a new firmware available.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Little by little, WPA3 encryption is being established, the safest known. It still remains for this to steal the site from WPA2, but what you should never do is keep WEP encryption on your computer, since it arrived in 1997 and today counts with many major security holes. Disable WAN admin access In case you [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2459,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2457"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2457"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2457\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2459"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2457"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2457"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2457"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}