{"id":2462,"date":"2022-05-27T15:45:59","date_gmt":"2022-05-27T15:45:59","guid":{"rendered":"https:\/\/why-what-who.com\/the-first-windows-11-update-is-ready-when-does-it-arrive\/"},"modified":"2022-05-27T15:45:59","modified_gmt":"2022-05-27T15:45:59","slug":"the-first-windows-11-update-is-ready-when-does-it-arrive","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/the-first-windows-11-update-is-ready-when-does-it-arrive\/","title":{"rendered":"The first Windows 11 update is ready, when does it arrive?"},"content":{"rendered":"<p>Windows 11 is about to change, for the better.  The arrival of the operating system has been quite bumpy due to several launch problems, and functions that users have not finished liking.  However, there is always time to rectify.  And, nearly a year after this release, Microsoft is poised to give users the operating system they deserved from the start.  And this is <strong>Windows 11 22H2 update<\/strong>.<\/p>\n<p>Since the arrival of the first version of Windows 11, Microsoft has been working on this update thanks to the Insider program.  The users registered in this channel have been seeing how the taskbar has been improving, the general performance of the system, and how some novelties have been included, such as the wallpapers of <strong>Windows Spotlight<\/strong>.  First, this version was in a very early stage of development, in the Dev channel. But, a few months ago, Microsoft started working on the Beta channel, much less unstable and already recommended for some users.<\/p>\n<p>Currently Microsoft has made a version jump in its Insider program, putting the versions of the operating system in build 25xxx, which is equivalent to the <strong>23H2 update<\/strong> planned for next year.  Thus, the Insider users who were signed up for the Beta channel have stayed at 22H2.  Specifically in build 22621. And this, finally, has been confirmed as the RTM, and it will be the version that will reach all users.<\/p>\n<h2>The Windows 11 22H2 RTM is already there, but without a date<\/h2>\n<p>In a document of <strong>Windows Hardware Compatibility Program<\/strong> For Windows 11, Microsoft has specified that the main requirement for WHCP to run Windows 11 is to have version 22H2 of the operating system installed.  It also indicates that this version already has an RTM certification and that it is also equivalent to build 22621. That is, the new 22H2 update of the operating system is ready.<\/p>\n<p>Build 22621 reached Insider users, within the beta channel, on May 12.  This update, as it had been happening in the previous builds, arrived without any news and various bug fixes and bug fixes.  Since then, a new beta of the operating system has not arrived again, so it is clear that Microsoft has already finished the update, although <strong>It has no scheduled release date.<\/strong><\/p>\n<p>We venture to think that the new Windows 11 22H2 will arrive this summer.  Probably taking advantage of the anniversary of the announcement of the new operating system.  That is, it will probably arrive on June 24, or between the end of June and the beginning of July.  But, we remember, there is nothing official for now.<\/p>\n<h2>Can I install it right away?<\/h2>\n<p>Although Windows 11 22H2 is not yet available to everyone, if we are adventurous users, and we want to try before others the news that has been cooking within the Insider Dev channel this last year, we have good news.  As we have already indicated, build 22621 is equivalent to the RTM of this new version.  That is, the version, as is, that will reach all users at the time of the release of the update.  And, therefore, it is possible to try it right now.<\/p>\n<p>All we have to do is sign up for the Windows 11 Insider channel. Specifically, the “Beta” branch (not the Dev).  Once inside, we look for new Windows updates and we can download this RTM build.  It is installed and, after restarting the PC, we will already have 22H2 running.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>We have been using this version since the day it was released and not only have we not found any serious bugs in it, but it even performs better than the main version of the operating system.  And the truth is that Windows 11 22H2 promises to be a good version.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Windows 11 is about to change, for the better. The arrival of the operating system has been quite bumpy due to several launch problems, and functions that users have not finished liking. However, there is always time to rectify. And, nearly a year after this release, Microsoft is poised to give users the operating system [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2463,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2462"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2462"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2462\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2463"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2462"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2462"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2462"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}