{"id":2488,"date":"2022-05-28T08:54:45","date_gmt":"2022-05-28T08:54:45","guid":{"rendered":"https:\/\/why-what-who.com\/prevent-others-from-snooping-on-your-videos-with-this-kodi-feature\/"},"modified":"2022-05-28T08:54:45","modified_gmt":"2022-05-28T08:54:45","slug":"prevent-others-from-snooping-on-your-videos-with-this-kodi-feature","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/prevent-others-from-snooping-on-your-videos-with-this-kodi-feature\/","title":{"rendered":"Prevent others from snooping on your videos with this Kodi feature"},"content":{"rendered":"<p>The reproduction of all these files, we are talking about videos or music, has become very common in most of today&#8217;s equipment.  That is precisely why a good part of the users look for the most suitable software solutions taking into account several parameters.  In this software sector, the reliability of the program as such is very important, as well as its <strong>compatibility with all types of file formats<\/strong>, or its configuration functions.  If in addition to all this we add an interesting user interface, all the better.<\/p>\n<p>Precisely a large part of all this is found in the aforementioned application <strong>Kodi<\/strong>.  This is free and open source software loved by millions of users around the world for a multitude of reasons.  To its peculiar interface, we can add its stability, compatibility, <strong>available functions<\/strong>and the possibility of using <strong>additional plugins<\/strong>.  And we can&#8217;t forget that this is software compatible with most of the operating systems and devices that we have today.<\/p>\n<p>For all this, on the same computer, it may be the case that the software that we are discussing <strong>use multiple users<\/strong>.  However, this is something that can affect the <strong>privacy of our content<\/strong> and libraries of multimedia files, since they could be viewed by the rest.  Therefore, if we want other people who have access to this same program not to be able to gossip our videos of the <strong>personal library<\/strong>Let&#8217;s see how to fix it.<\/p>\n<h2>Get to know the Kodi Profiles feature to protect your videos<\/h2>\n<p>We have already told you that this multimedia center allows us to use multiple devices and operating systems, also by different people.  But to take a little more care of our videos and music libraries, we always have the possibility of creating several profiles.  One of the main advantages offered by this function is that <strong>each user will manage their libraries<\/strong>, settings and preferences individually.  In addition, it allows us to increase the privacy of our own content, all from the same program and equipment.<\/p>\n<p>In order to be able to take advantage of this integrated feature that we discussed, we open the program and take a look at the upper part of the interface.  Here we find a button that has a toothed wheel on which we press.  This will give us access to the Kodi configuration window, where we find several sections available.  The one that interests us in this case is the call <strong>Profiles<\/strong>.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>As it happens in many programs and operating systems, here we will find an administrator, and at the same time we will be able to <strong>add different profiles <\/strong>for as many users as we need.  Something we should know is that, once we have assigned the name to that new user, we can <strong>set different parameters<\/strong>.  Among these we can establish a folder for all its contents, separate the information corresponding to this new profile, make its sources independent, or give it an image.  In this way each of the people who use the Kodi multimedia center will have their own content and their <strong>independent disk locations <\/strong>for this.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The reproduction of all these files, we are talking about videos or music, has become very common in most of today&#8217;s equipment. That is precisely why a good part of the users look for the most suitable software solutions taking into account several parameters. In this software sector, the reliability of the program as such [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2490,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2488"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2488"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2488\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2490"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2488"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2488"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2488"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}