{"id":249,"date":"2022-05-11T09:04:39","date_gmt":"2022-05-11T09:04:39","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/11\/what-is-avg-antivirus-do-not-disturb-mode-for\/"},"modified":"2022-05-18T15:55:35","modified_gmt":"2022-05-18T15:55:35","slug":"what-is-avg-antivirus-do-not-disturb-mode-for","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/what-is-avg-antivirus-do-not-disturb-mode-for\/","title":{"rendered":"What is AVG Antivirus Do Not Disturb Mode for?"},"content":{"rendered":"<p>If we hear about the term antivirus in the software sector, many of us relate them to security programs that are responsible for protecting our computers and data.  Among the options that we can choose here, <strong>AVG Antivirus<\/strong> It is one of the most popular and used thanks to all the functions it provides us.<\/p>\n<p>For years, an antivirus has been directly related to software in charge of filtering and not letting our computers pass the <strong>different existing malicious codes<\/strong>.  For all this, they receive almost constant updates that allow them to detect the latest malware developed and found.  However, in these times, its main managers are now adding various <strong>Additional functions<\/strong>.<\/p>\n<p>With this we want to tell you that in most of the <strong>antivirus<\/strong> today we find features that are not closely related to security.  Despite all this, they offer us enormous utility and a better experience of using the operating system.  As it could not be otherwise, the aforementioned AVG Antivirus could not be less.  Over the years and as it has been receiving <strong>updates<\/strong>a multitude of useful functions have also arrived.<\/p>\n<p>Precisely in these same lines we want to talk to you about a functionality that can be of enormous help to you on a day-to-day basis with a Windows-based PC.  Specifically, we are referring to a feature implemented in several editions of the antivirus called <strong>Do not bother<\/strong>.  It is true that at first all this is not very related to the security that this program provides us.  On the contrary, it does take care of <strong>improve the use of the operating system and some of its applications<\/strong>.<\/p>\n<h2>AVG Antivirus Do Not Disturb Mode Utility<\/h2>\n<p>The first thing we should know is that this function provided by the aforementioned security software <strong>It helps us in certain uses of Windows<\/strong>.  When we talk about Do Not Disturb Mode, the first thing to know is that it is an enhancement to the previous Game Mode feature.  In addition, this element can be found in the Internet Security and Antivirus Free editions of AVG.  This means that even users using the <strong>free version of antivirus<\/strong> they will be able to benefit from all this point<\/p>\n<p>To give you an idea of ​​what we are talking about, we tell you that this mode of operation is responsible for silencing all unnecessary notifications.  This is something that becomes effective while <strong>we run almost any application or game in full screen<\/strong>.  Basically, every time we open a software in full screen, this Do Not Disturb Mode automatically detects it and in the system.  It then adds that app to its own list that it saves automatically.<\/p>\n<p>Thus, later, when we run any of the applications on this list, the <strong>do not disturb mode<\/strong> it starts on its own.  At the same time it silences all notifications from Windows, AVG and other tools that we have installed.  What&#8217;s more, in the <strong>application list<\/strong> in the way we refer to you, it is configurable.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>We just have to click on the button of its options next to each marked program and activate the Maximize performance selector.  In this way, that application will be executed with the highest priority to improve the performance of the PC.  For example, all this will be very useful when it comes to running and enjoying our favorite games in full screen.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If we hear about the term antivirus in the software sector, many of us relate them to security programs that are responsible for protecting our computers and data. Among the options that we can choose here, AVG Antivirus It is one of the most popular and used thanks to all the functions it provides us. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":251,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/249"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=249"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/249\/revisions"}],"predecessor-version":[{"id":901,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/249\/revisions\/901"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/251"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=249"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=249"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=249"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}