{"id":2496,"date":"2022-05-28T09:37:06","date_gmt":"2022-05-28T09:37:06","guid":{"rendered":"https:\/\/why-what-who.com\/free-tickets-for-the-u17-world-cup\/"},"modified":"2022-05-28T09:37:06","modified_gmt":"2022-05-28T09:37:06","slug":"free-tickets-for-the-u17-world-cup","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/free-tickets-for-the-u17-world-cup\/","title":{"rendered":"Free tickets for the U17 World Cup"},"content":{"rendered":"<p>\t\t\t\t\t\t\t\t\t\t\t\t<\/p>\n<p>        On the eve of the start of the U17 World Cup and once the first stage of the ticketing plan has been completed, the Argentine Basketball Confederation has created a special form so that those who want to attend the World Cup at the Rosario headquarters (and have not accessed their ticket through the available distribution circuits), can attend the event.  It is recalled that in order to facilitate access and dissemination of the event, the Organizing Committee ordered that tickets be free.<\/p>\n<p>The general tickets were divided into thirds between the Municipality of Rosario, which distributed through the Rosarina Basketball Association, the provincial government that worked together with the educational system and physical education centers and participants of the JR NBA program, and the Federation Santafesina de Básquet that distributed them among the affiliated associations.  Given the marked interest of the basketball family in attending the event, we have decided to open a ticket request system to deliver a remaining 500 daily passes for those who still do not have a ticket.<\/p>\n<p>To do this, they must complete the aforementioned form, stating their full name, DNI and email.  There is time until 21, at the latest.  The winners of the tickets will be notified by mail and must pick up their tickets at the Santa Fe Basketball Federation (Moreno 467, Rosario, between 2:00 p.m. and 7:00 p.m.). <\/p>\n<p>The system, only planned for the qualifying phase, will be enabled day by day, so that on the day of the date the tickets are made available for the first day of the U17 World Cup in Rosario, which will have as its main course the clash between Argentina and France at 9 pm, at the Newell&#8217;s stadium.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>On the eve of the start of the U17 World Cup and once the first stage of the ticketing plan has been completed, the Argentine Basketball Confederation has created a special form so that those who want to attend the World Cup at the Rosario headquarters (and have not accessed their ticket through the available [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2497,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2496"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2496"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2496\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2497"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2496"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2496"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2496"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}