{"id":2498,"date":"2022-05-28T10:07:21","date_gmt":"2022-05-28T10:07:21","guid":{"rendered":"https:\/\/why-what-who.com\/this-is-the-software-that-the-dgt-plans-to-limit-the-speed-of-your-car\/"},"modified":"2022-05-28T10:07:21","modified_gmt":"2022-05-28T10:07:21","slug":"this-is-the-software-that-the-dgt-plans-to-limit-the-speed-of-your-car","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/this-is-the-software-that-the-dgt-plans-to-limit-the-speed-of-your-car\/","title":{"rendered":"This is the software that the DGT plans to limit the speed of your car"},"content":{"rendered":"<p>As part of one of its big bets, the DGT, the General Directorate of Traffic, has spent years fighting an arduous battle against speeding, which causes so many accidents on roads.  Also some manufacturers, such as Renault, have begun to limit the maximum speed of their models to help reduce road accidents.  For this reason, now it is sought to have the <strong>ISA-software<\/strong>.<\/p>\n<h2>The DGT wants to limit the speed compulsorily<\/h2>\n<p>A little over a year ago, speed reduction was introduced in Spain <strong>maximum at 30 km\/h<\/strong> in one-way urban areas.  This measure is one of several that the road agency is doing so that speed can be reduced on our streets and highways to avoid accidents.<\/p>\n<p>And to continue to deal with it, the road agency is also considering other ways to reduce accidents considerably.  In this case we see it with a software that is already planned to be introduced in our car <strong>mandatory<\/strong> to limit speed, both in cities and on the highway.<\/p>\n<p>And it is that the <strong>speeding<\/strong> it ranks behind distracted driving and ahead of alcohol in road accidents.  The DGT has been fighting for a long time with this premise on the road, as has the European Union, which intends to force respect of speed limits on the road through the <strong>isa system<\/strong>.<\/p>\n<h2>This is the ISA system against speeding<\/h2>\n<p>We are talking about software that in Spain is called <strong>smart speed assistant<\/strong>.  This security system is one of the eight ADAS technologies that the European Commission has established as mandatory from this month of May 2022 for newly approved cars.<\/p>\n<p>It is also true that it is not the first time that a decision of this type has been made in Europe, since it has already happened previously with the ABS anti-lock braking system or with the stability control (ESP).  Its objective is that this speed limiter for our car be installed in vehicles in the manufacturing phase and as part of the standard equipment, given that according to calculations this device could <strong>avoid 20%<\/strong> of traffic accident victims.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>In this case, what this intelligent driving software does is warn drivers when they exceed the speed limit of the road they are traveling on at that moment.  So what it does is be able to <strong>adjust top speed<\/strong> of the car to the limit that each one of the sections of the road has established according to what the traffic signs indicate.<\/p>\n<h3>Works directly connected to the GPS<\/h3>\n<p>As explained by the General Directorate of Traffic (DGT), the ISA software detects the maximum speed signals which, as established by the entity, is usually placed behind the rear-view mirror and is directly <strong>connected with GPS<\/strong> to read those signs.  To recognize vertical signs, the system combines information captured by a camera (usually located behind the rear-view mirror) with GPS data.<\/p>\n<p>In this way, when the device detects that the car is moving too fast, it sends a <strong>optical, tactile or sound alert<\/strong>.  In the event that the driver does not react to the warning, the system itself can act on the engine or the accelerator.<\/p>\n<p>It must also be taken into account that <strong>it is not a limitation to the use<\/strong>.  Or what is the same;  this software <strong>is adapting<\/strong> to the speed limits of each road, while a limiter does not exceed the limit set by the driver.<\/p>\n<p>This ISA system will be mandatory from next July 2022 on all new vehicles approved in Europe and on all new vehicles sold from 2024, as clarified by the General Directorate of Traffic: «New vehicles approved in Europe <strong>from 2022,<\/strong> and the new ones sold from 2024, must have an intelligent speed assistant ISA, which warns the driver when he exceeds the legal limits.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As part of one of its big bets, the DGT, the General Directorate of Traffic, has spent years fighting an arduous battle against speeding, which causes so many accidents on roads. Also some manufacturers, such as Renault, have begun to limit the maximum speed of their models to help reduce road accidents. For this reason, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2500,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2498"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2498"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2498\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2500"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2498"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2498"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2498"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}