{"id":2510,"date":"2022-05-28T11:32:59","date_gmt":"2022-05-28T11:32:59","guid":{"rendered":"https:\/\/why-what-who.com\/free-tickets-for-the-dance-world-cup-finals-at-luna-park-are-sold-out\/"},"modified":"2022-05-28T11:32:59","modified_gmt":"2022-05-28T11:32:59","slug":"free-tickets-for-the-dance-world-cup-finals-at-luna-park-are-sold-out","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/free-tickets-for-the-dance-world-cup-finals-at-luna-park-are-sold-out\/","title":{"rendered":"Free tickets for the Dance World Cup finals at Luna Park are sold out"},"content":{"rendered":"<p class=\"volanta mb-1 text-700\">CABA |  TANGO BUENOS AIRES FESTIVAL AND WORLD<\/p>\n<p class=\"copete\">This Tuesday, at the Exhibition Center, 12,000 locations were delivered.<\/p>\n<p class=\"fya\">  08.21.2012 12:34 |  Tourism Entity of Buenos Aires |\n<\/p>\n<p>Piazzolla at the Usina del Arte.  This Tuesday, 12,000 free tickets were given out for the Dance World Cup Finals in the Tango Salón and Tango Stage categories, which will take place at Luna Park on August 27 and 28, respectively, and which will be the finishing touch of Tango Buenos Aires Festival and World Cup organized by the Ministry of Culture of the government of the City of Buenos Aires.<\/p>\n<p>In just 3 hours the places for the closing of the biggest tango event were sold out.  Thousands of people came to the Exhibition Center on Figueroa Alcorta and Pueyrredón avenues very early.  In the place there were dance couples and music that invited the public to milongaar.<\/p>\n<p>Hernán Lombardi, Buenos Aires Minister of Culture, highlighted: &#8220;Different generations of participants once again invade this world championship with talent and creativity, which is an attraction not only for Buenos Aires residents but also for tourists who visit the city.&#8221; <\/p>\n<p>For two weeks, the Tango Buenos Aires Festival and World Cup brings together an offer of proposals that includes more than 2,000 artists and the performance of more than 200 shows, as well as classes, milongas, meetings and parties.  All with free admission.<\/p>\n<p>On Tuesday the 21st, the activity continues with the qualifying rounds of the Dance World Cup in the Salon Tango Category, classes with champions from past editions and other specialists, a talk about Eduardo Arolas (all at the Exhibition Center, located in Figueroa Alcorta and Pueyrredón) and the concerts of the Típica Sub 25 directed by Pablo Agri and the duo Cristian Zárate &#038; Leonardo Sánchez at the Teatro Regio (Av. Córdoba 6056).<\/p>\n<p>More information: <\/p>\n<p>www.festivales.gob.ar\n<\/p>\n<p>You must be logged in to comment<\/p>\n<p class=\"bg-200 p-2 importante\"><strong>IMPORTANT:<\/strong> The published comments are the sole responsibility of their authors and the consequences derived from them may be subject to the corresponding legal sanctions.  Any user who includes a comment that violates the regulations in their messages will be removed and disabled from commenting again.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>CABA | TANGO BUENOS AIRES FESTIVAL AND WORLD This Tuesday, at the Exhibition Center, 12,000 locations were delivered. 08.21.2012 12:34 | Tourism Entity of Buenos Aires | Piazzolla at the Usina del Arte. This Tuesday, 12,000 free tickets were given out for the Dance World Cup Finals in the Tango Salón and Tango Stage categories, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2511,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2510"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2510"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2510\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2511"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2510"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2510"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2510"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}