{"id":2519,"date":"2022-05-28T15:16:00","date_gmt":"2022-05-28T15:16:00","guid":{"rendered":"https:\/\/why-what-who.com\/what-are-all-those-chrome-processes-that-consume-so-much-ram\/"},"modified":"2022-05-28T15:16:00","modified_gmt":"2022-05-28T15:16:00","slug":"what-are-all-those-chrome-processes-that-consume-so-much-ram","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/what-are-all-those-chrome-processes-that-consume-so-much-ram\/","title":{"rendered":"What are all those Chrome processes that consume so much RAM"},"content":{"rendered":"<p>Once we have the PC running, as we run different applications, they consume a certain amount of resources.  One of the main complaints, despite its enormous market penetration, which has the <strong>google chrome browser<\/strong>is precisely that high consumption.<\/p>\n<p>At this time, Internet browsers are existing programs and almost constantly running on most computers.  Whether desktop or mobile, solutions like Firefox, Edge, or the aforementioned Chrome are working pretty much all the time.  Hence precisely the importance of <strong>RAM and CPU<\/strong> who use these applications in their day to day.<\/p>\n<p>As we mentioned before, the undisputed leader in this sector and by far is the <strong>google proposal<\/strong>.  But despite hovering <strong>70% global market penetration<\/strong>, that does not mean that it is a perfect program.  In addition to everything related to privacy, there are many users who complain about the high consumption of resources by this program.  In fact, we only have to take a look at the <strong>Windows&#8217; own task manager<\/strong> to, on many occasions, see this first-hand.<\/p>\n<p>To say that the Task Manager that we are talking about is a basic element in the Microsoft system.  We can open it through the key combination <strong>Ctrl + Shift + Esc<\/strong> and gives us access to a list with all the <strong>running system applications and processes<\/strong>.  In addition, it shows us a good amount of information, such as the consumption of computer resources that is carried out in real time.  In fact, here we can see multiple processes corresponding to the aforementioned Chrome, and we may not understand the reason.<\/p>\n<h2>What are the different processes that Chrome creates<\/h2>\n<p>Especially in old equipment or somewhat limited in terms of specifications, we must take special care in the execution of certain programs.  Otherwise, we may experience certain malfunctions or even crashes when working with our computer.  All this is generally due to excessive consumption of elements such as RAM or CPU.  Hence, the Task Manager is an important element to be able to monitor all this.<\/p>\n<p>If we focus on the browser of the search giant, when it is working <strong>we see several open processes<\/strong>.  At the same time, each one of them independently is carrying out a certain task in real time. <strong>Resource consumption<\/strong>.  Well, at this point we must bear in mind that Google Chrome is made up of various elements that could be considered independent, even though they are part of the program.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>Here we talk about elements as important as the different <strong>extensions<\/strong> that we have installed in the program and that they are working.  Also, certain <strong>tabs<\/strong> of the ones we open also generate their own independent processes, just like incognito windows, to which we add other <strong>internal threads of Chrome itself<\/strong> which are reflected in the aforementioned Task Manager.  The sum of the whole set sometimes shows us a consumption of RAM memory and CPU that is too high, hence the <strong>complaints from many users<\/strong>.<\/p>\n<p>In addition, these processes that appear on the screen will help you understand the care that we have mentioned on more than one occasion, that we must have with the extensions and tabs to optimize the operation of the browser.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Once we have the PC running, as we run different applications, they consume a certain amount of resources. One of the main complaints, despite its enormous market penetration, which has the google chrome browseris precisely that high consumption. At this time, Internet browsers are existing programs and almost constantly running on most computers. Whether desktop [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2521,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2519"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2519"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2519\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2521"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2519"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2519"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2519"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}