{"id":2542,"date":"2022-05-28T18:50:18","date_gmt":"2022-05-28T18:50:18","guid":{"rendered":"https:\/\/why-what-who.com\/what-are-the-most-profitable-industries-in-the-world\/"},"modified":"2022-05-30T14:48:44","modified_gmt":"2022-05-30T14:48:44","slug":"what-are-the-most-profitable-industries-in-the-world","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/what-are-the-most-profitable-industries-in-the-world\/","title":{"rendered":"What are the most profitable industries in the world?"},"content":{"rendered":"<p>Thanks to different sectors, the world economy continues to turn. And beyond the existence of multi-million dollar companies, there are gigantic industries that have taken over the markets and have humanity eating out of their hands.<\/p>\n<p>It is not a secret that power and money have remained in the same areas for some years now.<\/p>\n<p>At Q&#8217;PASA we will share with you which are the most profitable industries in the world.<\/p>\n<ol>\n<li><strong>Oil industry<\/strong><\/li>\n<\/ol>\n<p>By 2019, the six companies that govern the oil industry earned around US$156 billion in total.<\/p>\n<p>For Forbes magazine, in 2017, the company dedicated to oil, natural gas and petrochemicals, Saudi Aramco, produced about ten million barrels. On Latin American lands, Petróleos Mexicanos or &#8216;Pemex&#8217;, produced 3.6 million barrels a day. And the Russian giant, Gazprom, generated 8.38 million barrels in just 24 hours.<\/p>\n<ol start=\"2\">\n<li><strong>financial industry<\/strong><\/li>\n<\/ol>\n<p>During 2019, the financial sector benefited immensely, since both consumers, investors and entities won. The entities move a little more than US$115 billion a year.<\/p>\n<ol start=\"3\">\n<li><strong>Defense sector industry<\/strong><\/li>\n<\/ol>\n<p>According to the Global Firepower report on &#8216;Military Force 2020&#8217;, the sum of the budget investment for the defense sector, among the ten most powerful armies in the world, generates a total value of US$1,323 million.<\/p>\n<p>Here the active members, aircraft, weapons, tanks and other elements necessary for the protection and attacks of the countries are taken into account.<\/p>\n<ol start=\"4\">\n<li><strong>video game industry<\/strong><\/li>\n<\/ol>\n<p>With the arrival of the new Sony PlayStation 5, in its standard and digital versions, which will cost US$399.99 and US$499.99 respectively, it is evident that the world of entertainment is a bit expensive.<\/p>\n<p>The Management Magazine website ensures that China is among the countries that generate the most profits from this industry, reaching revenues of US$32,536 million.<\/p>\n<p>For the year 2019, according to Superdata, the purchase of digital games increased by 3% compared to 2018, which helped earn profits of US$120.1 billion. One of the top video games that generated US$1.8 billion was the popular Fortnite.<\/p>\n<ol start=\"5\">\n<li><strong>Prostitution and drug industry<\/strong><\/li>\n<\/ol>\n<p>By 2018, according to UN data, prostitution generated profits of US$108 billion annually. In turn, the Organization assures that the sector that moves the most money in the world is that of drugs, leaving profits of US$300 billion a year.<\/p>\n<ol start=\"6\">\n<li><strong>Pharmaceutical industry<\/strong><\/li>\n<\/ol>\n<p>The pharmaceutical industry is one of the most important in the world. This has generated large amounts of money, so much so that it is believed that by 2014 the income of the sector would be between US$700 billion.<\/p>\n<p>That same year, the BBC published an article about how incredible it was that pharmaceutical companies made more money than banks. They commented that by 2013, the companies Pfizer, Eli Lilly, Hoffmann-La Roche, GSK and AbbVie, increased their revenues by 20%.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Thanks to different sectors, the world economy continues to turn. And beyond the existence of multi-million dollar companies, there are gigantic industries that have taken over the markets and have humanity eating out of their hands. It is not a secret that power and money have remained in the same areas for some years now. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2543,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2542"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2542"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2542\/revisions"}],"predecessor-version":[{"id":2843,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2542\/revisions\/2843"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2543"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2542"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2542"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2542"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}