{"id":2544,"date":"2022-05-28T19:14:29","date_gmt":"2022-05-28T19:14:29","guid":{"rendered":"https:\/\/why-what-who.com\/do-you-want-to-check-the-effectiveness-of-your-antivirus-try-these-ideas\/"},"modified":"2022-05-28T19:14:29","modified_gmt":"2022-05-28T19:14:29","slug":"do-you-want-to-check-the-effectiveness-of-your-antivirus-try-these-ideas","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/do-you-want-to-check-the-effectiveness-of-your-antivirus-try-these-ideas\/","title":{"rendered":"Do you want to check the effectiveness of your antivirus?  try these ideas"},"content":{"rendered":"<p>If we wish to keep intact the <strong>security and privacy<\/strong> of the data on our computer, an antivirus becomes an essential element.  Of course, the first thing that we must take into consideration in this case is to choose well the software solution that we are going to install and use on our computer.<\/p>\n<p>Keep in mind that we have a multitude of proposals from different security companies at our fingertips.  There are some well-known, others less so, while we find both free and paid antiviruses.  Starting with the one that by default we find working in the <strong>Windows system installations<\/strong> from Microsoft.  The software giant here offers us its own security solution so that we don&#8217;t have to resort to third-party programs, we are referring to <strong>Windows Defender<\/strong>.<\/p>\n<p>But despite all this, many users still prefer to download and install third-party security solutions on their Windows-based computers.  Here Microsoft does not give us any problem since Defender deactivates itself when <strong>install another antivirus<\/strong>.  As we mentioned before, at this point what we must take into account is the choice that we are going to make in this regard.  With this, what we want to tell you is that not all protection solutions are the same, even if they seem so.<\/p>\n<p>Internally they have a series of scanning engines and <strong>malware databases<\/strong> Which are really the important elements of these programs.  The user interface that they offer us or the additional functions go into the background.  Precisely for all this, below we will show you some methods to check the effectiveness of our new antivirus.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<h2>How to test an antivirus and demonstrate its effectiveness<\/h2>\n<p>If we want to check the real protection of these <strong>security programs<\/strong>, the first thing we must get is a file that we know contains malware.  In this way we will be able to carry out various tests and verify first-hand the effectiveness of this software.  Of course, we recommend, for example, to use a virtual machine with Windows for all this and thus protect the main operating system of our PC.<\/p>\n<ul>\n<li><strong>Scan with VirusTotal<\/strong>: surely many of you know VirusTotal.  This is a website that allows us, among other things, to upload potentially dangerous files to be analyzed through a multitude of <strong>supported antivirus engines<\/strong>.  In this way we can compare the results obtained by our PC antivirus, with the tests carried out on this website.<\/li>\n<li><strong>Try other antivirus<\/strong>: We can also test those suspicious files with other antiviruses that we install in the virtual machine.  All this will allow us to compare the effectiveness of the different security solutions that we are testing.  Here we recommend you try antivirus belonging to <strong>experienced security companies<\/strong> and proven reputation, there are many.<\/li>\n<li><strong>Update database<\/strong>: yes, whatever the antivirus solution we are going to opt for, before judging it we must fine-tune it.  This is not only achieved through updates to the program itself, but we also have to install the latest version of the database provided by its developer.  This is the one that contains the different types of malicious code that exist at the moment.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>If we wish to keep intact the security and privacy of the data on our computer, an antivirus becomes an essential element. Of course, the first thing that we must take into consideration in this case is to choose well the software solution that we are going to install and use on our computer. Keep [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2546,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2544"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2544"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2544\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2546"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2544"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2544"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2544"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}