{"id":2585,"date":"2022-05-28T21:33:34","date_gmt":"2022-05-28T21:33:34","guid":{"rendered":"https:\/\/why-what-who.com\/technical-characteristics-price-and-availability\/"},"modified":"2022-05-28T21:33:34","modified_gmt":"2022-05-28T21:33:34","slug":"technical-characteristics-price-and-availability","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/technical-characteristics-price-and-availability\/","title":{"rendered":"Technical characteristics, price and availability"},"content":{"rendered":"\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<h2>The best and the worst<\/h2>\n<p>We have one of the strengths of the Xiaomi 12 Pro just by seeing the phone.  AN absolutely premium design, a high-quality mobile that not only promises us power and <strong>good photo<\/strong> but it gives us elegance and high quality materials&#8230; It also highlights a brilliant screen of a very high range.<\/p>\n<p>And not only does it stand out in design, it also does so with an outstanding camera team. <strong>50 triple camera<\/strong> megapixels that make the Xiaomi 12 Pro one of the best quality mobile phones in photo and video.<\/p>\n<p>Among the drawbacks is MIUI, a customization layer that not all users like and that can be somewhat more annoying than other Xiaomi layers.  In addition, the battery is the main complaint of all users and it is <strong>also one of the failures of this mobile<\/strong> premium: won&#8217;t last a full day of heavy use.  In return, fast charging allows us to have it ready in a few minutes if we need it.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1632420 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653773614_562_Technical-characteristics-price-and-availability.jpg\" alt=\"Xiaomi 12 Pro\" width=\"1159\" height=\"596\"  \/><\/p>\n<h2>Price range<\/h2>\n<p>The Xiaomi 12 Pro is a premium mobile, a high-end mobile that we can find with a base price of 999.99 euros.  Is available in<strong> two different versions of RAM<\/strong> albeit with the same internal storage.  The 8 GB RAM version with 256 GB storage is priced at €999.99 and the 12 GB RAM version with 256 GB storage is priced at €1,099.99.<\/p>\n<p>If we take a look at an Amazon price comparator such as CamelCamelCamel we will see that there is no price change in the phone since its launch and that <strong>It has always cost 999.99 euros in this online store.<\/strong> It is also the current price if we choose not to buy it from the official Xiaomi store.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1632552 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653773614_714_Technical-characteristics-price-and-availability.jpg\" alt=\"amazon\" width=\"1200\" height=\"603\"\/><\/p>\n<h2>In which operators can it be obtained<\/h2>\n<p>We can get the Xiaomi 12 Pro 5G with Vodafone.  The phone came exclusively with this operator.  We can get the phone in black color or in blue color and the model with 256 GB capacity and we can get it with portability, with a new number in the operator or<strong> if we are already Vodafone customers.<\/strong><\/p>\n<p>The spot price is 936 euros with portability or 1097 euros for a new number.  If we choose to pay it in installments, we will have to pay from 32 euros per month to get the phone in 24 months with a new number and with an initial payment of 329 euros.  We can also get it in installments with portability, choosing between 24 or 36 months and with an initial payment from 198 euros.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1632429 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653773614_770_Technical-characteristics-price-and-availability.jpg\" alt=\"vodafone\" width=\"1200\" height=\"639\"\/><\/p>\n<h2>Technical data<\/h2>\n<p>All the technical specifications and data of the Xiaomi 12 Pro 5G, a premium phone with a triple 50-megapixel camera, ultra-fast charging and wireless charging&#8230;<\/p>\n<table>\n<tbody>\n<tr>\n<td>Dimensions<\/td>\n<td>163.6 x 74.6 x 8.16mm<\/td>\n<td>With a premium design<\/td>\n<\/tr>\n<tr>\n<td>Weight<\/td>\n<td>205 grams<\/td>\n<td>Light<\/td>\n<\/tr>\n<tr>\n<td>Screen<\/td>\n<td>WQHD+ screen<\/td>\n<td>With FHD+ resolution<\/td>\n<\/tr>\n<tr>\n<td>Operating system<\/td>\n<td>MIUI 13 based on Android 12<\/td>\n<td>Updated and many options<\/td>\n<\/tr>\n<tr>\n<td>Processor<\/td>\n<td>Snapdragon 8 Gen 1<\/td>\n<td>An outstanding power<\/td>\n<\/tr>\n<tr>\n<td>RAM<\/td>\n<td>8GB or 12GB<\/td>\n<td>great performance<\/td>\n<\/tr>\n<tr>\n<td>Storage<\/td>\n<td>  256GB of storage<\/td>\n<td>Not expandable with microSD<\/td>\n<\/tr>\n<tr>\n<td>Drums<\/td>\n<td>4600mAh<\/td>\n<td>With fast charge 120W<\/td>\n<\/tr>\n<tr>\n<td>main chamber<\/td>\n<td>50 megapixels<\/td>\n<td>High-quality photos and videos<\/td>\n<\/tr>\n<tr>\n<td>wide angle camera<\/td>\n<td>50 megapixels<\/td>\n<td>For larger photos<\/td>\n<\/tr>\n<tr>\n<td>telephoto camera<\/td>\n<td>50 megapixels<\/td>\n<td>For detailed photos<\/td>\n<\/tr>\n<tr>\n<td>Frontal camera<\/td>\n<td>32 megapixels<\/td>\n<td>With modes for selfies<\/td>\n<\/tr>\n<tr>\n<td>connectivity<\/td>\n<td>5G, Wi-Fi 6, Bluetooth 5.2<\/td>\n<td>Great speed to navigate<\/td>\n<\/tr>\n<tr>\n<td>ports<\/td>\n<td>USB Type-C \/ Dual Nano SIM<\/td>\n<td>No headphone jack<\/td>\n<\/tr>\n<tr>\n<td>Available colours<\/td>\n<td>Blue, gray or purple<\/td>\n<td>modern and current design<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<h2>ADSLZone review<\/h2>\n<p>The Xiaomi 12 Pro is not a mobile phone for all pockets but it is <strong>a fully recommended smartphone<\/strong> if you are looking for high quality, if you want to take the best photos with a phone without missing a camera in your hands.  In addition, it is also one of the best mobiles if we are looking for a totally premium design, if we want to have &#8220;the best&#8221; in our hands&#8230;<\/p>\n<p>But it also has drawbacks and it is not an off-road phone for those who want to have a mobile whose battery lasts all day because its autonomy will make us always carry the charger with us&#8230; In addition,<strong> MIUI can be very annoying<\/strong> And with too many options, pure Android would always be a more recommended option to complete all the benefits of its design and its camera.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1632417 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653773614_701_Technical-characteristics-price-and-availability.jpg\" alt=\"Xiaomi 12 Pro\" width=\"1106\" height=\"627\"  \/><\/p>\n<h2>User opinion<\/h2>\n<p>On the Xiaomi page there is<strong> 60 registered opinions<\/strong> of which the majority value the phone with five stars, except for two four-star opinions and one three-star opinion.  Users highlight the quality of the mobile…<\/p>\n<blockquote>\n<p>“Perfect delivery on launch day.  A 10 to MI.com.<strong> The phone has a very premium feel<\/strong> in hand, with a spectacular screen.  As negative points, the battery life does not correspond to a mobile of more than €1,000, leaving a lot to be desired”<\/p>\n<\/blockquote>\n<p>At a glance at Amazon we can read the opinions of some users who have bought the Xiaomi 12 Pro&#8230; Most users on Amazon rate the phone with five stars, although there are not many mobile ratings at the moment.  They highlight the camera and in the section of inconveniences they usually <strong>match on battery life,<\/strong> somewhat scarce for a day of intense use.<\/p>\n<p>Luis, in a comment in April 2022, says the following:<\/p>\n<blockquote>\n<p>“I like everything, only the battery stays a<strong> little short, good photos, good video<\/strong>and great performance, it doesn&#8217;t get hot as some say, happy with the purchase, price a bit high…”<\/p>\n<\/blockquote>\n<p>Jose, in a comment dated April 28, 2022, explains:<\/p>\n<blockquote>\n<p>“Mobile is great.  The only &#8220;handicap&#8221; that I see<strong> is that the battery lasts very little<\/strong>.. and if you spend a lot of time working with your mobile, you will hardly get to the end of the day.  On the other hand, it comes with a 120w charger and cable, which makes it charge at high speed in a short time… in about 20min.  approximately you can go from 15% battery to 100% By the way!  To connect wired headphones, they must be with a type C plug (they are not included). The mini jack is a thing of the past!  =)”<\/p>\n<\/blockquote>\n<h2>Similar mobiles<\/h2>\n<p>If you want an alternative to the Xiaomi 12 Pro or are looking for similar phones, there are options that can be a good alternative to this smartphone.  Premium phones that you should take into account and that offer us great cameras, battery and quality screen&#8230;<\/p>\n<p>If you want an alternative to the Xiaomi 12 Pro, the OnePlus 10 Pro is a good option with a price of around 900 euros in a phone developed jointly with Hasselblad for totally premium cameras in a mobile with <strong>spectacular 80W SUPERVOOC fast charging<\/strong> that allows us to have the battery ready in just fifteen minutes and with all kinds of gaming functions that give us fluidity in any situation.<\/p>\n<p>A mobile phone with a 6.6-inch FHD screen of 120 Hz and with resistance to water and dust with IP68 certification.  With a 10-megapixel front camera and three rear cameras: 50-megapixel wide-angle camera, 10-megapixel telephoto camera and 12-megapixel ultra-wide-angle camera in addition to 30x spatial zoom that we can have on the mobile phone.  With 4500 mAh of autonomy and<strong> with super fast charging<\/strong> with up to 69 hours of audio playback.  In addition, a mobile with 128 GB and 256 GB memory options.<\/p>\n<p>A mobile phone that boasts <strong>“futuristic technology housed in a curved body with cosmic tones”<\/strong>.  A premium design in a high-quality screen and with a 50-megapixel main camera accompanied by a 50-megapixel wide-angle camera and a third 13-megapixel telephoto camera.  The Oppo Find X5 boasts a 6.55-inch FHD + AMOLED screen with 120 Hz. Inside, an 8 GB RAM memory accompanied by an internal storage of 256 GB although not expandable with microSD.<\/p>\n<h2>Frequent questions<\/h2>\n<p>What are the most frequent doubts that we can have before buying a Xiaomi 12 Pro?  What are the things we should note about this Xiaomi mobile phone? <strong>Is it WiFi 6 compatible?<\/strong> And does it come with a cover?<\/p>\n<ul>\n<li><strong>Is it WiFi 6 compatible?<\/strong><\/li>\n<\/ul>\n<p>Yes, the Xiaomi 12 Pro is compatible with WiFI 6 networks and also<strong> supports bluetooth 5.2<\/strong> in addition to being a phone compatible with 5G network technology.<\/p>\n<p>Yes, the mobile phone includes a protective case, a USB Type C cable and an adapter, along with the quick start guide and the guarantee card of the mobile.<\/p>\n<ul>\n<li><strong>How long does it take to load?<\/strong><\/li>\n<\/ul>\n<p>The fast charging of the mobile phone allows us <strong>charge 100% in just 18 minutes<\/strong> if we choose the high performance mode.  Or we can charge 100% in 24 minutes if we use the standard mode.  In addition, it has wireless charging that allows us to fully charge without cables in just 42 minutes on the Xiaomi charger.<\/p>\n<ul>\n<li><strong>In what colors can we buy it?<\/strong><\/li>\n<\/ul>\n<p>The phone is available in three colors available in both 12GB RAM version and 8GB RAM version.  We can get it in blue, gray or purple.<\/p>\n<h2>Assessment<\/h2>\n","protected":false},"excerpt":{"rendered":"<p>The best and the worst We have one of the strengths of the Xiaomi 12 Pro just by seeing the phone. AN absolutely premium design, a high-quality mobile that not only promises us power and good photo but it gives us elegance and high quality materials&#8230; It also highlights a brilliant screen of a very [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2591,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2585"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2585"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2585\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2591"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2585"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2585"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2585"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}