{"id":2654,"date":"2022-05-29T03:14:16","date_gmt":"2022-05-29T03:14:16","guid":{"rendered":"https:\/\/why-what-who.com\/only-three-ave-lines-are-profitable-in-the-world-japan-france-and-china\/"},"modified":"2022-05-30T14:47:37","modified_gmt":"2022-05-30T14:47:37","slug":"only-three-ave-lines-are-profitable-in-the-world-japan-france-and-china","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/only-three-ave-lines-are-profitable-in-the-world-japan-france-and-china\/","title":{"rendered":"Only three AVE lines are profitable in the world: Japan, France and China"},"content":{"rendered":"<p>The challenge of making profitable the huge investments in the deployment of an AVE network is common currency to the fifteen countries that have this type of infrastructure in the world.<\/p>\n<p>A Fedea report called <i>International experience in high-speed rail<\/i> points out that only three corridors can be considered profitable: the one that runs between Tokyo and Osaka (the first Japanese AVE in 1964, with 515 km), the one from Paris-Lyon (the one that launched the French network in 1981 with another 409 km) and the one that runs the 362 km between the Chinese cities of Jinan and Qingdao, which was also one of the first in the country.<\/p>\n<p>&#8220;These are enormously dense routes that connect large population centers and in efficient distances in which high speed (AV) enjoys a competitive advantage over air transport and road transport&#8221; point out the authors of the document, Daniel Albalate and Germà Bel . The profitability referred to in the report assumes that the income of each corridor covers the costs of its construction, including financial costs, in addition to operating and maintenance expenses. All this with data from the UIC (International Union of Railways, in its acronym in French).<\/p>\n<h2>And in Spain?<\/h2>\n<p>The analysis of the 2,500 kilometers of AVE network that existed in Spain last September -which will be 3,740 kilometers when the current planning is developed- draws an &#8220;extreme&#8221; panorama, according to the report. It is the largest network in relative terms (and only surpassed in absolute figures by the eleven thousand kilometers of China) but with the lowest demand in the world measured in number of passengers per kilometer of network.<\/p>\n<p>Specifically, and taking into account that the AVE transported some 30 million users in 2014 -from 25.3 million in 2013-, this would mean a ratio of just over 11,000 users per high-speed kilometer. This compares with 61,400 in France or 158,121 in Japan, both with figures from 2012.<\/p>\n<p>Is the opening of AV corridors to private operators the option to increase traffic and get lines into black numbers? The authors examine the main example of the introduction of private competition in a high-speed corridor, the one in Italy that started in 2012.<\/p>\n<p>A company controlled by local partners and in which the French SNCF (the French public operator) also has a 20 percent stake, has managed to gain a quarter of the market and has lowered the minimum prices by up to 30 percent in three years running. Albalate and Bel point to the absence of a systematic analysis that offers more robust results to evaluate this experience.<\/p>\n<h2>The example of Italy<\/h2>\n<p>Other legal sources consulted by <i>the Economist<\/i> They point out that Italy is precisely the example in which Spain should not look to open the Levante corridor to competition, since there are multiple lawsuits due to competition problems between the private company and the public operator.<\/p>\n<p>In a second step are the public-private collaboration projects to build some specific corridors. After examining examples in France, Holland, Taiwan or Spain (the section between Figueres and Perpignan), the authors conclude emphatically that all of them &#8220;have concluded in the failure of the concession&#8221;.<\/p>\n<p>Either due to cost overruns of up to one hundred percent -as in the Dutch case-, or due to non-compliance with traffic forecasts -as in Taiwan or the Franco-Spanish section- or for both reasons. This type of collaboration &#8220;has been exceptional and subject to enormous difficulties.&#8221;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The challenge of making profitable the huge investments in the deployment of an AVE network is common currency to the fifteen countries that have this type of infrastructure in the world. A Fedea report called International experience in high-speed rail points out that only three corridors can be considered profitable: the one that runs between [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2659,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2654"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2654"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2654\/revisions"}],"predecessor-version":[{"id":2836,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2654\/revisions\/2836"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2659"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2654"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2654"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2654"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}