{"id":2668,"date":"2022-05-29T08:42:54","date_gmt":"2022-05-29T08:42:54","guid":{"rendered":"https:\/\/why-what-who.com\/what-are-they-and-how-to-open-this-type-of-files\/"},"modified":"2022-05-30T14:47:17","modified_gmt":"2022-05-30T14:47:17","slug":"what-are-they-and-how-to-open-this-type-of-files","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/what-are-they-and-how-to-open-this-type-of-files\/","title":{"rendered":"What are they and how to open this type of files"},"content":{"rendered":"<p>We may have used them on occasion and we have not realized it, or it may be the first time we come across this type of file and we do not know what they are for and how DOCX files can be opened, something that we are going to talk about next.<\/p>\n<h2>What are DOCX files?<\/h2>\n<p>A DOX file is nothing more than a <strong>text document<\/strong> pertaining to Microsoft Office Word 2007 and later versions on Windows, as well as 2008 and later versions on macOS as a replacement for the .DOC file as the standard format for saving documents in Word.  It differs from DOC files in that they store document data in a single binary file, while DOCX stores data as separate files and folder within a compressed ZIP package.<\/p>\n<p>Within a DOCX file we find files <strong>XML<\/strong> and three folders: <strong>Word<\/strong>, <strong>docProps<\/strong> Y <strong>_rels<\/strong>, where content, document properties, and relationships between files are stored.  This means that these types of files can also be read using earlier versions of Microsoft&#8217;s word processor for Windows and macOS with Open XML document support.<\/p>\n<p>This type of document is characterized by containing formatted text and is characterized by being able to store text, images, graphic tables, styles, drawn objects, along with other elements.  DOCX files are widely used in home, academic, and business settings for letters, resumes, invitations, newsletters, and other documents.<\/p>\n<h2>Open DOCX documents with Microsoft Word<\/h2>\n<p>The main software program used to be able to open DOCX files as well as edit them is Microsoft Word in its version of 2007 and higher for Windows.  If you have an older version of Microsoft&#8217;s word processor, you can download a free Microsoft Office Compatibility Pack with which you can open, edit, and save DOCX files in our older version of Microsoft Word.<\/p>\n<p>In order to use Word, we need to have an active Microsoft 365 subscription, the Microsoft subscription model through which we have the right to use the programs by paying a monthly or annual fee.  Its price is 69 euros per year for a personal account and 99 euros per year for its Family plan.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>Therefore, to open a DOCX document, all you have to do is start the program on your Windows computer.  Afterwards, we click on<strong> File, Archive<\/strong> Y <strong>Open<\/strong>.  Later we click on Browse to open a window with the File Explorer, from where we must search for and select the file that we want to open.<\/p>\n<h2>Other alternatives to open DOCX files<\/h2>\n<p>In the event that we do not have a subscription to Microsoft Office we will not be able to use Word to open DOCX documents.  In this case we can use one of the following alternatives that are free:<\/p>\n<h3>microsoft word online<\/h3>\n<p>In addition to Word offline, we can also use Word online, a Microsoft service that allows us to open DOCX files from our browser, as well as view and edit them.  Although it is much more limited than its desktop version, it is free, so we will only need an Internet connection to access it.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-728244 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653813774_216_what-are-they-and-how-to-open-this-type-of.jpg\" alt=\"Word online open DOCX documents\" width=\"920\" height=\"356\"><\/p>\n<p>For this we only have to access the Office online website and <strong>sign in with our Microsoft account.<\/strong> Then click on Word to start the program and finally click on its section <strong>load and open<\/strong>so that a File Explorer window opens from where we can search and select the document we want to open.<\/p>\n<h3>Google Docs<\/h3>\n<p>We are talking about the online word processor created by Google through which we will be able to open DOCX documents and edit them without having to pay.  Since it is a web-based tool, it does not require the download of any type of software and we will only need a web browser and an Internet connection.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-728229 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653813774_786_what-are-they-and-how-to-open-this-type-of.jpg\" alt=\"Google Docs open DOCX documents\" width=\"920\" height=\"409\"><\/p>\n<p>If we want to use Google Docs to open DOCX files, we just have to access its web page and <strong>sign in with our Google account<\/strong>.  Here we select <strong>Go to Google Docs<\/strong> to bring up your main screen.  Finally, we must click on<strong> Open the file chooser,<\/strong> that is located at the bottom right and that we will recognize by having an icon in the form of a folder.  This will open a new window and click on Upload to be able to add any DOCX file.<\/p>\n<h3>LibreOffice Writer<\/h3>\n<p>Writer is the word processing tool belonging to LibreOffice, a free and open source office suite.  This makes Writer one of the best alternatives to Word to open DOCX documents, since it has full compatibility with the extensions of Office products.  In addition, it is cross-platform so, in addition to Windows, it can also be used on Linux and macOS computers.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-728247 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653813774_218_what-are-they-and-how-to-open-this-type-of.jpg\" alt=\"LibreOffice Writer open DOCX documents\" width=\"920\" height=\"443\"><\/p>\n<p>We can download LibreOffice from its official website for free.  Once downloaded and installed we just have to start <strong>Writer,<\/strong> to open the word processor.  Now, we only have to click on the button<strong> File, Archive<\/strong> Y <strong>Open<\/strong>or press the key combination Ctrl + O. This will open a File Explorer window from where you can browse and open the desired DOCX file.<\/p>\n<h3>WordPad<\/h3>\n<p>By default, Windows has its own word processor, WordPad, so like Office Word, it is also developed by Microsoft.  Although it is a much more modest version, the truth is that it also has compatibility with DOCX files, so we can use it to be able to open them without having to download any other application.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-728226 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653813774_173_what-are-they-and-how-to-open-this-type-of.jpg\" alt=\"WordPad open DOCX documents\" width=\"920\" height=\"481\"><\/p>\n<p>To start this word processor, just type wordpad in the Start menu search box and select it.  Once opened, just click on the tab <strong>File, Archive<\/strong> Y <strong>Open<\/strong>.  This will open a new window with the File Explorer from where we can select the desired DOCX document.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We may have used them on occasion and we have not realized it, or it may be the first time we come across this type of file and we do not know what they are for and how DOCX files can be opened, something that we are going to talk about next. What are DOCX [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2674,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2668"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2668"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2668\/revisions"}],"predecessor-version":[{"id":2833,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2668\/revisions\/2833"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2674"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2668"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2668"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2668"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}