{"id":2675,"date":"2022-05-29T08:44:57","date_gmt":"2022-05-29T08:44:57","guid":{"rendered":"https:\/\/why-what-who.com\/where-to-place-or-install-the-wifi-router-better-speed-and-coverage\/"},"modified":"2022-05-30T14:47:12","modified_gmt":"2022-05-30T14:47:12","slug":"where-to-place-or-install-the-wifi-router-better-speed-and-coverage","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/where-to-place-or-install-the-wifi-router-better-speed-and-coverage\/","title":{"rendered":"Where to place or install the WiFi router: Better speed and coverage"},"content":{"rendered":"<p>Will the speed vary depending on where you install the WiFI router? <strong>There is no one location to have higher or lower speed,<\/strong> but the coverage that reaches the different devices will vary and this will make the speed lower or higher.  If the signal is weak you will not be able to navigate with a good speed.  So you should choose the best possible location to place it and be able to make the most of what you have contracted.  Although there are <strong>recommendations<\/strong> obvious, such as not placing it outdoors or on top of the microwave, there are other tips that you should keep in mind and that will help us to have a better coverage.<\/p>\n<p>When placing the router in our house, the usual thing is that <strong>let us advise<\/strong> by the technician or installer who will tell us which is the best location to have the greatest possible coverage.  But we can also choose ourselves taking into account what is best for your signal to reach everywhere.<\/p>\n<h2>Choose a good location: the router, in the center<\/h2>\n<p>The first thing we must take into account when locating the router is that it is in the center of the house.  Its placement is simple: <strong>as close as possible to the devices or appliances you are going to connect to the Internet.<\/strong> If it is in the center of the house, it will reach all the rooms equally.  But it will depend on the distribution of each home, the plants, the uses you make of the Internet and even what the room is like (it will not be the same to place it in the kitchen as in the living room, as we will see in the next paragraphs and sections) Place it in the center is the general rule, yes, but not the only one.<\/p>\n<p>Being in the center would ensure that it reached everywhere correctly, although <strong>sacrifice excellent coverage<\/strong> in some areas.  Closer, more coverage.  Placing it in the center of the home ensures that there is sufficient coverage to connect to the Internet from the Smart TV but also from the computer if you are going to play online or that sufficient coverage reaches your room to use the mobile before sleeping and that there are no cuts .<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<h2>A new house?  you have PAU<\/h2>\n<p>The new houses have <strong>a PAU or User Access Point<\/strong>.  It is a cabinet or access point where the fiber optic goes to the RITI and where the installer simply connects the pre-installed fiber.  But this implies that the router must necessarily go in the PAU and this is at the entrance of your house.<\/p>\n<p>What happen?  We will be skipping the previous rule:<strong> the entrance will not be the most central point of the house<\/strong> In most cases.  In addition, there is another drawback and that is that we will be enclosing the router with a cover behind a piece of furniture, so the coverage will worsen compared to if we place it “free” in another room.<\/p>\n<p>In this case, one of the best options we can do is to keep the operator&#8217;s router in the PAU at the entrance and use mesh networks or use a secondary router that carries the signal with good coverage to the rest of the rooms.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1631451 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653813897_593_Where-to-place-or-install-the-WiFi-router-Better-speed.jpg\" alt=\"PAU Router\" width=\"1000\" height=\"750\"><\/p>\n<h2>What to take into account?  Your Internet uses<\/h2>\n<p>It will depend on what uses we make of the router that we must choose one location or another.  If you are going to make general use of it, it is advisable that you bet on placing it in the room or the most central location possible, as we have explained in the previous section.  But we are not always going to want the Internet for the same thing and it will vary depending on each house, each user&#8230;<\/p>\n<p>You may want to telework or you want to use the Internet for online gaming and you want to have the router as close as possible to the computer.  In this case, it would be advisable to have it in the room where you are going to work or where you are going to play, although there are always alternatives that allow us to improve the signal or coverage, such as <strong>use a router from your operator as the main router<\/strong> and use a second router as a repeater or signal amplifier right in the place where you are going to connect and where you want the best possible coverage, without cuts. <strong>The signal will reach the entire house by placing it in the center<\/strong> or at the entrance but you will have guaranteed coverage from the room where you are going to use the Internet connection the most.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1432668 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653813897_828_Where-to-place-or-install-the-WiFi-router-Better-speed.jpg\" alt=\"Xiaomi gaming router\" width=\"1000\" height=\"666\"><\/p>\n<h2>No bathrooms or kitchen<\/h2>\n<p>Placing the router in the kitchen can be a temptation if you are concerned about aesthetics or if you do not want it to look ugly in the living room or bedroom.  You may think that the bathroom is a good place because it is in the center of the house and the signal can reach all the rooms better&#8230; Or you may simply place it at the entrance of your house and it coincides with the kitchen&#8230; Is that ok? because we will get the signal everywhere?  No, it&#8217;s not a good idea.<\/p>\n<p><strong>Tiles and tiles in the bathroom<\/strong> <strong>and from the kitchen<\/strong> They harm the signal of your WiFi network, so it is best that we avoid these locations.  In addition, these rooms may have other elements that can make it difficult for the signal to reach everywhere with strength due to installations such as pipes or metal in the walls, which makes the kitchen or bathroom not a good location for the router.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1631388 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653813897_14_Where-to-place-or-install-the-WiFi-router-Better-speed.jpg\" alt=\"cleanliness\" width=\"1000\" height=\"523\"><\/p>\n<p>Another common problem with placing the router in the bathroom or kitchen is that there are other elements that can cause problems.  In the case of bathrooms, we have <strong>Mirrors<\/strong> <strong>or crystals<\/strong> which will make the signal dimmer.  In the case of the kitchen, we will have all kinds of electrical appliances that can cause interference in the network and that will spoil the signal&#8230; The microwave, the refrigerator&#8230;<\/p>\n<h2>Hide the router, good idea?<\/h2>\n<p>According to a 2019 Google study, the most common places where users hide the router is behind a piece of furniture or behind some books.  We hide the device because we consider that it damages aesthetics, that it can be ugly.  According to this study, users also choose to store it inside drawers or bins, inside a closet, inside drawers and boxes&#8230; Should the router be hidden? <strong>It&#8217;s not the best you can do<\/strong> as we may lose coverage.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" class=\"aligncenter\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653813897_915_Where-to-place-or-install-the-WiFi-router-Better-speed.jpg\" alt=\"hide-router-boxes.jpg\"><\/p>\n<p>There are many options to camouflage it but it is advisable that we use a free space.  That the router is on a piece of furniture or that it is not inside any box or drawer. <strong>You can leave it behind a piece of furniture,<\/strong> this being less harmful than introducing it inside baskets or metal boxes, for example.  But we must also keep in mind that hiding or concealing it can cause <strong>overheating<\/strong> and this could cause bigger and avoidable problems.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" class=\"aligncenter\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/Where-to-place-or-install-the-WiFi-router-Better-speed.png\" alt=\"wifi5.max-1000x1000.png\"><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Will the speed vary depending on where you install the WiFI router? There is no one location to have higher or lower speed, but the coverage that reaches the different devices will vary and this will make the speed lower or higher. If the signal is weak you will not be able to navigate with [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2682,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2675"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2675"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2675\/revisions"}],"predecessor-version":[{"id":2832,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2675\/revisions\/2832"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2682"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2675"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2675"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2675"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}