{"id":2706,"date":"2022-05-29T14:39:52","date_gmt":"2022-05-29T14:39:52","guid":{"rendered":"https:\/\/why-what-who.com\/analysis-characteristics-comparison-and-opinion\/"},"modified":"2022-05-29T14:39:52","modified_gmt":"2022-05-29T14:39:52","slug":"analysis-characteristics-comparison-and-opinion","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/analysis-characteristics-comparison-and-opinion\/","title":{"rendered":"Analysis, characteristics, comparison and opinion"},"content":{"rendered":"\n<p>As usual in the high range, the mobile has fast charging and wireless charging and is also compatible with 5G networks, with WiFi 6E, with Bluetooth 5.2&#8230; And it has IP68 certification to protect us from water and dust, in addition to an S- Pen that will allow us to take notes, draw with precision, etc.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<h2>The best and the worst<\/h2>\n<p>Among the main advantages and benefits of this Samsung Galaxy S22 Ultra we have its design and its screen.  The phone has an outstanding construction and in our hands we notice that we have a phone of the highest range, of excellent quality.  In addition, its screen has outstanding quality if we are looking for a good image, brightness&#8230;<\/p>\n<p><strong>The main drawback of the Samsung Galaxy S22 Ultr<\/strong>A is that it is an outstanding phone but not suitable for all pockets because its price exceeds 1,200 euros.  Also, <strong>there are other small inconveniences<\/strong> that can make it not for us as an autonomy that may not be prepared for intense use for a whole day and may fall short.  Also, the performance is not the best compared to other phones in the same range or price range.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1636044 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653835192_817_Analysis-characteristics-comparison-and-opinion.jpg\" alt=\"samsung mobile\" width=\"1077\" height=\"609\"  \/><\/p>\n<h2>Price range<\/h2>\n<p>The Samsung phone is a premium range smartphone that will cost us more than 1,000 euros in any case and in any of its four versions of available storage.  If we take a look at the Samsung website we will see how they all exceed 1,259 euros from the 128 GB + 8 GB version to the 12 GB + 1 TB version with a price of around 1,658 euros.<\/p>\n<p>Can we find it at a discount?  Although the same prices are always offered from the Samsung website, we can see that some of the models have recently dropped on Amazon.  For example, <strong>the free 128 GB model of the Samsung Galaxy S22<\/strong> Ultra was priced at around 1,500 euros in the online store but is currently around 1,200 euros.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1635933 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653835192_285_Analysis-characteristics-comparison-and-opinion.jpg\" alt=\"Samsung Camelcamel\" width=\"1200\" height=\"601\"\/><\/p>\n<h2>In which operators can it be obtained<\/h2>\n<p>We can get the Samsung Galaxy S22 Ultra with different operators whether we want the 256 GB or 512 GB version in both black and red&#8230;<\/p>\n<p>At Movistar we can get the Samsung Galaxy S22 Ultra in its two available versions and financing in twelve, twenty-four, thirty or thirty-six installments without interest.<strong> The total amount of the phone is 1359<\/strong> and the prices start from 37.75 euros per month in the case of choosing 36 installments, but we can also pay it in just one year betting on twelve installments of 113.25 euros per month for the telephone.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1635567 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653835192_565_Analysis-characteristics-comparison-and-opinion.jpg\" alt=\"Samsung Galaxy S22 Ultra\" width=\"1200\" height=\"826\"\/>At Vodafone we can also get the Samsung mobile phone for a spot price of <strong>€1125<\/strong> along with 1.33 euros of digital canon if we bet on portability.  But <strong>we can also have it in installments<\/strong> for a price ranging from 25 euros per month for 36 months and with an initial payment of 225 euros.  Although not currently available<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1635570 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653835192_58_Analysis-characteristics-comparison-and-opinion.jpg\" alt=\"Samsung Galaxy S22 Ultra\" width=\"1200\" height=\"971\"\/><\/p>\n<p>In the case of choosing Orange, we can buy it in cash without a fee or with a fee in installments.  In cash we will get it for 1359 euros without permanence.  If we choose a rate we can get the 256 GB version in 30 installments from 32 euros per month and without initial payment, so the phone <strong>it would cost us about 960 euros.<\/strong><\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1635576 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653835192_558_Analysis-characteristics-comparison-and-opinion.jpg\" alt=\"samsung s22 ultra orange\" width=\"1200\" height=\"530\"\/><\/p>\n<h2>Technical data<\/h2>\n<p>Specifications, technical features and all the details of Samsung&#8217;s premium phone.<\/p>\n<table>\n<tbody>\n<tr>\n<td>Dimensions<\/td>\n<td>163.3&#215;77.9&#215;8.9<\/td>\n<td>with premium design<\/td>\n<\/tr>\n<tr>\n<td>Weight<\/td>\n<td>228 grams<\/td>\n<td>not too light<\/td>\n<\/tr>\n<tr>\n<td>Screen<\/td>\n<td>Dynamic AMOLED 2X<\/td>\n<td>With QUAD HD+ resolution<\/td>\n<\/tr>\n<tr>\n<td>Operating system<\/td>\n<td>MIUI 13 based on Android 12<\/td>\n<td>Updated and many options<\/td>\n<\/tr>\n<tr>\n<td>Processor<\/td>\n<td>Snapdragon 8 Gen 1<\/td>\n<td>An outstanding power<\/td>\n<\/tr>\n<tr>\n<td>RAM<\/td>\n<td>8GB or 12GB<\/td>\n<td>great performance<\/td>\n<\/tr>\n<tr>\n<td>Storage<\/td>\n<td>128GB, 256, 512, or 1TB<\/td>\n<td>storage for everything<\/td>\n<\/tr>\n<tr>\n<td>Drums<\/td>\n<td>5000mAh<\/td>\n<td>With fast and wireless charging<\/td>\n<\/tr>\n<tr>\n<td>main chamber<\/td>\n<td>108 megapixels<\/td>\n<td>High-quality photos and videos<\/td>\n<\/tr>\n<tr>\n<td>secondary camera<\/td>\n<td>10 megapixels<\/td>\n<td>For larger photos<\/td>\n<\/tr>\n<tr>\n<td>other cameras<\/td>\n<td>12 megapixels + 10 megapixels<\/td>\n<td>For detailed photos<\/td>\n<\/tr>\n<tr>\n<td>Frontal camera<\/td>\n<td>40 megapixels<\/td>\n<td>With modes for selfies<\/td>\n<\/tr>\n<tr>\n<td>connectivity<\/td>\n<td>5G, Wi-Fi 6, Bluetooth 5.2<\/td>\n<td>Great speed to navigate<\/td>\n<\/tr>\n<tr>\n<td>ports<\/td>\n<td>USB Type-C \/ Dual Nano SIM<\/td>\n<td>No headphone jack<\/td>\n<\/tr>\n<tr>\n<td>Available colours<\/td>\n<td>Bordeaux, green, black and white<\/td>\n<td>modern and current design<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<h2>ADSLZone review<\/h2>\n<p>The Samsung Galaxy S22 Ultra <strong>it is not a phone for all pockets<\/strong> but it is a more than recommended option if you have a high budget for a new mobile and want to bet on the best, on incredible quality in an outstanding phone that bets on photographic equipment with which you will not miss a professional camera in addition to <strong>an absolutely premium design<\/strong> although perhaps somewhat more square than usual that makes it not as comfortable as other phones.<\/p>\n<p>It is a mobile with which to get it right, without a doubt, beyond some small inconveniences that we have already mentioned, such as that it will not withstand intense use if we want the battery to last all day or that the power is not 10.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1635864 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653835192_45_Analysis-characteristics-comparison-and-opinion.jpg\" alt=\"Samsung Galaxy S22 Ultra (4)\" width=\"930\" height=\"569\"  \/><\/p>\n<h2>User opinion<\/h2>\n<p>If we take a look at the comments on Amazon of the Samsung Galaxy S22 Ultra, we can see that the majority of opinions value the phone with five stars or four stars.  A mobile in which the users of the online store have highlighted aspects com<strong>or the battery, the camera, the fast charge or the performance of the mobile.<\/strong><\/p>\n<p>In a comment by Daniel on March 8, 2022, he indicates:<\/p>\n<blockquote>\n<p>«We have in front of us the best Samsung mobile to date, but honestly it seems to me an excessive price, since for €1359 we have a mobile similar to the previous ones with some small improvement, on top of that we can add that this year comes with the novelty that it does not come with a charger.  We can say that luckily I got an offer in which the phone came with a charger, but the 25w one, much to be desired from this company.  Currently, I think they should improve face recognition, since Apple completely eats up Samsung in this area.  In addition, the fingerprint recognition leaves something to be desired, since when you put on a protector it does not work correctly, they should look for another area…”<\/p>\n<\/blockquote>\n<p>Sergio also talks about a &#8220;bittersweet feeling&#8221; with the Samsung mobile in a comment in March 2022 on the Samsung Galaxy S22 Ultra website.<\/p>\n<blockquote>\n<p>“I have bittersweet feelings, it goes very well and is a great high-end, but it has little things that do not leave me completely satisfied for the price of €1,350.  the fingerprint is slow compared to other brands, if you put a protector on it, forget that you don&#8217;t have to apply your finger more than twice to be recognized.  I notice a lack of coverage at times and on the internet it sometimes gets a bit stuck, having to close the window since <strong>does not let go forward or backwards<\/strong>.  The screen is very good but the color of the icons of the applications themselves are not very bright, the truth is that it leaves me somewhat dissatisfied for the price paid but I have a couple of returns from other mobiles and I don&#8217;t know if Amazon might not like a new change .  It&#8217;s been a while since I&#8217;m satisfied with the high-end prices for what they really give.  It may be because of its exynos processor and that with the 8 gen 1 it goes much better, I don&#8217;t know, but it&#8217;s not something huge either, it&#8217;s a very expensive phone for what it claims to give and then it really gives.  Other than that, highly recommended.”<\/p>\n<\/blockquote>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1636041 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653835192_887_Analysis-characteristics-comparison-and-opinion.jpg\" alt=\"amazon\" width=\"1200\" height=\"562\"\/><\/p>\n<h2>Similar mobiles<\/h2>\n<p>Thinking of alternatives to the Samsung Galaxy S22 Ultra? <strong>There are some similar phones<\/strong> that you can take into account and that are also in the premium range.<\/p>\n<p>The Xiaomi 12 Pro is a quality mobile phone with a set of 50 megapixel cameras if we are looking for one of the best cameras in a smartphone. <strong>A 50 megapixel main camera<\/strong> accompanied by 50 megapixel ultra wide angle and 50 megapixel telephoto lens for an almost unbeatable result.  In addition, a mobile with a premium design and an excellent quality screen.<\/p>\n<p>Oppo also has one of <strong>the best phones on the market<\/strong> and it is the Oppo Find X5 Pro 5G, a mobile that can be among the alternatives to the Samsung Galaxy S22 Ultra.  It boasts “a futuristic technology housed in a curved body with cosmic tones that takes the quality of your photography to new levels”.  With a 50-megapixel main camera accompanied by a 50-megapixel wide-angle camera and a third 13-megapixel telephoto camera.<\/p>\n<p>With a price that is also around 1,200 euros, we can buy the iPhone 13 Pro as one of the best alternatives to the Samsung Galaxy S22 Ultra.  a premium phone <strong>with up to 1TB of storage<\/strong> and with a Super Retina XDR display with ProMotion.  A 6.7-inch OLED screen with IP68 resistance to water and dust.  Inside, the Apple phone packs the A15 Bionic chip inside for power for everything.  And a 12-megapixel Pro camera system with telephoto, wide-angle and ultra-wide-angle plus up to 15X digital zoom.<\/p>\n<h2>Frequent questions<\/h2>\n<p>What are the main questions you may have about the Samsung Galaxy S22 Ultra before buying it?<\/p>\n<p>Samsung&#8217;s phone <strong>has an IP68 certification<\/strong> that ensures protection against dust and fresh water.  The certification indicates that the phone can be submerged in water at depths of up to one meter and for a maximum of 30 minutes.<\/p>\n<ul>\n<li><strong>How long does the battery last?<\/strong><\/li>\n<\/ul>\n<p>The Samsung Galaxy S22 Ultra battery has <strong>an estimated usage time of up to 38 hours talk time<\/strong> according to the brand itself, up to 19 hours of Internet use with 4G or up to 20 hours with WiFi.  In addition, the audio playback time is about 81 hours and the video playback time is up to 22 hours.<\/p>\n<p>Yes, the phone is Dual SIM with a Nano SIM.<\/p>\n<ul>\n<li><strong>What colors is it available in?<\/strong><\/li>\n<\/ul>\n<p>We can get the Samsung Galaxy S22 Ultra in <strong>four different colors<\/strong> which may vary depending on the operator or the country.  We can buy it in white, black, green or burgundy or burgundy.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1635699 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653835192_59_Analysis-characteristics-comparison-and-opinion.jpg\" alt=\"Samsung Galaxy S22 Ultra\" width=\"1200\" height=\"1118\"\/><\/p>\n<h2>Assessment<\/h2>\n","protected":false},"excerpt":{"rendered":"<p>As usual in the high range, the mobile has fast charging and wireless charging and is also compatible with 5G networks, with WiFi 6E, with Bluetooth 5.2&#8230; And it has IP68 certification to protect us from water and dust, in addition to an S- Pen that will allow us to take notes, draw with precision, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2716,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2706"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2706"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2706\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2716"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2706"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2706"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2706"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}