{"id":274,"date":"2022-05-11T12:17:57","date_gmt":"2022-05-11T12:17:57","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/11\/does-libreoffice-include-an-email-client-like-outlook-in-office\/"},"modified":"2022-05-18T15:55:35","modified_gmt":"2022-05-18T15:55:35","slug":"does-libreoffice-include-an-email-client-like-outlook-in-office","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/does-libreoffice-include-an-email-client-like-outlook-in-office\/","title":{"rendered":"Does LibreOffice include an email client like Outlook in Office?"},"content":{"rendered":"<p>When we have to make the decision to use one office suite or another, we look at the programs that the different alternatives include.  Among the most used proposals in this sense we find Office from Microsoft, or the open source project <strong>Libre Office<\/strong>.<\/p>\n<p>There are certain software solutions that could be considered key in this type of suite of programs.  Specifically, we are referring to applications such as a text editor, a title to design our <strong>multimedia presentations<\/strong>another for <strong>spreadsheets<\/strong>, one to create mathematical formulas, etc.  All this allows us to have these quite common applications in office environments, installing a single suite.  Surely many of you already know that the main <strong>difference between Office and LibreOffice <\/strong>is the price.<\/p>\n<p>While for the first we must pay the license or a subscription, the second is an open source project that we can download completely free of charge.  Focusing on these two alternatives, say that some users are looking for programs that they can install on their computer to manage email.  For many years, the software giant&#8217;s proposal has <strong>offers its popular Outlook<\/strong>.  Most likely, most of you are familiar with this application in which we can configure multiple email accounts.<\/p>\n<p>At the same time, it offers us a good number of additional functions to improve the experience with this type of element.  That is why the regulars, or those who want to start using LibreOffice, wonder about the <strong>existence of a mail manager in the open source suite<\/strong>.  Well, we can confirm that this is an office automation proposal that does not have a program for managing email accounts.<\/p>\n<h2>Why LibreOffice does not have an email manager<\/h2>\n<p>First of all, we will tell you that the Open Source proposal that we are talking about is for many the most interesting and reliable alternative to Office of <strong>microsoft<\/strong>.  In addition, with the addition that it is free, which is sure to convince many.  It is compatible with <strong>formats<\/strong> most common that we use in the proposal of the software giant and shares a good number of its functions.  However, we will tell you that among these <strong>we are not going to find any comparable to Outlook<\/strong>.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>While Word, Excel or PowerPoint do have their counterparts in LibreOffice, the same is not true for mail.  In fact, those responsible for this software solution <strong>give us a convincing reason for it<\/strong>.  What&#8217;s more, not only do they lack an email manager right now, but they also have no plans to launch any type of program with these characteristics in the future.  The reason given by the <strong>suite developers<\/strong> it&#8217;s pretty clear.<\/p>\n<p>They argue that right now there are a number of clients that are powerful, functional and reliable enough not to be able to compete with them.  We imagine that they refer to titles that have been with us for a long time such as Outlook or <strong>thunder bird<\/strong>.  On the contrary, they want to focus all their efforts on the development of the rest of the programs that are part of LibreOffice in order to compete in the best way with the rest of the available alternatives.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When we have to make the decision to use one office suite or another, we look at the programs that the different alternatives include. Among the most used proposals in this sense we find Office from Microsoft, or the open source project Libre Office. There are certain software solutions that could be considered key in [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":276,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/274"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=274"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/274\/revisions"}],"predecessor-version":[{"id":895,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/274\/revisions\/895"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/276"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=274"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=274"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=274"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}