{"id":2747,"date":"2022-05-29T16:08:32","date_gmt":"2022-05-29T16:08:32","guid":{"rendered":"https:\/\/why-what-who.com\/this-xiaomi-with-5g-and-120-hz-at-an-unbeatable-price\/"},"modified":"2022-05-30T14:51:02","modified_gmt":"2022-05-30T14:51:02","slug":"this-xiaomi-with-5g-and-120-hz-at-an-unbeatable-price","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/this-xiaomi-with-5g-and-120-hz-at-an-unbeatable-price\/","title":{"rendered":"This Xiaomi with 5G and 120 Hz at an unbeatable price"},"content":{"rendered":"<p>Occasionally opportunities arise that it is highly recommended not to miss.  This is exactly what is happening right now on Amazon, as you can buy a phone <strong>Xiaomi LITTLE<\/strong> with a price rarely seen to date.  And, among other virtues, it has to offer connectivity <strong>5G<\/strong>.<\/p>\n<p>The model we are talking about, which is finished in black and has an attractive design -since it does not lack a small hole in the screen for the camera for selfies and that the frontal use exceeds 85%-, has details as interesting such as offering <strong>protection against water and dust<\/strong> or offering excellent connectivity this Xiaomi POCO F3 where it is not lacking <strong>NFC or Wi-Fi 6<\/strong>.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<h2>This Xiaomi POCO is, above all, very complete<\/h2>\n<p>On the one hand, this is so because the terminal has quite powerful hardware.  An example is that your <strong>RAM is 6GB<\/strong> and, in addition, the processor does not clash because the one used is a <strong>Snapdragon 870<\/strong> with eight cores and a maximum working frequency of up to 3.2 GHz. This ensures that everything you have to do is achieved with excellent fluidity, no matter how demanding it is.  Even the games go like a shot because its GPU is an Adreno 650.<\/p>\n<p>As if this were not enough, it should be noted that the <strong>storage<\/strong> that it includes is type UFS 3.1 to ensure a high speed of work, being its capacity of <strong>128GB<\/strong>.  In other words, you won&#8217;t have to constantly resort to the cloud to save information.  If you are wondering about the screen, very important to achieve the best possible user experience, the manufacturer has made an excellent choice: its panel <strong>AMOLED is 6.67 inches<\/strong> with Full HD + resolution and, apart from that, it has options as striking as the use of a maximum frequency of 120 Hz or a maximum brightness of no less than 1,300 nits.  An atrocity!<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-1689099\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653840512_428_this-Xiaomi-with-5G-and-120-Hz-at-an-unbeatable.jpg\" alt=\"Back of Xiaomi POCO F3 phone\" width=\"1000\" height=\"500\"><\/p>\n<h2>Autonomy and camera: no problems<\/h2>\n<p>In the first case, without offering particularly differential options, this Xiaomi POCO F3 does quite well.  The reason for saying this is that it has a battery of <strong>4,502mAh<\/strong> (which is not bad for a terminal that weighs less than 200 grams and is 7.8 millimeters thick).  In addition, its fast charge is <strong>33W<\/strong>.  Therefore, you will not have any complaints in this section, since the smartphone complies.<\/p>\n<p>If you are wondering about the main camera that integrates this device that uses the Android operating system (with MIUI customization), it must be said that it complies, since, among other things, you can record without problems at 4K quality without the slightest problem.  This is achieved because the combination of sensors is as follows: <strong>48 + 8 + 5MP<\/strong>offering good possibilities when taking photos in low light or if you want to take macro shots.<\/p>\n<p>The truth is that little more can be asked of a phone that right now has a 36% discount on Amazon, which is a quite remarkable amount.  Therefore, if you are thinking of renewing your mobile, you should seriously value this Xiaomi POCO F3, since it has no cracks and it does not lack advanced options such as including <strong>fingerprint reader<\/strong> -in this case mounted on the power button on the side-.<\/p>\n<p>The articles listed contain an affiliate link that reports to ADSLZone a small commission for each purchase.  The products that appear here have been chosen by the editors for being discounted, and their appearance here has nothing to do with any agreement with the brands.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Occasionally opportunities arise that it is highly recommended not to miss. This is exactly what is happening right now on Amazon, as you can buy a phone Xiaomi LITTLE with a price rarely seen to date. And, among other virtues, it has to offer connectivity 5G. The model we are talking about, which is finished [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2750,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2747"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2747"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2747\/revisions"}],"predecessor-version":[{"id":2854,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2747\/revisions\/2854"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2750"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2747"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2747"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2747"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}