{"id":2768,"date":"2022-05-30T06:20:51","date_gmt":"2022-05-30T06:20:51","guid":{"rendered":"https:\/\/why-what-who.com\/cristina-and-alberto-repeat-their-show-until-exhaustion-public-informant\/"},"modified":"2022-05-30T14:50:15","modified_gmt":"2022-05-30T14:50:15","slug":"cristina-and-alberto-repeat-their-show-until-exhaustion-public-informant","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/cristina-and-alberto-repeat-their-show-until-exhaustion-public-informant\/","title":{"rendered":"Cristina and Alberto repeat their show until exhaustion – Public Informant"},"content":{"rendered":"<p><\/p>\n<p>As expected, the very serious inflation in March provided the right climate for a new round of the government internal election to be held. Really, it is difficult to find differences with other previous episodes. The president once again put up with the offending comments from his vice president and, once again, asked his allies for patience because he would make decisions after Easter. Alberto&#8217;s credibility reached a point of no return and no one imagines him asking Wado de Pedro to resign, for example. In reality, the entire crisis is synthesized in the removal or not of Martín Guzmán. The president -according to some of those close to him- would believe that he can save the clothes if Guzmán&#8217;s successor is not a cristinista. On this, he would be negotiating and yesterday&#8217;s media offensive to run for Buenos Aires Production Minister Eduardo Costa would have been a reaction by the hardest Kirchnerists to sabotage any negotiation.<\/p>\n<h4><strong>The perpetuation of the crisis<\/strong><\/h4>\n<p>The substantial difference with the previous episodes is the passage of time. The political erosion of the government is increasingly serious and it is worth wondering if this unstable balance can continue. In fact, if Cristina continues to press and Alberto continues without reacting, the conflict could go on forever until reaching the electoral stage at the end of the year. It is not unthinkable and it remains to be seen if this continues, if Alberto will maintain his intention to be re-elected and if she is consistent with his speech and vetoes it.<\/p>\n<p>We are projecting a future scenario that seems about to explode. But we must remember that when the crisis between the president and the vice president deepened three months ago, all forecasts predicted a brief episode, which did not happen.<\/p>\n<p>The prolongation of the conflict is undoubtedly due to a greater extent to Alberto&#8217;s refusal to exercise power, allowing her to continue to have political centrality. It gives the impression that Guzmán&#8217;s days in government are numbered, which does not mean that the crisis is over.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As expected, the very serious inflation in March provided the right climate for a new round of the government internal election to be held. Really, it is difficult to find differences with other previous episodes. The president once again put up with the offending comments from his vice president and, once again, asked his allies [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2771,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2768"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2768"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2768\/revisions"}],"predecessor-version":[{"id":2846,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2768\/revisions\/2846"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2771"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2768"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2768"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2768"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}