{"id":277,"date":"2022-05-11T12:26:00","date_gmt":"2022-05-11T12:26:00","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/11\/5g-reaches-8-3-gbps-but-it-will-not-do-so-in-spain-yet\/"},"modified":"2022-05-18T15:55:35","modified_gmt":"2022-05-18T15:55:35","slug":"5g-reaches-8-3-gbps-but-it-will-not-do-so-in-spain-yet","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/5g-reaches-8-3-gbps-but-it-will-not-do-so-in-spain-yet\/","title":{"rendered":"5G reaches 8.3 Gbps, but it will not do so in Spain yet"},"content":{"rendered":"<p>Although these days people are already beginning to talk about the future 6G, the truth is that 5G technology still has a lot to say.  Little by little this is beginning to become the standard for various devices that are arriving on the market, something logical if we take into account that it offers <strong>a substantial improvement over 4G<\/strong> both in speed and stability and even in energy consumption.  However, it has yet to finish exploding, which it will do over mmWave connections.<\/p>\n<p>As we say, 5G is beginning to gain notable importance.  Mobile phone manufacturers had 5G earmarked for their higher-end devices a few years ago, but we&#8217;re getting more and more affordable models that have it.  5G networks are beginning to reach more and more places, although at the moment the standard that we can find for this type of connectivity is called <strong>Non Standalone (or NSA)<\/strong>something that, as we will see a little later, is &#8220;weighing down&#8221; the possibilities of 5G.<\/p>\n<h2>A 5G using only mmWave<\/h2>\n<p>Explained very simply, the 5G NSA does not allow this type of network to work autonomously, so <strong>it must be supported by the operation of current 4G networks<\/strong>.  The communication between the mobile and the antenna occurs through the 5G frequencies, but the subsequent communication between antennas uses 4G.  This is because the NSA is a purely transitional standard, and must gradually give way to the so-called <strong>5G Standalone (or SA)<\/strong>.<\/p>\n<p>Companies are gradually experimenting with 5G SA, which uses, among others, mmWave connections.  This high frequency band <strong>will be one of those responsible in the future for an autonomous 5G operation<\/strong>something that will unlock the potential of this type of network.<\/p>\n<p>Qualcomm has become the first company to achieve <strong>a test using a separate mmWave connection<\/strong>.  Thanks to its X70 modem, the company says it has been able to reach <strong>a speed of 8.3 Gbps<\/strong> through the 26 GHz band. This test shows that 5G connections should stop being anchored to 4G technology as soon as possible, but in places like Spain this may still take time to happen.<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1646229\" class=\"wp-caption-text\">8.3 Gbps: 34 seconds to download 120 minutes in 4K (Qualcomm)<\/p>\n<h2>It will still take a while to arrive in Spain<\/h2>\n<p>The 5G networks in our country currently use two different frequency bands.  The first of them, <strong>the 700MHz<\/strong>, was auctioned in Spain among the operators in July 2021, and curiously it was after it became free, since DTT was broadcast through it.  Along with the other <strong>which is the 3,500 MHz<\/strong>we have a 5G network that, as we have explained above, is Non Standalone, that is, it uses the 4G infrastructure.<\/p>\n<p>What is the &#8220;problem&#8221; in Spain for the arrival of the next level of 5G?  As we have explained a little above, for it to work autonomously it is necessary to use a high-frequency band, specifically the 26 GHz band. The point is that this band<strong> has not yet been auctioned among Spanish operators<\/strong>, a process for which we still do not have an approximate date.  When this happens, both this high-frequency band and the previous two will together be responsible for a new reality for 5G across our borders.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Although these days people are already beginning to talk about the future 6G, the truth is that 5G technology still has a lot to say. Little by little this is beginning to become the standard for various devices that are arriving on the market, something logical if we take into account that it offers a [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":279,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/277"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=277"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/277\/revisions"}],"predecessor-version":[{"id":894,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/277\/revisions\/894"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/279"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=277"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=277"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=277"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}