{"id":2772,"date":"2022-05-30T08:48:14","date_gmt":"2022-05-30T08:48:14","guid":{"rendered":"https:\/\/why-what-who.com\/photo-music-and-video-extensions-for-mozilla-firefox\/"},"modified":"2022-05-30T14:50:04","modified_gmt":"2022-05-30T14:50:04","slug":"photo-music-and-video-extensions-for-mozilla-firefox","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/photo-music-and-video-extensions-for-mozilla-firefox\/","title":{"rendered":"Photo, music and video extensions for Mozilla Firefox"},"content":{"rendered":"<p style=\"display: inline-block; width: 100%;\"><\/p>\n<p>We can also pause our favorite background images and search directly in the Unsplash library among more than a million photos. We will can <strong>see basic information of each photo<\/strong>, such as the location, the ISO, the camera model with which it was captured, the shutter speed, among other parameters. In addition, we can see the images of the last ten open tabs and update the current background image with any of them.<\/p>\n<p>We can download and install Stella Photos from the Firefox extensions website.<\/p>\n<h3>Image Picka, download photos in batches<\/h3>\n<p>We are talking about a free and open source extension that will allow us to <strong>download an image with just drag and drop<\/strong> or by pressing Ctrl\/Shift\/Alt + click. We will be able to download all the images that we want in batches, either from the current tab or from the tab on the right. It is possible to filter images based on width, minimum or maximum height, file size, image URL, as well as copy URLs of selected images.<\/p>\n<p style=\"display: inline-block; width: 100%;\"><img class=\"aligncenter wp-image-725646 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653900493_615_Photo-music-and-video-extensions-for-Mozilla-Firefox.jpg\" alt=\"Image Picka\" width=\"900\" height=\"480\" \/><\/p>\n<p>We can also give a custom file name, handle invalid characters in the file name, download from the browser cache, and even transform the URL with find and replace. The plugin works well with most websites, though <strong>with Instagram we can find some problems<\/strong>because it only shows us white squares instead of the images that we can choose and save.<\/p>\n<p>Download Image Picka from the Firefox Browser Add-ons.<\/p>\n<p><img src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/Photo-music-and-video-extensions-for-Mozilla-Firefox.org\/es\/firefox\/addon\/image-picka\/&amp;chs=200x200&amp;chld=L|0.png\" alt=\"Image Picka\" \/> <img src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653900494_864_Photo-music-and-video-extensions-for-Mozilla-Firefox.png\" alt=\"Image Picka\" \/><\/p>\n<h3>Download Image from Context Menu, download photos from the context menu<\/h3>\n<p>By using this plugin we can use the context menu to <strong>download images directly<\/strong> without any notice. This, which seems like something so simple, can be very useful since it will allow us to save several photos at the same time. By simply pressing the Enter key after each save, we will avoid going through the annoying “Save As” message.<\/p>\n<p style=\"display: inline-block; width: 100%;\"><img class=\"aligncenter wp-image-727809 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653900494_899_Photo-music-and-video-extensions-for-Mozilla-Firefox.jpg\" alt=\"Download Image from Context Menu Firefox\" width=\"500\" height=\"845\" \/><\/p>\n<p>In order to use this extension correctly, it is important that we do not have the Strict option established in Firefox&#8217;s privacy options, since this mode interferes with the extension when downloading images that do not have valid file types. However, this does not affect the content of the file and it can be opened if we provide a valid extension.<\/p>\n<p>If we want to use it, all we have to do is download Download Image from Context Menu from the Firefox website.<\/p>\n<p><img src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653900494_425_Photo-music-and-video-extensions-for-Mozilla-Firefox.png\" alt=\"Download Image from Context Menu\" \/><\/p>\n<h2>Extensions to enjoy music<\/h2>\n<p>For music lovers or simply for those who listen to audio from the browser, these extensions for Firefox allow us to improve our experience when playing sound.<\/p>\n<h3>Audio Equalizer, configure the audio you hear through the browser<\/h3>\n<p>It is a complement that will allow us to easily adjust the <strong>audio setup<\/strong> that we want to hear from a toolbar pop-up. In this way we can find the perfect balance between the components of the sound file. For this, we will have several preset settings to be able to choose from a list, such as pop, club, party, rock, among other preset formats.<\/p>\n<p style=\"display: inline-block; width: 100%;\"><img class=\"aligncenter wp-image-725652 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653900494_77_Photo-music-and-video-extensions-for-Mozilla-Firefox.jpg\" alt=\"Sound Equalizer\" width=\"940\" height=\"619\" \/><\/p>\n<p>It is also possible to define our own format to later save it inside the toolbar popup and use it when needed. In addition, it has a reset button through which we will be able to revert all the changes made to the factory settings. For people with hearing problems and who are deaf in one ear, the extension<strong> has a Mono function<\/strong>so you never miss a word or sound when listening to music through headphones.<\/p>\n<p>We can download Audio Equalizer from the Firefox website.<\/p>\n<p><img src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/Photo-music-and-video-extensions-for-Mozilla-Firefox.org\/es\/firefox\/addon\/audio-equalizer-wext\/&amp;chs=200x200&amp;chld=L|0.png\" alt=\"Sound Equalizer\" \/> <img src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653900494_881_Photo-music-and-video-extensions-for-Mozilla-Firefox.png\" alt=\"Sound Equalizer\" \/><\/p>\n<h3>SoundFixer, fix problems with sound volume<\/h3>\n<p>This extension has been conceived to solve any sound problem associated with streaming videos, whether listening to music or audio from different websites, with single channel audio, or too loud or too soft. It is compatible with such popular websites as YouTube, Netflix, Twitch or Amazon Prime, if it can work equally on all websites.<\/p>\n<p style=\"display: inline-block; width: 100%;\"><img class=\"aligncenter wp-image-725655 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653900494_215_Photo-music-and-video-extensions-for-Mozilla-Firefox.jpg\" alt=\"soundfixer\" width=\"900\" height=\"487\" \/><\/p>\n<p>With SoundFixer we will be able to sensibly understand any YouTube video that is recorded with a very low tone of voice and we are not able to listen correctly. And it is that Google&#8217;s video platform usually only uses 30% of the maximum volume, so with this add-on we can play our favorite music at full volume.<\/p>\n<p>SoundFixer is a free add-on that we can download from the Firefox Browser Add-ons.<\/p>\n<p><img src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653900494_457_Photo-music-and-video-extensions-for-Mozilla-Firefox.png\" alt=\"soundfixer\" \/><\/p>\n<h3>600% Sound Volume, increase the volume to the maximum<\/h3>\n<p>We are talking about an extension that is characterized by being a volume amplifier as simple as it is reliable. With it we will be able to increase the volume of a song or any audio up to 600% more than its maximum, being able to easily control the volume from any tab. It has a detailed control that allows<strong> adjust the volume between 0% and 600%<\/strong> and change it in any tab we play audio with one click.<\/p>\n<p style=\"display: inline-block; width: 100%;\"><img class=\"aligncenter wp-image-725667 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653900494_995_Photo-music-and-video-extensions-for-Mozilla-Firefox.jpg\" alt=\"600% Sound Volume\" width=\"700\" height=\"526\" \/><\/p>\n<p>Of course, we must bear in mind that the complement does not work miracles either, because the more we increase the sound of the audio that we are listening to, the more its quality will decrease, although in general terms it is still good and does not distort too much, even at the highest volumes.<\/p>\n<p>If we want to use the 600% Sound Volume extension, we must know that it is free and we can download its latest version available from the Firefox extensions website.<\/p>\n<p><img src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653900494_293_Photo-music-and-video-extensions-for-Mozilla-Firefox.png\" alt=\"600% Sound Volume\" \/><\/p>\n<h2>Add-ons to download videos in Firefox<\/h2>\n<p>If we like to watch videos on the Internet with these extensions, we can download them directly to our hard drive to be able to watch them without having to be connected to the Internet.<\/p>\n<h3>Video DownloadHelper, extract videos from any website<\/h3>\n<p>We are talking about a complete tool to be able to <strong>extract videos from different websites<\/strong> and save them to the hard drive. Every time the plugin detects a video embedded in the website that we are visiting, we can download them by clicking on the icon on the toolbar, which will result in the result, so we only have to click.<\/p>\n<p style=\"display: inline-block; width: 100%;\"><img class=\"aligncenter wp-image-725670 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653900494_798_Photo-music-and-video-extensions-for-Mozilla-Firefox.jpg\" alt=\"Video DownloadHelper\" width=\"853\" height=\"489\" \/><\/p>\n<p>It is compatible with the main video storage pages such as YouTube, Facebook, Twitch, Vimeo, among others. We just have to be careful not to download videos protected by copyright. In addition to downloading, Video DownloadHelper is also capable of converting audio and video files to different formats, as well as combining audio and video separately into a single file.<\/p>\n<p>We can download Video DownloadHelper from the Firefox extensions website.<\/p>\n<p><img src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653900494_917_Photo-music-and-video-extensions-for-Mozilla-Firefox.png\" alt=\"Video DownloadHelper\" \/><\/p>\n<h3>Video Downloader professional, save videos up to 4K<\/h3>\n<p>This extension for Firefox allows us <strong>download and save to our hard drive<\/strong>, any video embedded in a website, being able to support up to 4K resolutions. It is compatible with such popular websites as YouTube and Vimeo, from where it allows us to play videos in any size from the window.<\/p>\n<p style=\"display: inline-block; width: 100%;\"><img class=\"aligncenter wp-image-725673 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653900494_295_Photo-music-and-video-extensions-for-Mozilla-Firefox.jpg\" alt=\"Video Downloader Professional\" width=\"900\" height=\"558\" \/><\/p>\n<p>It also allows us to easily add videos to our video list to have quick access to them whenever we want and can play or download them. Of course, this plugin currently does not support the download of videos protected by the RTMP protocol, so we must use them with videos that do not have copyright.<\/p>\n<p>We can download professional Video Downloader from Firefox.<\/p>\n<p><img src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653900494_16_Photo-music-and-video-extensions-for-Mozilla-Firefox.png\" alt=\"Video Downloader Professional\" \/><\/p>\n<h3>Easy Video Downloader, download audio and video<\/h3>\n<p>We are talking about a complement that allows us<strong> download both audio and video<\/strong> as it works with its own internal and external download manager like IDM or Wget. We simply have to visit a website and press its button located on the toolbar, so that all the available audio and video sources are listed. We press what we want to download and start downloading it.<\/p>\n<p style=\"display: inline-block; width: 100%;\"><img class=\"aligncenter wp-image-725679 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653900494_230_Photo-music-and-video-extensions-for-Mozilla-Firefox.jpg\" alt=\"Easy Video Downloader\" width=\"700\" height=\"438\" \/><\/p>\n<p>It also makes other features available to us, such as the ability to track the information of any image by simply clicking the right button on the toolbar. Also, we can interrupt the download at any time and copy the download links to the clipboard.<\/p>\n<p>Download Easy Video Downloader from the Firefox website.<\/p>\n<p><img src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1653900494_498_Photo-music-and-video-extensions-for-Mozilla-Firefox.png\" alt=\"Easy Video Downloader (Flash and Video)\" \/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>We can also pause our favorite background images and search directly in the Unsplash library among more than a million photos. We will can see basic information of each photo, such as the location, the ISO, the camera model with which it was captured, the shutter speed, among other parameters. In addition, we can see [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2800,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2772"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=2772"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2772\/revisions"}],"predecessor-version":[{"id":2845,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/2772\/revisions\/2845"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/2800"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=2772"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=2772"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=2772"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}