{"id":32,"date":"2022-05-04T16:02:56","date_gmt":"2022-05-04T16:02:56","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/04\/do-you-think-of-an-electric-van-these-are-the-5-that-you-should-take-into-account\/"},"modified":"2022-05-18T15:50:57","modified_gmt":"2022-05-18T15:50:57","slug":"do-you-think-of-an-electric-van-these-are-the-5-that-you-should-take-into-account","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/do-you-think-of-an-electric-van-these-are-the-5-that-you-should-take-into-account\/","title":{"rendered":"Do you think of an electric van?  These are the 5 that you should take into account"},"content":{"rendered":"<h2>The electric truck also has weight in the market<\/h2>\n<p>In the market it is increasingly common to find different types of vehicles, especially now that we have so many classes to choose from.  Thus, it is not new or strange that we can have serious doubts to choose the most appropriate or, failing that, the one that may interest us the most.  That is why we now also have the kind of <strong>electric pickup<\/strong>.<\/p>\n<p>A consideration within mobility that is completely complete for drivers, especially for those who are more into mountain tours or simply looking for a <strong>own style<\/strong> because of its large size.  For this reason, and with references as important as the Tesla Cybertruck, there are models for all tastes.<\/p>\n<p>However, it is also true that, together with vans, also increasingly popular, this class of car is still <strong>walk in short steps<\/strong> regarding its expansion within the market.  For this reason, and to be safer, we are going to show you a series of electric trucks that you can pay attention to for your maximum interest.<\/p>\n<h2>What confirmed models are there?<\/h2>\n<p>And it is that at present there are several companies that have unveiled their future prototypes in terms of electric pick-ups, which include a very important load of power, torque and, of course, very daring designs.  In fact, the aforementioned Tesla Cybertruck (coming soon) is seen as the big idea, even more so for its great technological and design features.<\/p>\n<p>In order not to get lost among so many models, prototypes and vehicles already confirmed, here we leave you some models that are in <strong>development process<\/strong> and, in theory, a few months from reaching the market (at most, in one or two years to it).<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<h3>Tesla Cybertruck<\/h3>\n<p>The first electric truck on this list is the proposal from Elon Musk&#8217;s company and which, for many, is the <strong>most controversial model<\/strong>.  It should be remembered that the official presentation was not entirely successful, due to the fact that several unforeseen events occurred, among them, and perhaps the most notorious was that of the &#8220;unbreakable&#8221; windows that did break.<\/p>\n<p>As such, your <strong>bold design<\/strong>its announced qualities of autonomy and the incorporation of a quad to the equipment with which you can order this truck, are undoubtedly points to take into account for its launch.<\/p>\n<p>Honoring the rest of the brand&#8217;s models, such as the Tesla Model S or the Tesla Model X, the Cybertruck will be available with different propulsion systems, batteries and autonomies.  There are three different options of 400, 480 and 800 km of autonomy.  As has been known through Tesla itself, its arrival is scheduled for the <strong>year 2023<\/strong> for a price that will be around 39,000 euros.<\/p>\n<h3>Nikola Badger<\/h3>\n<p>A small step behind Tesla&#8217;s Cybertruck, but far ahead of others, is the Nikola Badger electric truck, which is the first to dispense with recharging electricity in favor of equipping a <strong>hydrogen tank<\/strong> act as a fuel cell.<\/p>\n<p>Or what is the same;  It is a hydrogen vehicle, FCEV, which is committed to this gas as a fuel that generates the electricity necessary to move this great proposal.  He does it with a <strong>autonomy of 483 kilometers<\/strong>.  counting on a 160 kWh lithium-ion battery.  A version adding a 120 kWh hydrogen fuel cell will also be available, doubling the range to 966 km.  Initially it was scheduled for 2024, but its date is not yet fully set.<\/p>\n<h3>GM Hummer EV<\/h3>\n<p>General Motors wanted to enter the race for the electrification of pick-ups in a big way and for that it decided to revive the iconic Hummer, a powerful off-roader with military DNA (Humvee) that was born in the early 1990s as a GM brand .<\/p>\n<p>For this reason, now the American manufacturer is bringing it back to life as a zero-emission electric truck and as the spearhead of its future electric range.  With 756 kW of power (1014 CV), this 4×4 convertible has been defined as a monster on the road and off it, with a range per charge greater than <strong>560km<\/strong>.<\/p>\n<p>Everything indicates that this model should see the light at the end of this year and its entry price is expected to be around 60,000 euros.  Likewise, and for what will be the cheapest versions, as well as an SUV, they will only arrive in 2023.<\/p>\n<h3>Rivian R1T<\/h3>\n<p>Another striking model in the market for these vehicles is the Rivian R1T, an electric truck that has been around the market for several years and that earned its manufacturer the attention of Ford to develop electric vehicles based on its platform.<\/p>\n<p>The Rivian R1T boasts, above all, its <strong>559 kW<\/strong> (750 CV of power) that are sent directly to the four wheels of the vehicle, allowing a high load capacity.  Likewise, an evolution is planned for the year 2023 with a price item of between 40,000 and 50,000 euros.<\/p>\n<h3>2022 Ford F-150 Lighting<\/h3>\n<p>Ford&#8217;s F-150 has traditionally been America&#8217;s best-selling truck, and the company is hopeful that success will be repeated with the all-electric 2022 Lightning version, coming to the United States in mid-2022. to Europe will take time to present) with a variety of options.​<\/p>\n<p>The standout feature of the electric F-150 is that it resembles the classic model of this truck.  The Ford brand, in its case, explains that the EV F-150 will travel around 500 km with the <strong>extended battery option<\/strong> no need to recharge.  Its price will be around 40,000 dollars.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The electric truck also has weight in the market In the market it is increasingly common to find different types of vehicles, especially now that we have so many classes to choose from. Thus, it is not new or strange that we can have serious doubts to choose the most appropriate or, failing that, the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":34,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/32"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=32"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/32\/revisions"}],"predecessor-version":[{"id":853,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/32\/revisions\/853"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/34"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=32"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=32"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=32"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}