{"id":35,"date":"2022-05-04T16:35:56","date_gmt":"2022-05-04T16:35:56","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/04\/this-bleachbit-feature-prevents-them-from-recovering-your-deleted-files\/"},"modified":"2022-05-18T15:50:57","modified_gmt":"2022-05-18T15:50:57","slug":"this-bleachbit-feature-prevents-them-from-recovering-your-deleted-files","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/this-bleachbit-feature-prevents-them-from-recovering-your-deleted-files\/","title":{"rendered":"This BleachBit feature prevents them from recovering your deleted files"},"content":{"rendered":"<p>The disk drives that we have installed in our computer have a limited capacity, that is obvious.  That is why in one way or another we must try to free up space from time to time so as not to run into problems in the future.  This is something that we can carry out manually or with the help of programs such as <strong>BleachBit<\/strong>.<\/p>\n<p>And it is that for those of you who do not know, some software developers launch their own projects that are responsible for helping us in the <strong>Microsoft system maintenance<\/strong>.  One of the most common movements in this regard is to free up space on the disk drives <strong>deleting unnecessary files and data<\/strong>.  As we mentioned before, this is something that we can carry out manually, but it can be a somewhat complex task.  On the other hand, and in order to facilitate this type of task, we can opt to use a specific program.<\/p>\n<p>Here we find both paid and free applications and one of the best known is BleachBit.  This is a solution that we can benefit from and that offers us excellent functionality, all without spending a single euro.  We have an installable version and a portable version for <strong>clean our Windows computer<\/strong> of useless data.  To say that on many occasions we will even be able to release several gigabytes, which will always be appreciated.  But in parallel, it offers us some very interesting additional functions, such as the integrated feature that we will talk about next.<\/p>\n<p>Specifically, we refer to a function that allows us to <strong>permanently delete files that we have deleted <\/strong>in a conventional way.<\/p>\n<h2>Avoid recovery of deleted files from BleachBit<\/h2>\n<p>We must bear in mind that, by default when <strong>delete a file or folder <\/strong>on Windows, this content is not permanently deleted.  This means that other users and with specific programs for it, could recover those files that were initially deleted.  This can be a serious problem in the event that we are going to <strong>sell or give away that PC<\/strong> to another person, known or not.  But to make sure, by doing a file cleanup with BleachBit, we can make sure that everything deleted is unrecoverable.<\/p>\n<p>All this thanks to a function that its developers present to us.  Therefore, below, we are going to show you the easiest way to benefit from this functionality and thus not take risks.  Once we have the program running we will have to access its configuration through the button that is located in the upper left corner.  In the drop-down list that appears, we opt for the option of <strong>preferences<\/strong>.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>In the tab called Generals we are going to find several selectors that will allow us to <strong>customize how the program works<\/strong>.  For what concerns us in this particular case, we locate the entry called <strong>Overwrite file content to prevent recovery<\/strong>.  In this way, BleachBit automatically performs several writes on a file that we have marked for cleaning and so on. <strong>cannot be retrieved in the future<\/strong>.<\/p>\n<p>The only thing we need to keep in mind in this case is that the process of deleting unnecessary files and folders might increase slightly.  However, if this computer or drive is going to change hands, it&#8217;s an inconvenience that we should take for security and privacy reasons.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The disk drives that we have installed in our computer have a limited capacity, that is obvious. That is why in one way or another we must try to free up space from time to time so as not to run into problems in the future. This is something that we can carry out manually [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":37,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/35"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=35"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/35\/revisions"}],"predecessor-version":[{"id":852,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/35\/revisions\/852"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/37"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=35"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=35"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=35"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}