{"id":350,"date":"2022-05-11T14:22:57","date_gmt":"2022-05-11T14:22:57","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/11\/you-will-not-believe-it-these-programs-are-created-in-c\/"},"modified":"2022-05-18T15:55:35","modified_gmt":"2022-05-18T15:55:35","slug":"you-will-not-believe-it-these-programs-are-created-in-c","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/you-will-not-believe-it-these-programs-are-created-in-c\/","title":{"rendered":"You will not believe it, these programs are created in C++"},"content":{"rendered":"<p>Parallel to what happens with the hardware of our computers, technological advances also reach the installed software.  A good part of all this is given by the advanced development platforms and programming languages ​​that we have today.  But we cannot leave aside some veteran elements that are still very important in this regard, as is the case with <strong>C++<\/strong>.<\/p>\n<p>More and more users are participating, thanks to their knowledge of programming, in all kinds of <strong>open source applications<\/strong>.  And it is that this is a growing community and in which the participants are increasing contributing their grain of sand.  In this way we have projects that are increasingly powerful and advanced, as well as safe.  Something similar happens with all those who start developing their own projects from scratch.<\/p>\n<p>Here we refer to elements such as applications belonging to all kinds of software sectors, or even <strong>games<\/strong>.  Before we have mentioned one of the most important programming languages ​​of recent decades.  We refer specifically to C++, which despite the years it has been with us, still has a <strong>enormous importance in current projects<\/strong>.  We say all this because there are programs that we use on a daily basis right now and that, believe it or not, were developed based on this language.<\/p>\n<p>It is true that at the moment we have some very useful platforms that allow us to <strong>develop software virtually without typing a single line of code<\/strong>.  But many prefer to have maximum control over their projects, for which some technical knowledge is necessary.  Precisely for all this that we tell you below we are going to mention some of the <strong>well-known applications developed in this environment<\/strong>.<\/p>\n<h2>Popular programs developed in C++<\/h2>\n<p>We must bear in mind that we are dealing with a programming language that was initially <strong>created in 1979<\/strong>.  It must be said that initially this project was carried out to extend the popular C. Here we are referring to an object-oriented language that has been improving over time and is still used regularly today.  Therefore, and as you can imagine, its importance in the development sector remains high.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>Some applications that are more than known and used throughout the world and that are still in force today, are based on this specific programming language.  Some of the titles featured here may surprise you considering the year this development environment was released.  These are some thanks <strong>popular applications developed in C++<\/strong>:<\/p>\n<ul>\n<li>Adobe <strong>Flash<\/strong>.<\/li>\n<li>BitTorrent.<\/li>\n<li>Adobe <strong>Dreamweavers<\/strong>.<\/li>\n<li>Opera.<\/li>\n<li>Mp3Tag.<\/li>\n<li>Adobe <strong>Photoshop<\/strong>.<\/li>\n<li>Free Download Manager.<\/li>\n<li>Google <strong>Chrome<\/strong>.<\/li>\n<li>microsoft <strong>Edge<\/strong>.<\/li>\n<li>BitComet.<\/li>\n<li><strong>uTorrent<\/strong>.<\/li>\n<li>Haiku.<\/li>\n<li>Adobe Illustrator.<\/li>\n<\/ul>\n<p>As you will see, in this list we find an operating system such as Haiku, or browsers as widespread and used as Edge and <strong>Google Chrome<\/strong>.  It also draws attention to some of the clients for downloading <strong>torrent files<\/strong> most popular right now.  In addition, in the same way, we find some of the most important and well-known applications of the software giant, Adobe, such as Photoshop, the disappeared Flash, or Dreamweaver.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Parallel to what happens with the hardware of our computers, technological advances also reach the installed software. A good part of all this is given by the advanced development platforms and programming languages ​​that we have today. But we cannot leave aside some veteran elements that are still very important in this regard, as is [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":352,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/350"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=350"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/350\/revisions"}],"predecessor-version":[{"id":889,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/350\/revisions\/889"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/352"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=350"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=350"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=350"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}