{"id":370,"date":"2022-05-11T15:25:26","date_gmt":"2022-05-11T15:25:26","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/11\/update-windows-now-new-patches-fix-20-critical-bugs\/"},"modified":"2022-05-18T15:55:35","modified_gmt":"2022-05-18T15:55:35","slug":"update-windows-now-new-patches-fix-20-critical-bugs","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/update-windows-now-new-patches-fix-20-critical-bugs\/","title":{"rendered":"Update Windows now!  New patches fix 20 critical bugs"},"content":{"rendered":"<p>Keeping our operating system updated is key to making this software as secure as possible.  It is something that Microsoft already takes care of with <strong>Windows<\/strong>in part thanks to the updates that it sends us monthly correcting the latest vulnerabilities discovered, as is the case.<\/p>\n<p>Right now we are at that time of the month in which the firm sends the latest security patches to the <strong>versions of Windows that are still supported<\/strong>.  We must bear in mind that our computers increasingly store a greater amount of personal and sensitive data, so we must protect them at all costs.  In addition to the antivirus that most of us have installed on the computer, we must keep the operating system and all the software conveniently updated.<\/p>\n<p>We&#8217;ve just reached Microsoft&#8217;s already popular Update Tuesday where it ships out the latest security patches monthly.  Installing them is always important, even more so if we take into consideration that, for example, this month of <strong>May 2022<\/strong> are corrected until <strong>20 critical failures<\/strong> on Windows.<\/p>\n<h2>Vulnerabilities fixed by Microsoft in Windows<\/h2>\n<p>To give a clear example of all this, we discount, first of all, we will focus on the latest versions of Windows 10 available.  We refer to the <strong>20H2, 21H1 and 21H2<\/strong> in which a total of 44 vulnerabilities are corrected, 4 critical and another 40 important.  But that&#8217;s not all, but also these security patches update important components of the operating system such as <strong>Office<\/strong>.Net <strong>VisualStudio<\/strong>.<\/p>\n<p>It is worth mentioning that these versions of the system receive the KB5013942 update that also fixes an issue that shows a black screen for some users when logging in or out.  Some solutions for the cloud storage platform are also included. <strong>OneDrive<\/strong>or the sudden appearance of <strong>News and interests<\/strong>.  Also fixes a bug that prevents changing an expired password when logging into Windows.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>For their part, Windows 11 users also receive the KB5013943 update to correct the latest <strong>vulnerabilities and security flaws detected<\/strong>.  Due to all this that we tell you from Microsoft, they encourage us to update the versions of Windows that are still supported as soon as possible.  Next, we will help you to carry this out in the fastest and easiest way.<\/p>\n<h2>How to update the different versions of the operating system<\/h2>\n<p>The first thing we must take into consideration is that, as a general rule, these security patches should reach us automatically through the Windows Update application.  To do this, we only have to go to the configuration application through the Win + I key combination. Here it is enough that we go to the section of <strong>Update and security<\/strong> to receive these patches automatically.  In this way, what we achieve is to be completely protected when using our Microsoft operating system.<\/p>\n<p>However, it may be the case that we have some problems when receiving these updates by themselves.  That is why we are going to give you the solution below and thus be able to <strong>download these security patches manually<\/strong> from the official Microsoft catalog:<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Keeping our operating system updated is key to making this software as secure as possible. It is something that Microsoft already takes care of with Windowsin part thanks to the updates that it sends us monthly correcting the latest vulnerabilities discovered, as is the case. Right now we are at that time of the month [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":372,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/370"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=370"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/370\/revisions"}],"predecessor-version":[{"id":885,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/370\/revisions\/885"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/372"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=370"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=370"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=370"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}