{"id":373,"date":"2022-05-11T16:07:47","date_gmt":"2022-05-11T16:07:47","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/11\/how-to-learn-programming-from-scratch\/"},"modified":"2022-05-18T15:57:30","modified_gmt":"2022-05-18T15:57:30","slug":"how-to-learn-programming-from-scratch","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/how-to-learn-programming-from-scratch\/","title":{"rendered":"How to learn programming from scratch"},"content":{"rendered":"<p>The first and most important thing that we must take into account to learn to program is that <strong>there is no one way to do it<\/strong>.  We can find several types of programming language that are very different from each other, and that, as is logical, fulfill different functions.  Hence, before starting, we are aware that to learn any programming language it is essential that we know some basic general notions.<\/p>\n<h2>What things must be taken into account when programming<\/h2>\n<p>You must bear in mind that there is no secret method that will teach you programming from one day to the next, but if you learn about the following concepts, you will begin to have a very good base to start programming.  Below, we will detail some key points to consider during the process.<\/p>\n<ul>\n<li><strong>The importance of algorithms<\/strong><\/li>\n<\/ul>\n<p>Programming, regardless of the language we use, <strong>is always based on problem solving through algorithms<\/strong>.  The algorithms are what a recipe would be for a cook, and the programming language would be equivalent to the kitchen utensils necessary to carry out the recipe.<\/p>\n<ul>\n<li><strong>Know the basics<\/strong><\/li>\n<\/ul>\n<p>As with algorithms, there are a number of basic concepts that are also common to all programming languages ​​today.  Elements such as cycles, control structures, data types or functions, among others, <strong>are shared by all languages<\/strong> and if we learn them first, we will already have these concepts assimilated to use them with any programming language.<\/p>\n<ul>\n<li><strong>Take courses for beginners<\/strong><\/li>\n<\/ul>\n<p>Another very interesting point to keep in mind is that it is very difficult to program without any type of reference to look at.  Even if we get some kind of book or programming manual, it is always better <strong>attend some kind of course<\/strong> so that we receive a much more practical training and even with explanatory examples.<\/p>\n<ul>\n<li><strong>Always start with simple codes<\/strong><\/li>\n<\/ul>\n<p>Once you begin to gain fluency and know the first steps to start programming, you may feel the &#8220;temptation&#8221; to start writing complicated codes.  This can lead to unnecessary frustration, so we recommend that you <strong>your first codes always be simple<\/strong>.<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1646037\" class=\"wp-caption-text\">Python is one of the most used programming languages ​​(Pexels)<\/p>\n<ul>\n<li><strong>Choose the programming language that best suits you<\/strong><\/li>\n<\/ul>\n<p>Finally, another very important point to start programming is to choose a specific programming language.  We have already told you that all languages ​​have a series of points in common, but <strong>each language has a specific use<\/strong> That should make us opt for one or the other.<\/p>\n<h2>The internet is full of free courses<\/h2>\n<p>Although there are many programming schools, the truth is that the Internet is full of websites to learn programming from home.  A very interesting place that we can visit to learn to program with any programming language is the edx.org portal.  This website puts at our disposal <strong>a gigantic amount of totally free courses<\/strong> so we can learn from scratch, whether in Python, Java or HTML.<\/p>\n<p>Another portal very similar to the previous one is Coursera.  This platform also gives us access to a wide variety of courses for all programming languages, including <strong>a good selection of them in Spanish<\/strong>.  If we don&#8217;t mind learning in English, it is true that on this website we will have even more options to choose the course that best suits our needs.  On the other hand, if we want a more direct and visual option, we can always go to a YouTube channel, such as Start Programming.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The first and most important thing that we must take into account to learn to program is that there is no one way to do it. We can find several types of programming language that are very different from each other, and that, as is logical, fulfill different functions. Hence, before starting, we are aware [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":375,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/373"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=373"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/373\/revisions"}],"predecessor-version":[{"id":930,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/373\/revisions\/930"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/375"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=373"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=373"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=373"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}