{"id":38,"date":"2022-05-05T06:28:35","date_gmt":"2022-05-05T06:28:35","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/05\/samsungs-new-qled-tvs-will-charge-their-controls-with-wifi\/"},"modified":"2022-05-18T15:50:57","modified_gmt":"2022-05-18T15:50:57","slug":"samsungs-new-qled-tvs-will-charge-their-controls-with-wifi","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/samsungs-new-qled-tvs-will-charge-their-controls-with-wifi\/","title":{"rendered":"Samsung&#8217;s new QLED TVs will charge their controls with WiFi"},"content":{"rendered":"\n<p>A great example is the <strong>new remote called SolarCell Remote<\/strong>.  This will allow energy to be obtained from sunlight sources, as well as from certain 2.4 GHz radio frequencies, such as WiFi.  In this way, you will not need to resort to batteries, but it will be resources already available in your home that will charge the controller.<\/p>\n<p>SolarCell Remote is battery-free and can be charged via 2.4 GHz radio frequency harvesting, drawing power from the <strong>spare power emitted by Wi-Fi routers<\/strong>.  In case of emergency, you can connect it to the power via USB type C. This SolarCell, in addition to greater sustainability, is also 88% more efficient than previous 2020 models.<\/p>\n<p>Both this and the rest of the Samsung 2022 product lineup will feature updated packaging that uses 90% less ink and eliminates all metal staples.  Samsung 2022 TVs, monitors, digital signage and remote controls are made from recycled resin.  Additionally, Samsung&#8217;s Neo QLED 8K and 4K TVs have achieved the Carbon Trust&#8217;s &#8216;Reducing CO2&#8217; label, proving that the carbon footprint of the Neo QLED range is shrinking year on year.<\/p>\n<h2><strong>New Samsung Neo QLED 8K 2022<\/strong><\/h2>\n<p>The South Korean company has presented the <strong>new Neo QLED Smart TVs<\/strong> 8K resolution (7,680 × 4,320 pixels).  This 2022 range aims to cover a wide range of potential customers, in line with the company&#8217;s vision of &#8220;Screens Everywhere, Screens for All&#8221;.<\/p>\n<p>In 2022, Samsung introduces new technologies that drive seamless connectivity across multiple devices, with<strong> TVs and displays as the central hub for the connected lifestyle<\/strong>.<\/p>\n<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"es\" dir=\"ltr\">Presentation of the Neo QLED 8K range with #DolbyAtmos from @SamsungEspana.  “The integration of Dolby Atmos in Samsung products is brilliant” @guillermo_nino pic.twitter.com\/fs3L8LJwfG<\/p>\n<p>– Dolby Spain (@Dolby_Spain) May 4, 2022<\/p>\n<\/blockquote>\n<p>Samsung Neo QLED 8K features Quantum Mini LED technology along with the <strong>next-generation Quantum 8K Neural Processor<\/strong>.  These Smart TVs have 20 extended neural networks, more accurate 14-bit contrast mapping, and intelligent AI-powered picture scaling capabilities, enabling the displays to deliver the most accurate color and picture quality to date.<\/p>\n<p>The evolution of Neo QLED comes with Quantum Matrix Technology, which precisely controls the exclusive new Quantum Mini LED.  With precise light control, you can enjoy great detail in both the darkest and brightest scenes.<\/p>\n<p>The new series of televisions from the manufacturer will have a new version of Samsung&#8217;s Smart Hub, with an improved content search experience and intelligent functions with compatibility with the main voice assistants.  As we said, they want the TV to be the center of the connected lifestyle experience.<\/p>\n<p>Besides, <strong>they have gaming in their sights<\/strong>.  These televisions provide an expanded and enhanced gaming experience.  The new 2022 Neo QLED lineup also comes packed with specs and features for the ultimate gamer experience, such as HDMI 2.1-compatible ports, Motion Xcelerator Turbo Pro 4K gaming up to 144Hz, widescreen Game View, and new Game Bar, making games more efficient and accessible for a dynamic and optimized experience.<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1626894\" class=\"wp-caption-text\">Samsung Neo QLED 8K<\/p>\n<p>this new <strong>Game Bar 2.0<\/strong> It will allow you to choose between video game genres so that the television automatically optimizes the tonality and framerate.  In addition, they have an almost non-existent input lag to eliminate all latency as much as possible.<\/p>\n<p>The Samsung Neo QLED 8K comprise 3 different models, QN900B (85\/75\/65 inches), QN800B (85\/75\/65 inches) and QN700B (85\/75\/65 inches), with prices starting at 2,799 euros and up to 9,999 euros.  Of course, there will also be new models still in 4K resolution: three models, QN95B (85\/75\/65\/55 inches), QN90B (85\/75\/65\/55\/50\/43 inches) and QN85B (85\/75\/65 \/55 inches), with prices from 1,499 euros to 5,999 euros.<\/p>\n<p> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script><\/p>\n","protected":false},"excerpt":{"rendered":"<p>A great example is the new remote called SolarCell Remote. This will allow energy to be obtained from sunlight sources, as well as from certain 2.4 GHz radio frequencies, such as WiFi. In this way, you will not need to resort to batteries, but it will be resources already available in your home that will [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":40,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/38"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=38"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/38\/revisions"}],"predecessor-version":[{"id":851,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/38\/revisions\/851"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/40"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=38"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=38"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=38"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}