{"id":390,"date":"2022-05-11T17:32:28","date_gmt":"2022-05-11T17:32:28","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/11\/how-to-type-on-mobile-from-a-windows-pc\/"},"modified":"2022-05-18T15:57:30","modified_gmt":"2022-05-18T15:57:30","slug":"how-to-type-on-mobile-from-a-windows-pc","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/how-to-type-on-mobile-from-a-windows-pc\/","title":{"rendered":"How to type on mobile from a Windows PC"},"content":{"rendered":"<p>Fortunately, it is easy to access our mobile directly from the PC, through different third-party programs.  In this way we can carry out different operations such as accessing notifications, writing messages, sharing photos and other files or making calls.  Next, we are going to see what are the best options to be able to control our mobile and be able to write using the computer.<\/p>\n<h2>AirDroid, control the mobile from a desktop<\/h2>\n<p>It is an application that gives us access to most of the most important functions that we can carry out with the mobile, but from the computer.  The service has a<strong> free version<\/strong>, as well as apps for both Windows and macOS.  Although, we can also use any web browser to use it easily.  For this it will be necessary that both the PC and the mobile are connected to the same network.<\/p>\n<p>To begin, the first thing we must do is download AirDroid on our mobile, accepting those requests for permissions that it requests.  We must also open our preferred browser on the PC and write<strong> web.airdroid.com<\/strong> in the address bar or simply click on this link.<\/p>\n<p>Once installed on the phone, we can register and log in.  Now on the main screen, click on the Scan icon that we find at the top of the screen next to AirDroid web and <strong>we scan the QR code<\/strong> that appears in the browser and we are done, we will be connected and we will be able to access the functions of our mobile from the PC browser.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>The program&#8217;s web interface is similar to that of a desktop, where we can see the available functions on the left, as well as tools and information about our phone on the right.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-726348 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652290348_650_How-to-type-on-mobile-from-a-Windows-PC.jpg\" alt=\"AirDrop web interface\" width=\"920\" height=\"409\"  \/><\/p>\n<p>In order to carry out any action, it will be necessary<strong> grant the relevant permissions<\/strong> from the “Me and Security” and “Remote features” section.  We can use the camera, duplicate the screen, write messages, access our contacts, etc, as long as we grant the necessary permissions so that it is enabled in <strong>On<\/strong>.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-726339 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652290348_780_How-to-type-on-mobile-from-a-Windows-PC.jpg\" alt=\"AirDroip mobile permissions\" width=\"700\" height=\"1200\"\/><\/p>\n<p>The only limitation that we will find is that <strong>not compatible with third-party apps<\/strong>but we can make calls, write SMS, access our photos, videos and music, set an alarm, etc.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-726342 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652290348_908_How-to-type-on-mobile-from-a-Windows-PC.jpg\" alt=\"AirDroip write message from PC\" width=\"920\" height=\"409\"  \/><\/p>\n<p>Airdroip also has a Premium version that is priced at $3.99 per month or $29.99 per year that allows us to remove advertising, although most of the functions are available with its free plan.<\/p>\n<h2>AirDroid Cast, mirror the screen on PC<\/h2>\n<p>With AirDroid Cast we will be able to share the screen of our mobile with the PC to be able to use it completely, being able to write from the computer without the need for the phone, but since it does so, it is to replicate the screen if it will be necessary for the screen to be on.  In return, we will be able to work with third-party applications, write for WhatsApp, Telegram, etc., as well as move files to and from our mobile.<\/p>\n<p>The app allows basic form mirroring in the free version.  To start we must download the application for Windows or macOS from the developer&#8217;s website, as well as the Android Cast application for mobile.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-726363 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652290348_679_How-to-type-on-mobile-from-a-Windows-PC.jpg\" alt=\"AirDroid Cast scan QR\" width=\"456\" height=\"700\"  \/><\/p>\n<p>Later we must start the applications on both devices.  A QR code and a number will appear in the PC application.  From the mobile application we must <strong>write down the numbering or scan the QR code<\/strong> to start streaming.  For security it will be necessary to grant permissions for the screen to be transmitted to the computer.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-726360 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652290348_794_How-to-type-on-mobile-from-a-Windows-PC.jpg\" alt=\"AirDroid Cast Activate control\" width=\"920\" height=\"518\"  \/><\/p>\n<p>To be able to write on the mobile it will be necessary to press the button<strong> &#8220;Activate control.&#8221; <\/strong>In order to activate it, it will be necessary that we have contracted its Premium version that has a cost of 3.49 euros per month.  In this way we will have access to all the applications and we will be able to manage it from the PC and write on it, just as we would do it directly from the mobile.  With the free version it will only be possible to mirror the phone screen to the computer.<\/p>\n<h2>Mobile Link and Link to Microsoft Windows<\/h2>\n<p>Formerly known as Your Phone.  It is a Microsoft application specially developed to link our Android mobile with the PC.  In this way, we will be able to access a wide number of functions such as answering text messages, receiving calls, seeing notifications, etc., all for free.  In addition, we can copy, edit and even drag and drop photos without having to touch the phone.<\/p>\n<p>To start we must run the application that is natively pre-installed in both Windows 10 and Windows 11 under the name of <strong>Mobile Link<\/strong>.  To run it, we&#8217;ll use the Start menu search engine to type mobile link and select the app.  We will also need to download the application <strong>Link to Windows<\/strong> for mobile from the Play Store.<\/p>\n<p>Once we run the application in Windows we will have to log in with our Microsoft account, something that we will also have to do from the mobile application, in both cases with the same account.  Next, from the web browser of the PC we access the address www.aka.ms\/addComputer.  By doing this we <strong>will show in the Mobile Link application a PIN<\/strong> that we must write in the mobile application to link both devices.  Later we must accept the necessary permissions to display the content of the mobile on the PC.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-726396 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652290348_662_How-to-type-on-mobile-from-a-Windows-PC.jpg\" alt=\"Enter PIN to pair devices\" width=\"920\" height=\"484\"  \/><\/p>\n<p>Once this is done we will have access to the application.  On the left side of the screen we have access to notifications, messages, photos, calls and contacts.  To be able to write any message from the computer, just click on the <strong>Posts<\/strong> and we can now write without using the mobile.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-726393 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652290348_893_How-to-type-on-mobile-from-a-Windows-PC.jpg\" alt=\"Mobile link write message\" width=\"920\" height=\"484\"  \/><\/p>\n<p>Its main drawback is that we won&#8217;t be able to use it with third-party applications like WhatsApp or Telegram, so if we want to write, it will be exclusively through SMS.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Fortunately, it is easy to access our mobile directly from the PC, through different third-party programs. In this way we can carry out different operations such as accessing notifications, writing messages, sharing photos and other files or making calls. Next, we are going to see what are the best options to be able to control [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":399,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/390"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=390"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/390\/revisions"}],"predecessor-version":[{"id":925,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/390\/revisions\/925"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/399"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=390"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=390"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=390"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}