{"id":400,"date":"2022-05-11T17:36:29","date_gmt":"2022-05-11T17:36:29","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/11\/no-brakes-how-is-the-technology-of-the-future-of-the-electric-car\/"},"modified":"2022-05-18T15:57:30","modified_gmt":"2022-05-18T15:57:30","slug":"no-brakes-how-is-the-technology-of-the-future-of-the-electric-car","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/no-brakes-how-is-the-technology-of-the-future-of-the-electric-car\/","title":{"rendered":"No brakes?  How is the technology of the future of the electric car"},"content":{"rendered":"<h2>DS innovation for electric car brakes<\/h2>\n<p>The touch of the brake pedal of an electric car is, in general, different from that of a car with a conventional internal combustion engine, but also, not all electric cars have the same touch, nor do they transmit the same sensations to the driver.  The brands do not talk much about it, but it is an engineering decision what sensation the pedal transmits to us when we step on it, and what <strong>balance between braking, retention and regeneration<\/strong> Wanted.<\/p>\n<p>There are different models of the electric car that hardly hold when the foot is lifted from the accelerator, requiring the brake to be pressed, while others hold a lot simply with that action, braking by themselves, without even pressing the brake pedal.  This is the case of the Rav-4, Toyota&#8217;s SUV, which is one of the electric cars with <strong>more retention<\/strong> of the moment together with the Tesla.<\/p>\n<p>Now, and hand in hand with the DS manufacturer, we have come up with a technological solution referring to the brakes of the electric car that today seems like an experiment that could arrive in some upcoming models.  An innovation from the French that has hardly been heard of from other manufacturers.<\/p>\n<h2>Dabble regenerative braking on its own<\/h2>\n<p>Thus, the former brand adhered to Citroën uses in its 100% electrified prototype, the <strong>DS E Tense Performance,<\/strong> the regeneration of the electric motor instead of conventional brakes, something that shows a potential future in electric vehicles.<\/p>\n<p>It does so hand in hand with the technology of its Formula E racing car, where it now uses two electric motors on board to reduce the speed of the vehicle completely through regenerative braking, <strong>up to 600 kW.<\/strong><\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>Although regenerative braking is already available in most electric vehicles, this technology is used as a complement to conventional braking.  The novelty is that DS <strong>dabbles in regenerative braking on its own<\/strong> and, in this way, it would help recharge the battery in the same process, producing the end of conventional brake discs and pads.  Engineers from the French company and the firm TotalEnergies have worked on its development,<\/p>\n<h3>A technology formulated from Formula E<\/h3>\n<p>Something to note, too, is that what this technology does is <strong>remove friction pads<\/strong>, also enhancing the environment.  Researchers have suggested that brake pads (along with tires) are a major source of fine particulate pollution, leading to some proposed innovations in how to collect all that dust on vehicles before it&#8217;s disposed of.<\/p>\n<p>For its part, it should be mentioned, above all, that much of this technology of the brakes of the DS electric car prototype is that the brand has great prestige in the young Formula E competition. With several titles to its credit , the French use knowledge of racing to apply it to this <strong>DS E-Tense Performance<\/strong>as it happens with these brakes that are given, also, for the rest of the street models of the electric car.<\/p>\n<p>Thus, this concept has been developed in conjunction with the Formula E team itself, DS Techeetah, and uses the same drives that can be found in electric racing cars.  The front block offers 250 kW of power (340 hp), while the rear is even more powerful, with 350 kW (476 hp), which makes it a total of <strong>607 kW (815 hp)<\/strong> available and a huge torque of 8,000 Nm.  With this, the Tense Performance can accelerate from 0 to 100 km\/h in just two seconds.  With a 350 kW charging system, it recovers its full energy in just five minutes.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>DS innovation for electric car brakes The touch of the brake pedal of an electric car is, in general, different from that of a car with a conventional internal combustion engine, but also, not all electric cars have the same touch, nor do they transmit the same sensations to the driver. The brands do not [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":402,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/400"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=400"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/400\/revisions"}],"predecessor-version":[{"id":924,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/400\/revisions\/924"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/402"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=400"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=400"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=400"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}