{"id":403,"date":"2022-05-11T18:20:52","date_gmt":"2022-05-11T18:20:52","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/11\/i-cant-copy-and-paste-in-windows-all-solutions\/"},"modified":"2022-05-18T15:57:30","modified_gmt":"2022-05-18T15:57:30","slug":"i-cant-copy-and-paste-in-windows-all-solutions","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/i-cant-copy-and-paste-in-windows-all-solutions\/","title":{"rendered":"I can&#8217;t copy and paste in Windows &#8211; all solutions"},"content":{"rendered":"<p>Despite the great importance of this function, the truth is that it is quite simple.  When we decide to copy something (whatever it is)<strong> this is passed to a clipboard where it is stored<\/strong>, and it stays there until we decide to copy something else instead.  Windows does not usually give us any type of error with this function, although from time to time it may happen that we cannot copy anything to the clipboard, or, on the contrary, paste content elsewhere.  If this happens, <strong>one of the solutions you have just below should solve the problem for you<\/strong>where we will see some very common ones along with other more technical ones.<\/p>\n<h2>Check the software that gives the error<\/h2>\n<p>Sometimes the error associated with the copy and paste function <strong>may not be related to Windows<\/strong>, but it may be a software problem where we are trying to copy or paste, depending on the occasion.  Programs like Microsoft&#8217;s own Office may have a performance issue that prevents the system from detecting this feature, or even allows us to edit its content in other ways.<\/p>\n<p>If this is your problem, the first thing you should do is turn off the program in question and turn it on again, even restarting the system itself along the way.  This will likely fix any simple bugs you may have with the program, but if not you can also try <strong>update it to its newest version<\/strong>or even reinstall it.<\/p>\n<h2>keyboard and mouse<\/h2>\n<p>It may sound a bit “silly”, but a malfunction of our keyboard or our mouse could be the main culprits that we cannot copy and paste normally.  This type of error is usually more common on the keyboard, since it can be caused by keyboard shortcuts.  To check if your problem is here, all you have to do is <strong>try to introduce some other shortcut than copy and paste<\/strong>.<\/p>\n<p>If other shortcuts don&#8217;t work either, <strong>The steps you can follow to try to solve it are the following<\/strong>:<\/p>\n<ul>\n<li>Writes &#8220;<strong>Setting<\/strong>» in Windows Finder<\/li>\n<li>Scroll down and select «<strong>Update and security<\/strong>«<\/li>\n<li>We choose the option «Troubleshoot»\n<ul>\n<li>Within this, &#8220;<strong>Additional troubleshooters<\/strong>«<\/li>\n<\/ul>\n<\/li>\n<li>Below we will have the option to select Keyboard, and here we will run the troubleshooter.<\/li>\n<\/ul>\n<p><\/p>\n<p id=\"caption-attachment-1645656\" class=\"wp-caption-text\">Full view of additional troubleshooters.<\/p>\n<h2>Check the Windows clipboard<\/h2>\n<p>As we have explained a little above, the Windows clipboard is the place where what we decide to copy is “stored” to paste it later in another place.  It is more common than it seems that some type of content is blocked in the clipboard, but this has a very easy solution.<\/p>\n<p>To do this, all we have to do is type the word «<strong>cmd<\/strong>» in the Windows search engine and write the following text without quotes in the window that will appear: «<strong>echo off |  clip»<\/strong>.  Once this is done, the clipboard history should be completely empty, and we should be able to use this function without problems.<\/p>\n<p> <img viewbox=\"0 0 3 2\" aria-describedby=\"caption-attachment-1645503\" loading=\"lazy\" class=\"size-large wp-image-1645503\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652293252_886_I-cant-copy-and-paste-in-Windows-all-solutions.jpg\" alt=\"\" width=\"715\" height=\"406\"  \/><\/p>\n<p id=\"caption-attachment-1645503\" class=\"wp-caption-text\">This is how the text should look to clear the clipboard.<\/p>\n<h2>Restart Windows Explorer<\/h2>\n<p>Here we come to a way to fix our copy and paste problem something more delicate.  This useful function of the operating system depends on the Windows Explorer, and it may be that the operation of this has been corrupted in some way.  We will have no choice but <strong>restart this process<\/strong>although before doing so we recommend that you save the progress of any type of program you have open.<\/p>\n<p>Restarting Windows Explorer is a really easy process.  To do this, what we will have to do is type in the Windows search engine «<strong>Task Manager<\/strong>» (or access through the shortcut Control + Alt + Del), select the process that indicates «Windows Explorer» and click on the bottom button of the administrator screen, on «Restart».<\/p>\n<p> <img viewbox=\"0 0 3 2\" aria-describedby=\"caption-attachment-1645740\" loading=\"lazy\" class=\"size-large wp-image-1645740\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652293252_218_I-cant-copy-and-paste-in-Windows-all-solutions.jpg\" alt=\"Windows Explorer\" width=\"715\" height=\"447\"  \/><\/p>\n<p id=\"caption-attachment-1645740\" class=\"wp-caption-text\">This is how the Task Manager will appear.<\/p>\n<h2>Run the rdpclip process<\/h2>\n<p>The copy and paste functionality depends on a process on our computer called rdpclip.  If this does not work correctly, it is possible that we cannot copy and paste within our computer or in our remote desktop, so to solve it we have no other remedy than <strong>shut it down and restart it<\/strong>.<\/p>\n<p>As we have done in the previous solution, we will have to access the Windows Task Manager again.  Once inside, we must click on the upper tab “Details” and look for the process called “rdpclip.exe”.  When we find it, we must select it and click on «<strong>Finish homework<\/strong>«.<\/p>\n<p> <img viewbox=\"0 0 3 2\" aria-describedby=\"caption-attachment-1645812\" loading=\"lazy\" class=\"size-large wp-image-1645812\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652293252_35_I-cant-copy-and-paste-in-Windows-all-solutions.jpg\" alt=\"rdpclip\" width=\"685\" height=\"500\"  \/><\/p>\n<p id=\"caption-attachment-1645812\" class=\"wp-caption-text\">rdpclip.exe inside System32<\/p>\n<p>Once this is done, we will go to our File Explorer to search <strong>the System32 folder<\/strong> that is inside the Windows folder.  Inside this folder is this process “rdpclip.exe”, so we will have to run it and check if we already have our problem solved.<\/p>\n<p>If all these tools that we have given you in this article have not worked for you, it is possible that it is a deeper Windows error.  In this case, what we recommend is that you go to the «<strong>error checking<\/strong>» of the hard disk where the operating system is installed, or that you try to <strong>upgrade to a newer version of Windows<\/strong> Just in case it&#8217;s a compatibility issue.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Despite the great importance of this function, the truth is that it is quite simple. When we decide to copy something (whatever it is) this is passed to a clipboard where it is stored, and it stays there until we decide to copy something else instead. Windows does not usually give us any type of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":408,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/403"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=403"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/403\/revisions"}],"predecessor-version":[{"id":923,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/403\/revisions\/923"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/408"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=403"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=403"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=403"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}