{"id":418,"date":"2022-05-11T21:24:51","date_gmt":"2022-05-11T21:24:51","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/11\/adjust-the-document-put-word-pages-horizontally-or-vertically\/"},"modified":"2022-05-18T15:57:30","modified_gmt":"2022-05-18T15:57:30","slug":"adjust-the-document-put-word-pages-horizontally-or-vertically","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/adjust-the-document-put-word-pages-horizontally-or-vertically\/","title":{"rendered":"Adjust the document!  Put Word pages horizontally or vertically"},"content":{"rendered":"<p>A few years ago when we referred to a text editor, in reality we found ourselves with a basic and simple program to write these documents full of characters.  But times have changed a lot and today we find ourselves with powerful applications for multiple tasks.  Needless to say, the popular <strong>Microsoft Word<\/strong> belongs to this software sector.<\/p>\n<p>We mention precisely this title because it could be considered one of the most widespread and used programs in the world.  In this way, users find the perfect solution to carry out all kinds of treatments with their text documents.  Obviously today we no longer only work here with characters as such.  We can give our documents a higher level by adding <strong>images<\/strong>, <strong>videos<\/strong>charts, graphs and much more.<\/p>\n<p>Most of you will already know that this is an application that is part of the software giant&#8217;s Office suite where we also find other titles such as <strong>Excel<\/strong> either <strong>PowerPoint<\/strong>.  Managing and controlling all the functions that Word currently offers us is not an easy task.  But most users master the <strong>most common basic functions that we usually use when writing<\/strong> this documents.  Here we want to focus on something as useful as it is functional as it is <strong>change page orientation<\/strong>.<\/p>\n<p>This is something that can be very useful to us depending on the type of document we are writing or the use we make of it.  It will also be helpful in certain circumstances when <strong>print our projects on paper<\/strong>.  Precisely for all this we are going to show you below how you can carry out this modification in the simplest way.<\/p>\n<h2>Change the orientation of a page in Word<\/h2>\n<p>Well, to say that this is something that we can carry out in a simple way if necessary.  First of all, we are going to tell you that this type of orientation change is usually carried out on <strong>pre-finalized and formatted documents<\/strong>.  We say this because Microsoft&#8217;s a priori text editor allows us to set our project pages to the max before we start working.  But if once we have finished we need to carry out this change, let&#8217;s see how to do it.<\/p>\n<p>Therefore, for all this that we are telling you, the first thing we will do is select the paragraphs or pages that we want to modify in terms of their orientation.  This means that we won&#8217;t have to make this change to the entire document.  Thus, once the corresponding selection of the content has been made, we go to the Layout menu option that we find in the <strong>Word main interface<\/strong>.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>A series of sections will appear on the screen belonging to the aforementioned configuration that we can carry out with the pages of our <strong>document<\/strong>.  Precisely in this case we take a look at Page Setup, where we find the drop-down list corresponding to Orientation.  Therefore, now we only have to click on it to change the orientation of the <strong>selection of texts<\/strong> what have we done.  Here we will have the possibility to establish a <strong>landscape or portrait orientation<\/strong>depending on the needs of each case.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A few years ago when we referred to a text editor, in reality we found ourselves with a basic and simple program to write these documents full of characters. But times have changed a lot and today we find ourselves with powerful applications for multiple tasks. Needless to say, the popular Microsoft Word belongs to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":420,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/418"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=418"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/418\/revisions"}],"predecessor-version":[{"id":919,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/418\/revisions\/919"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/420"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=418"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=418"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=418"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}