{"id":462,"date":"2022-05-12T13:08:53","date_gmt":"2022-05-12T13:08:53","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/12\/when-installing-thunderbird-does-it-create-my-own-email-account\/"},"modified":"2022-05-18T15:59:32","modified_gmt":"2022-05-18T15:59:32","slug":"when-installing-thunderbird-does-it-create-my-own-email-account","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/when-installing-thunderbird-does-it-create-my-own-email-account\/","title":{"rendered":"When installing Thunderbird, does it create my own email account?"},"content":{"rendered":"<p>The <strong>email<\/strong> It is a communication system through the internet that has survived messaging applications and social networks.  Perhaps in recent years it has acquired a somewhat more professional level, but it is still used in all kinds of environments and situations.  There are certain clients that allow us to manage all this locally from the PC, this is the case of Thunderbird that we will talk about next.<\/p>\n<p>We must also admit that many users these days prefer to manage all their email messages directly from the <strong>browser<\/strong>.  This opens up a wide range of possibilities by being able to interact with these emails from any device and place.  A clear example of all this can be found in the <strong>service offered by Google<\/strong> with your own <strong>gmail<\/strong>.  But there are also many who prefer, especially in corporate environments, to perform these tasks through a local program.<\/p>\n<p>There are several situations and reasons why we are more interested in installing a client on the PC and thus being able to control the mail from it.  For example, all this will allow us to simultaneously use several accounts from <strong>a single user interface<\/strong>.  In addition, the customizable functions and parameters that this type of application presents us with is usually much greater than those of web platforms.  Of course, we must bear in mind that we are talking here about a <strong>mail manager<\/strong>not of a service of this.<\/p>\n<p>We tell you this because many users expect that after installing software locally, such as <strong>thunder bird<\/strong>, this will provide them with a new account.  The first thing we should know is that here we are referring to a fairly common and widespread error.<\/p>\n<h2>Thunderbird is a manager of existing email accounts<\/h2>\n<p>We must bear in mind that when we talk about this program and other similar ones, such as Microsoft&#8217;s Outlook, we are talking about conventional software.  In other words, they are programs that allow us to carry out a series of tasks, in this case on the mail, but they do not provide us with this type of element.  What we want to tell you with this is that when you install Thunderbird on your computer, <strong>we will not receive any email account<\/strong>.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>Therefore, in order to get the most out of this program that we are commenting on, we will have to add and <strong>set up our personal accounts ourselves<\/strong>.  As we mentioned before, from the application we can manage and manage several of these, but the program does not provide us with any new ones.  So we can use any existing email address and any service provider of this type.<\/p>\n<p>The program allows us to write, send, receive, and search for email messages, in addition to many other additional functions, but with accounts that we already have created.  This means that from Thunderbird we can <strong>use web-based provider accounts<\/strong> such as Google, those that are considered as <strong>of the company<\/strong>those provided by different <strong>specialized providers<\/strong>etc.<\/p>\n<p>In addition, one of the most striking points that this software that we are talking about offers us is that we can add several.  In this way, for example, we can <strong>use our professional and personal mail simultaneously<\/strong> from a single window.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The email It is a communication system through the internet that has survived messaging applications and social networks. Perhaps in recent years it has acquired a somewhat more professional level, but it is still used in all kinds of environments and situations. There are certain clients that allow us to manage all this locally from [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":95,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/462"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=462"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/462\/revisions"}],"predecessor-version":[{"id":952,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/462\/revisions\/952"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/95"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=462"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=462"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=462"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}