{"id":471,"date":"2022-05-12T13:54:37","date_gmt":"2022-05-12T13:54:37","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/12\/red-yellow-green-why-are-there-colored-license-plates-in-spain\/"},"modified":"2022-05-18T15:59:32","modified_gmt":"2022-05-18T15:59:32","slug":"red-yellow-green-why-are-there-colored-license-plates-in-spain","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/red-yellow-green-why-are-there-colored-license-plates-in-spain\/","title":{"rendered":"Red, yellow, green&#8230; why are there colored license plates in Spain?"},"content":{"rendered":"<h2>The registration system in Spain<\/h2>\n<p>All vehicles must carry an identification plate.  You may have noticed that another driver&#8217;s car has a different number plate than ours.  In those, currently, there are colored license plates that <strong>have a specific meaning<\/strong> (beyond taxis or public services, which are the most identifiable).<\/p>\n<p>And it is that, after more than a century has passed since the owners began to register their motor vehicles in Spain, in all these years we have seen different license plate numbering systems.  The current one is from the year 2000, it is part of the <strong>european model<\/strong> of plates and is capable of supporting 80,000 possible registrations.<\/p>\n<p>As such, in the current registration system there are two types of registration: the <strong>ordinary and extraordinary<\/strong>.  The ordinary one is the one that all the citizens of the country use.  The extraordinary is aimed at registering vehicles of the state security forces and bodies, of members of the government&#8230; but, what about colored license plates?<\/p>\n<h2>What are the colored plates like?<\/h2>\n<p>Thus, gone are the registration plates that began with the <strong>province letter<\/strong> where it had been acquired and that served as entertainment to find out where the people in the car were from: B from Barcelona, ​​BA from Badajoz, MA from Malaga, not from Madrid, which was just the M&#8230; the city with the most population prevailed to have a single letter.<\/p>\n<p>Over time, it has also become more sophisticated and new features have been introduced to this regulation by the DGT.  Therefore, it is not uncommon for us to see vehicles with license plates of different colors.  With this, if we drive on roads in Spanish territory, these are going to be five possible license plate colors that we come across and it is worth knowing what they mean: <strong>white<\/strong>, <strong>blue, red, green and yellow. <\/strong>For example, since 2018, in Spain it is established that taxis and all VTCs such as Uber and Cabify, should have the color blue on their rear license plates and with white letters.  These are the main colors that we can find in car license plates.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<h3><strong>white license plate<\/strong><\/h3>\n<p>are the license plates <strong>more common<\/strong>.  In your case, these are required to be carried by all private cars that have been registered in Spain.<\/p>\n<p>Vehicles that belong to the state or to public administrations also use this type of license plate, but they are distinguished by <strong>different numbers and letters<\/strong> representing each institution.<\/p>\n<h3>blue license plate<\/h3>\n<p>These are a type of new colored license plates that have been implemented since 2018. They are license plates with a blue background and the numbers and letters written in white.  This type of license plate indicates that the car bearing it is a <strong>taxi or a VTC<\/strong> (transport vehicle with driver) and must be placed on the rear license plate of the vehicle.<\/p>\n<p>For them, apart from taxis and VTCs, if the license plate bears the acronym OI on the left, it is a vehicle that belongs to some <strong>International Organization<\/strong>like the UN or the WHO.  Vehicles with these license plates are usually used by diplomatic personnel of these organizations.  The use of the blue license plate was decided to be able to easily distinguish these cars from private cars and so that users can distinguish if the vehicle is legal.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1646352 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/Red-yellow-green-why-are-there-colored-license-plates-in.jpg\" alt=\"Blue license plates colors how are they\" width=\"768\" height=\"425\"  \/><\/p>\n<h3>red license plates<\/h3>\n<p>Most commonly, license plates with a red background are installed on a truck trailer or semi-trailer that has a maximum authorized mass that <strong>exceeds 750kg<\/strong>.  In this case, the license plate has a red background, the characters are in black and to the left is an R, followed by the four-digit and three-letter code.<\/p>\n<p>Other vehicles with a red number plate are those belonging to the staff of the <strong>Diplomatic corps<\/strong>, diplomats, consuls and senior officials.  In this case the background is red but the characters are white and on the left side of the license plate you can see the letters CD followed by two numerical codes.  In this case, as part of the red license plates, it is necessary to distinguish between the definitive or permanent ones and the provisional ones.<\/p>\n<ul>\n<li><strong>Permanent. <\/strong>They are the ones mentioned that carry trailers or semi-trailers with a maximum authorized mass that exceeds 750 kg.  The background is red and the characters are black.  On the other hand, diplomatic corps vehicles also have red license plates, although the color of the characters is white.<\/li>\n<li><strong>provisional. <\/strong>There are three different cases in which vehicles can temporarily circulate with a red number plate.  On the one hand, there are cars that have already been registered but are in a situation of temporary deregistration due to transmission (S), those that are not registered in Spain because they are new or imported second-hand and are awaiting definitive registration (V ), and vehicles that are used for technical trials and tests (FV).  The characters appear in white and there is also a white side stripe indicating the validity date of the license plate, which can be up to one year.<\/li>\n<\/ul>\n<h3>yellow license plates<\/h3>\n<p>However, and together with the blue, white and red license plates, we can find others to designate different types of vehicles.  On this occasion, we want to show you what yellow license plates are.<\/p>\n<p>Yellow license plates are one of the types of plates that we can find in our country.  These are intended to identify the <strong>light quadricycles<\/strong>.  In other words;  This type of license plate is mandatory for all vehicles cataloged within this category.  The license plates of these motor vehicles are rectangular and have a dark yellow background on which a series of numbers and letters are placed in black that are intended to identify the vehicle.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1646361 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652363677_329_Red-yellow-green-why-are-there-colored-license-plates-in.jpg\" alt=\"Number plates green colors Spain\" width=\"768\" height=\"425\"  \/><\/p>\n<h3>green license plates<\/h3>\n<p>As we say, every EU citizen must register their vehicle <strong>in the state where you reside<\/strong> Usually, the member states are in charge of freely regulating this matter, since at the moment it is not yet homogenized between countries.  And that&#8217;s where the green ones come in.<\/p>\n<p>In the case of our country, the DGT indicates that the vehicle must be definitively registered within 30 days after the start of its use within the state.  These are used in vehicles. <strong>imported from abroad<\/strong> who have not yet received the white license plate that corresponds to Spain.  As in the case of the red ones, it is also necessary to distinguish between those that are definitive or permanent and those that are provisional.<\/p>\n<ul>\n<li><strong>Permanent<\/strong>.  They are carried by the vehicles of the consular offices and begin with the initials CC.  Characters appear in white.<\/li>\n<li><strong>provisional<\/strong>.  They are for new vehicles of foreign origin that await their final registration.  They have three validity periods: one of 60 days, another of 60 days (but to be able to move abroad to obtain permanent registration) and a last one of 10 days to move the vehicle from one province to another.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>The registration system in Spain All vehicles must carry an identification plate. You may have noticed that another driver&#8217;s car has a different number plate than ours. In those, currently, there are colored license plates that have a specific meaning (beyond taxis or public services, which are the most identifiable). And it is that, after [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":475,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/471"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=471"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/471\/revisions"}],"predecessor-version":[{"id":950,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/471\/revisions\/950"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/475"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=471"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=471"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=471"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}