{"id":483,"date":"2022-05-13T07:47:24","date_gmt":"2022-05-13T07:47:24","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/13\/carnival-in-venezuela-what-are-the-holidays-in-2022-the-newspaper\/"},"modified":"2022-05-18T15:59:32","modified_gmt":"2022-05-18T15:59:32","slug":"carnival-in-venezuela-what-are-the-holidays-in-2022-the-newspaper","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/carnival-in-venezuela-what-are-the-holidays-in-2022-the-newspaper\/","title":{"rendered":"Carnival in Venezuela: what are the holidays in 2022?  &#8211; The newspaper"},"content":{"rendered":"<ul>\n<li>It is an ancient celebration that takes place 40 days before Holy Thursday.  In Venezuela it is customary to celebrate it with parades, costumes, troupes, dances and games that involve water |  Photo: Reference<\/li>\n<\/ul>\n<p>Carnival is one of the most anticipated and enjoyed celebrations by people in the year.  It is synonymous with joy, parades, dances, mass gatherings and many colors.  As it is one of the moving events of the calendar (with no fixed date), many find out from the end of January to know when to celebrate it.  In this 2022, it will be from February 25 to March 2. <\/p>\n<p>The variation of the date depends directly on Holy Week, a religious celebration, since it must end 40 days before Holy Thursday (April 14, 2022);  this transition period is known as Lent. <\/p>\n<p>The days of Carnival this year are as follows: <\/p>\n<p>– Carnival Friday: February 25<\/p>\n<p>– Carnival Saturday: February 26<\/p>\n<p>– Carnival Sunday: February 27<\/p>\n<p>– Carnival Monday: February 28<\/p>\n<p>– Shrove Tuesday (Burial of the Sardine): March 1<\/p>\n<p>– Ash Wednesday: March 2<\/p>\n<p>For the dates of Carnival in 2021, Venezuela was going through a complex period in relation to the pandemic.  By then, the 7+7 scheme (a radical week and a flexible week) was active, but the regime of Nicolás Maduro decided to extend the flexibility after the holiday of the celebration. <\/p>\n<p>The beaches of La Guaira, Vargas state, were scenarios that reflected the way in which it was carried out at that time, which led to spikes in covid-19 cases in the coming weeks. <\/p><source type=\"image\/webp\"  \/>Carnival in Venezuela |  Photo: Reference.<\/p>\n<h2 id=\"h-como-se-celebra-el-carnaval-en-venezuela\"><strong>How is Carnival celebrated in Venezuela? <\/strong><\/h2>\n<p>For decades, Carnival in Venezuela has been characterized by parades, dances and many costumes.  During the dictatorship of Marcos Pérez Jiménez it was promoted even more;  It was carried out in the streets, clubs, hotels and some temples, musicalized by orchestras in the Caracas tours. <\/p>\n<p>Currently, Carnival is celebrated throughout the national territory, although over time it has generated certain customs of each state or region. <\/p>\n<p>One of the places highlighted by the Carnival in Venezuela is El Callao (Bolivar state).  Parades are usually held there in which local citizens dance to Afro-Caribbean calypso music from Trinidad and Tobago.  The cuatros, drums, maracas, charrascas and bells are part of the musical composition. <\/p>\n<p>In the city of Carúpano (Sucre state) this is one of the most important traditions for the communities;  so much so, that it usually gathers more than 400,000 people for the parades.  In addition to the typical costumes, it is customary to see floats, old cars, and the interpretation of a character called the Devil Luis.  Additionally, a Carnival queen and mini-queen are elected. <\/p>\n<p>During the Carnival in Mérida, the Sun Fair is held in honor of the Virgin of the Immaculate Conception;  the costumes tend to be related to the main star of the Earth, as well as the virgin and the blessings of her.  A queen of the Sun is also chosen through a popular contest. <\/p>\n<p>In the east of the country, meetings and parades with Caribbean, African, European and Carioca influence predominate;  however, samba, salsa, calypso and merengue are also present.  Additionally, the theme of costumes is different from other regions, since they are usually Brazilian-style.<\/p>\n<h5 style=\"margin-top:40px\">Related news<\/h5>\n","protected":false},"excerpt":{"rendered":"<p>It is an ancient celebration that takes place 40 days before Holy Thursday. In Venezuela it is customary to celebrate it with parades, costumes, troupes, dances and games that involve water | Photo: Reference Carnival is one of the most anticipated and enjoyed celebrations by people in the year. It is synonymous with joy, parades, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":485,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/483"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=483"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/483\/revisions"}],"predecessor-version":[{"id":947,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/483\/revisions\/947"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/485"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=483"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=483"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=483"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}