{"id":511,"date":"2022-05-13T16:47:43","date_gmt":"2022-05-13T16:47:43","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/13\/the-devils-acid-the-chemical-mixture-they-use-in-the-dominican-republic\/"},"modified":"2022-05-18T15:59:32","modified_gmt":"2022-05-18T15:59:32","slug":"the-devils-acid-the-chemical-mixture-they-use-in-the-dominican-republic","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/the-devils-acid-the-chemical-mixture-they-use-in-the-dominican-republic\/","title":{"rendered":"The devil&#8217;s acid, the chemical mixture they use in the Dominican Republic"},"content":{"rendered":"<ul>\n<li>According to the Life Without Violence Foundation, the Caribbean country registered 15 cases of people sprayed with the liquid during 2021. So far in 2022, four attacks have been registered.  Photo: The Country<\/li>\n<\/ul>\n<p>15 people, 14 of them women, were seriously affected in 2021 due to being sprayed with a liquid they call the devil&#8217;s acid in the Dominican Republic, according to data from the Pearl F. Ort Burn Unit of the Luis Eduardo hospital. Aybar of Santo Domingo.  The institute assured that the alleged reasons are sexist violence, jealousy, theft and envy. <\/p>\n<blockquote class=\"recommended\">\n<h3>We also recommend you<\/h3>\n<p>Who is Virginia Giuffre, the woman who drives allegations of sexual abuse against Prince Andrew<\/p>\n<\/blockquote>\n<p>In September 2021, the National Institute for the Protection of Consumer Rights of the Dominican Republic issued a resolution definitively prohibiting the sale of the chemicals with which the &#8220;devil&#8217;s acid&#8221; is made.  This as a measure to try to stop the attacks that, according to the Dominican press, have destroyed the lives of the victims. <\/p><source type=\"image\/webp\"  \/>Photo: Diario Libre<\/p>\n<h2 id=\"h-yanelis-arias-el-caso-que-conmociono-al-pais\"><strong>Yanelis Arias, the case that shocked the country  <\/strong><\/h2>\n<p>On April 20, 2021, a man knocked on the door of the house of Yanelis Arias, 42 years old.  The subject identified himself as a messenger from a flower shop and when Arias opened the door, the man sprayed the liquid on his face and body. <\/p>\n<p>Yanelis Arias is one of the 14 women victims of attacks with &#8220;acid from the devil&#8221;.  She died 15 days after the attack from septic shock from injuries inflicted with the fluid.  The woman joins the statistics of just over 81 femicides during 2021, according to data from the Life Without Violence Foundation.  The institute added that so far in January 2022 there have been four other attacks with this liquid. <\/p>\n<p>Arias, who was the mother of three children who are now orphans, was a resident of the United States, but was on vacation at her family&#8217;s home, located in the municipality of Hermanas Mirabal province, in Santo Domingo.<\/p><source type=\"image\/webp\"  \/><img loading=\"lazy\" width=\"1000\" height=\"1000\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652460463_93_The-devils-acid-the-chemical-mixture-they-use-in-the.jpg\" alt=\"\"  \/>Photo of Yanelis Arias given by relatives to the newspaper El País<\/p>\n<h2><strong>Effect of fluid on the body<\/strong><\/h2>\n<p>&#8220;It can affect the bones and vital organs such as the liver and kidneys, as well as cause blindness and permanent deformation of the face and other parts of the body,&#8221; surgeon Eddy Bruno, director of the Pearl F Burns Unit, explained to the Spanish newspaper El País. .ort on this liquid.<\/p>\n<p>According to the Dominican doctor, between 1,600 and 1,700 cases of burns a year arrive at the emergency room of this center, of which 5% are due to chemical substances.  Of these, 4% are women: “Almost all of them arrive due to an assault due to gender violence.” <\/p>\n<blockquote class=\"recommended\">\n<h3>We also recommend you<\/h3>\n<p>“A Poison in the System”: The Military Sexual Assault Epidemic<\/p>\n<\/blockquote>\n<p>The mortality rate is low but, according to the specialist, in the survivors &#8220;there are physical and psychological sequels for life.&#8221;  The case of Yanelis Arias is among the statistics of low mortality rates.<\/p>\n<blockquote>\n<h3>Sexist violence in the Dominican Republic<\/h3>\n<p>The Dominican Republic is the second country in Latin America and the Caribbean with the highest incidence of femicides, the first being Honduras, according to data offered in 2020 by the Economic Commission for Latin America and the Caribbean (ECLAC).  In the Dominican Republic, for every 100 women murdered, 2.4 are due to sexist violence. <\/p>\n<p>The Life Without Violence Foundation and the Attorney General&#8217;s Office (PGR) revealed in 2021 statistics that affirm that of 81 murdered women, 62 were intimate femicides, that is, at the hands of their partner. <\/p>\n<p>The newspaper El País reported that in many of the cases impunity is added due to the lack of a judicial system and a weak Ministry of the Interior and Police;  also to the lack of information and official registration of those attacked and, above all, to the lack of coordination between the competent public institutions in the area.<\/p>\n<\/blockquote>\n<h2><strong>Some of the stories of the victims of the &#8220;devil&#8217;s acid&#8221;<\/strong><\/h2>\n<p>Yomaira Aquino, 26, was attacked with acid while she slept in her home with her two children.  She could not see her victimizer or her victimizer, who entered through the back door of the wooden house.  She never received counseling nor was her situation reported to the authorities when she was admitted to the hospital.<\/p>\n<p><img src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/Nancy-Colmenares-the-first-wife-of-Hugo-Chavez-died.svg.svg+xml\" class=\"comilla\"\/><\/p>\n<p> <strong>I found out what had happened to me when I was discharged two months later.  I was unconscious most of the time.  I suspect who they could be, but the Police never pressed for them to confess, &#8220;explained Aquino.<\/strong> <\/p>\n<p> Share on    <img style=\"width:15px; filter:invert(1)\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652360813_772_Nancy-Colmenares-the-first-wife-of-Hugo-Chavez-died.svg.svg+xml\"\/> <img style=\"width:15px; filter:invert(1)\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652360813_425_Nancy-Colmenares-the-first-wife-of-Hugo-Chavez-died.svg.svg+xml\"\/><\/p>\n<p>The case of Mirian Santana, another of the victims, came to court because she herself investigated and followed the trail of her attacker through social networks.  Her victimizer fled to Chile after committing the crime.  Years later she returned to the Dominican Republic on vacation and there was no search and seizure alarm. <\/p>\n<p>Santana found out through Facebook about his return to the country;  she moved &#8220;heaven and earth&#8221; to take her to the dock before the judiciary.  Thus she managed to be sentenced to 15 years in prison.<\/p><source type=\"image\/webp\"  \/><img loading=\"lazy\" width=\"828\" height=\"466\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652460463_335_The-devils-acid-the-chemical-mixture-they-use-in-the.jpg\" alt=\"\"  \/>Photo: The Country<\/p>\n<p>Yocairi Amarante was 19 years old in 2020 when she was attacked with acid.  Her case marked a before and after in the face of the indifference of the authorities thanks to the fact that she herself made her story viral on social networks.  The young woman was sprayed by her ex-partner with the corrosive liquid;  which disfigured her face and caused the loss of her right eye, as well as the deprivation of 50% of the vision of her left eye and other serious and irreversible damage.  The pressure of society, dismayed by the facts, demanded a forceful sentence. <\/p>\n<p>According to a report carried out by El País, the victims of the devil&#8217;s acid agree that the economic cost of assisting a person attacked by this substance is very high, since multiple surgeries are required, not only aesthetic reconstruction.  To these health expenses is added the difficulty for reintegration into the labor market of the survivors due to their physical appearance.<\/p>\n<h5 style=\"margin-top:40px\">Related news<\/h5>\n","protected":false},"excerpt":{"rendered":"<p>According to the Life Without Violence Foundation, the Caribbean country registered 15 cases of people sprayed with the liquid during 2021. So far in 2022, four attacks have been registered. Photo: The Country 15 people, 14 of them women, were seriously affected in 2021 due to being sprayed with a liquid they call the devil&#8217;s [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":515,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/511"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=511"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/511\/revisions"}],"predecessor-version":[{"id":941,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/511\/revisions\/941"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/515"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=511"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=511"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=511"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}