{"id":525,"date":"2022-05-14T09:40:18","date_gmt":"2022-05-14T09:40:18","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/14\/everything-that-5g-can-bring-us-to-our-car\/"},"modified":"2022-05-18T15:59:32","modified_gmt":"2022-05-18T15:59:32","slug":"everything-that-5g-can-bring-us-to-our-car","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/everything-that-5g-can-bring-us-to-our-car\/","title":{"rendered":"Everything that 5G can bring us to our car"},"content":{"rendered":"<br \/>\n<h2>A network to make them &#8216;gifted&#8217;<\/h2>\n<p>Although the first tests for cars have already been carried out, a stable 5G network is necessary to make it a reality.  But 5G will not only imply the arrival of the autonomous car, which is the great point that everyone is talking about, but also to greatly improve the so-called <strong>connected cars.<\/strong><\/p>\n<p>As such, what we will see is a new generation of wireless mobile technology that will increase the speed of <strong>transmission of information,<\/strong> but not only that.  And it is that it will also reduce latency in an impressive way, which will result in a much lower response time.  All this will lead to a huge growth of connected devices constantly and much faster.<\/p>\n<p>Offering up to 10 GB per second, this is 100 times faster than 4G in its early days and <strong>10 times higher<\/strong> than that of later 4G LTE versions.  These figures will be decisive in achieving a real-time response from connected systems and devices.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<h3>Improve security levels<\/h3>\n<p>Today, many vehicles incorporate 4G technology as standard, the same technology that until now allowed any connected car to send information about its status in a matter of 100 milliseconds.  However, with the arrival of the fifth generation, it is estimated that communication, both transmission and reception of data, already has a latency of only 15 milliseconds.<\/p>\n<p>The integration of this new technology into the automotive world will contribute to greater reliability and, consequently, to higher levels of safety for autonomous driving.  Also, this allows a <strong>reaction more accurately<\/strong> in case of any unforeseen event, notably reducing the possibility of traffic accidents.<\/p>\n<h3>Direct communication between users<\/h3>\n<p>Another benefit that we have with 5G for our car is that it will allow direct communication between users, without the need to enable a network infrastructure.  This type of communication will contribute to generalizing the use of <strong>safer roads<\/strong>C-ITS services.<\/p>\n<p>Among the functions of these services, the Protection of Vulnerable Users, the Cooperative Lane Change or the Intersection Assistant stand out.  This could prevent nearly 29,000 deaths and 275,000 injuries from traffic accidents within twenty years, in the European Union alone.<\/p>\n<h3>Vehicle to Vehicle (V2V) and Vehicle to Infrastructure (V2L)<\/h3>\n<p>Here we have two very important advantages.  On the one hand, 5G in relation to the car will change the way vehicles talk to each other to warn of different threats. <strong>Will launch accident alerts<\/strong>traffic jams, road conditions or the weather to be able to offer, for example, alternative routes.<\/p>\n<p>On the other hand, we have what is known as V2L where, as with other vehicles, it is also <strong>will exchange information<\/strong> with the infrastructures, be it the road itself, the traffic lights or the car parks.  In this way, it will be known in advance where there is a free space near the destination to which the vehicle is headed.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-1654371 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652521218_374_Everything-that-5G-can-bring-us-to-our-car.jpg\" alt=\"5G car V2X\" width=\"768\" height=\"425\"  \/><\/p>\n<h3>Connected vs autonomous<\/h3>\n<p>Faced with this technological network, we will have two car concepts: the connected car and the autonomous car.  On the one hand, the connected is one that can receive information from an external source and\/or connect to a consumer&#8217;s phone.  Currently these are already common on our roads, such as the <strong>navigation system<\/strong> of the car, which is connected to the GPS network.  In the event of traffic or other interruptions on the road, the navigation system can plan a new route to avoid these obstacles.<\/p>\n<p>The next phase of the connected vehicle will be advances in V2X, where X can be a pedestrian or a traffic management system at an intersection.  Also known as vehicle-to-everything, this is the latest advancement in connected vehicles that will support the <strong>automatic braking<\/strong> of vehicles to prevent traffic accidents.<\/p>\n<p>Then there is the autonomous car, where all the assistants we have today will become gifted.  Or what is the same;  they will be able to handle <strong>more data<\/strong> coming from the cameras, radars, sensors, lasers&#8230; of the vehicle and will allow the addition of new functions that connect the car with everything around it: other cars, the infrastructures&#8230; something that is essential to make the leap towards completely autonomous driving (from <strong>level 4 or<\/strong> <strong>5<\/strong>) in which driver intervention is not necessary.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A network to make them &#8216;gifted&#8217; Although the first tests for cars have already been carried out, a stable 5G network is necessary to make it a reality. But 5G will not only imply the arrival of the autonomous car, which is the great point that everyone is talking about, but also to greatly improve [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":528,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/525"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=525"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/525\/revisions"}],"predecessor-version":[{"id":937,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/525\/revisions\/937"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/528"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=525"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=525"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=525"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}