{"id":536,"date":"2022-05-14T17:29:54","date_gmt":"2022-05-14T17:29:54","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/14\/beware-the-latest-windows-11-update-breaks-your-programs\/"},"modified":"2022-05-18T15:59:32","modified_gmt":"2022-05-18T15:59:32","slug":"beware-the-latest-windows-11-update-breaks-your-programs","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/beware-the-latest-windows-11-update-breaks-your-programs\/","title":{"rendered":"Beware, the latest Windows 11 update breaks your programs"},"content":{"rendered":"<p>These updates to which we refer are part of the monthly cycle that the software giant sends us to solve the latest security flaws in its products.  This takes place on the second Tuesday of every month and is done specifically to fix the latest vulnerabilities discovered in supported versions of Windows.  But things do not always go as well as we would like, as is the case.  If we have installed the last cumulative update corresponding to the month of <strong>May 2022 for Windows 11<\/strong>we may have experienced problems.<\/p>\n<p>Specifically, we refer to <strong>patch KB5013943<\/strong> what is giving <strong>problems with installed applications<\/strong> in the team.  It must be said that some of these can be blocked after updating the new operating system.  In the same way, the affected programs may not open or have other problems related to their operation.  Let&#8217;s assume that Redmond released cumulative updates for all supported versions of their Windows operating system.<\/p>\n<p>Initially, the official notes of the aforementioned version KB5013943 speak of two <strong>problems affecting certain applications on some computers<\/strong>.  In addition, now Microsoft has also updated this list to reflect new bugs.  It must be said that the first was already present in the previous update, KB5012643.  This was launched at the end of April where some <strong>.NET Framework 3.5 applications<\/strong> they cannot start.  In turn, they present crashes and other failures after the installation of the update.<\/p>\n<h2>How to fix these bugs in Windows 11<\/h2>\n<p>The same problem affects the latest Windows 11 update, as we told you and that was sent a few hours ago.  As confirmed by Microsoft itself, after installing this update some .NET Framework 3.5 applications may have errors.  The affected software uses certain optional components of the component such as <strong>WCF<\/strong> Y <strong>WWF<\/strong>.  But at the same time the software giant provides us with a solution for all of this.<\/p>\n<p>We will only have to open a command prompt window with administrator permissions in order to execute the following commands:<\/p>\n<p> <code class=\"code-section\">dism \/online \/enable-feature \/featurename:netfx3 \/all<\/code> <code class=\"code-section\">dism \/online \/enable-feature \/featurename:WCF-HTTP-Activation<\/code> <code class=\"code-section\">dism \/online \/enable-feature \/featurename:WCF-NonHTTP-Activation<\/code> <\/p>\n<p>With this, what we really achieve is to reactivate the .NET Framework component of Windows, which should solve the error.  Still, if this doesn&#8217;t fix the problem, we can always <strong>uninstall the update on affected computers<\/strong>.  This is something that can be done through the Windows Settings application by going to Update and security and accessing the update history.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>On the other hand, if we focus on the second mentioned problem, <strong>affects computers with certain GPUs<\/strong>.  Here the firm has not given any further explanations, but points out that the applications can be closed unexpectedly.  These intermittent bugs affect some programs that use Direct3D, although no fix has been provided at this time.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>These updates to which we refer are part of the monthly cycle that the software giant sends us to solve the latest security flaws in its products. This takes place on the second Tuesday of every month and is done specifically to fix the latest vulnerabilities discovered in supported versions of Windows. But things do [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":538,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/536"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=536"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/536\/revisions"}],"predecessor-version":[{"id":935,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/536\/revisions\/935"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/538"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=536"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=536"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=536"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}