{"id":539,"date":"2022-05-14T22:01:18","date_gmt":"2022-05-14T22:01:18","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/14\/the-important-notice-from-sabadell-that-can-empty-your-accounts\/"},"modified":"2022-05-14T22:01:18","modified_gmt":"2022-05-14T22:01:18","slug":"the-important-notice-from-sabadell-that-can-empty-your-accounts","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/the-important-notice-from-sabadell-that-can-empty-your-accounts\/","title":{"rendered":"The Important Notice from Sabadell that can empty your accounts"},"content":{"rendered":"<p>The Internet has managed to make our lives easier.  It is very difficult not to see the long list of virtues that it has, to which, unfortunately, we must add another list of dangers almost as long.  If we are not careful, a small calculation error could cost us dearly, even more so with all the information that is directly related to bank details. <strong>A new scam of this type has been detected today<\/strong>and we tell you more about it.<\/p>\n<p>As we say, the Internet is full of scams or scams of all kinds.  Accessing the wrong portal or sending an email with sensitive information where it shouldn&#8217;t be can be terrible for us.  It is very important to be up to date with the new scams that are appearing on the net, since this will save us more than one scare.<\/p>\n<h2>This is the supposed Important Notice of Sabadell<\/h2>\n<p>This new scam detected is included within those known as phishing.  This type of scam is really dangerous, since what those responsible are looking for is <strong>impersonate another person or entity<\/strong> in order to access certain information.  Like everything, some appear on the Internet that are very easily detectable, either because the quality of the message was far from what would be a good message, or because they use email accounts with very strange names.<\/p>\n<p>That is not the case with this Important Notice from Sabadell, which is in fact very well done and could make more than one doubt its authenticity.  As usual, it has been the National Cybersecurity Institute (INCIBE) that has echoed him.  The procedure of this scam is very simple, and it starts with an email with the subject “<strong>Important announcement<\/strong>» that seems signed by the same bank.<\/p>\n<p>   <\/p>\n<p id=\"caption-attachment-1655598\" class=\"wp-caption-text\">This is the Fraudulent Important Notice (INCIBE).<\/p>\n<p>As you can see, in this email we are informed that our account and card have been blocked due to an operation that has not been completed correctly.  In order to unlock our services, we are given a URL that looks like Sabadell so that we can enter it and <strong>Let&#8217;s enter our access data<\/strong>.  This URL will obviously take us to another site that looks similar to Banco Sabadell, but is actually a fraudulent portal.  If we enter our access data and press enter, we will be supplying it to any cybercriminal, with all the consequences that this could have.<\/p>\n<p>INCIBE gives this scam <strong>an importance of 4 out of 5<\/strong> (high), and although so far it has only been detected in the name of Banco Sabadell, it is more than likely that it will end up appearing in the name of other banking entities.<\/p>\n<h2>Do this to avoid falling for this type of fraud<\/h2>\n<p>These types of scams are the culprit that one always has to be vigilant on the Internet, although luckily there are always things we can do to avoid falling into the trap. <strong>INCIBE itself gives us some guidelines for this<\/strong>and are the following:<\/p>\n<ul>\n<li>Do not open messages from unknown users or that you have not requested, delete them directly.  Do not answer in any case.<\/li>\n<li>Be very careful when following links, even if they come from recipients you know.  We must always check the URL, hovering over it to see if it is from the legitimate entity or if it is shortened.<\/li>\n<li>If an SMS has attached files, it is always better not to download them without checking that we know the sender and confirming that they have sent it to us.  If you download them, always use an antivirus before opening them.<\/li>\n<li>It is very important to see if the web page we are accessing has certificates, something that we can check to the left of the web address (in the padlock icon).  Otherwise, never provide personal data such as passwords or bank accounts.<\/li>\n<li>When in doubt, it is always better to consult the bank through one of its official channels.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>The Internet has managed to make our lives easier. It is very difficult not to see the long list of virtues that it has, to which, unfortunately, we must add another list of dangers almost as long. If we are not careful, a small calculation error could cost us dearly, even more so with all [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":541,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/539"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=539"}],"version-history":[{"count":0,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/539\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/541"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=539"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=539"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=539"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}