{"id":547,"date":"2022-05-15T03:03:03","date_gmt":"2022-05-15T03:03:03","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/15\/10-amazing-new-features-coming-to-fedora-36\/"},"modified":"2022-05-18T16:01:47","modified_gmt":"2022-05-18T16:01:47","slug":"10-amazing-new-features-coming-to-fedora-36","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/10-amazing-new-features-coming-to-fedora-36\/","title":{"rendered":"10 Amazing New Features Coming to Fedora 36"},"content":{"rendered":"<p>We have at our fingertips a multitude of Linux distributions, more or less advanced, that cover the needs of most users.  Now we are going to talk about a very popular one that has just been updated with a multitude of interesting integrated novelties, we refer to <strong>fedora 36<\/strong>.<\/p>\n<p>It is worth mentioning that all these new features will be very useful for both end users, companies and software developers.  In this way, the heads of this distro want to compete with the latest Linux releases that have been produced in recent months by the competition.  It is for all this that we want to talk about the most outstanding changes that you are going to find below.<\/p>\n<p>First of all, what we should know is that we are dealing with a solid and reliable operating system that was the delight of Linux lovers.  This is all you will find after <strong>install Fedora 36 on your computers<\/strong>.<\/p>\n<h2>What&#8217;s new coming to Linux Fedora 36<\/h2>\n<p>The first thing we will tell you is that the developers of this operating system have not wasted their time.  This is something that is clear after taking a look at everything that we are going to tell you next in the form of news that has just arrived.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<ul>\n<li><strong>Linux Kernel 5.17<\/strong>Note: Fedora 36 includes the latest Linux Kernel 5.17 with support for all current GPUs and other stability and performance improvements.<\/li>\n<li><strong>Gnome 42<\/strong>: This is the default desktop and is considered one of the most important changes.  It features the modern Shell based on <strong>GTK4<\/strong> and native apps.  It provides a fresh look with new components in its user interface.<\/li>\n<li><strong>Systemd message updates<\/strong>: here we will say that the messages of systemd become more friendly helping their understanding.<\/li>\n<li><strong>Using Wayland for NVIDIA drivers<\/strong>Note: Another big change is Fedora&#8217;s decision to make the Wayland protocol the default with NVIDIA&#8217;s proprietary driver from now on.<\/li>\n<li><strong>new fonts<\/strong>: Default fonts are changing in Fedora 36. This provides a better experience and more current text rendering.<\/li>\n<li><strong>App updates<\/strong>: Since many Fedora users are developers, the system provides them with the latest compilers, databases, and other packages.<\/li>\n<li><strong>updated spins<\/strong>: the so-called spins or system editions are also updated to their new stable versions.  Although not all desktop environments have annual major updates, bug fixes are always included here.<\/li>\n<li><strong>Admin for single users<\/strong>: Many Fedora system installations are for a single user, not shared or enterprise users.  Therefore Fedora 36 makes this single user the default administrator during installation.<\/li>\n<li><strong>Network Manager Configuration<\/strong>: The new version removes support for legacy configuration files from NetworkManager.  This is something that has evolved over the years and now uses more modern configuration files called keyfiles.<\/li>\n<li><strong>RPM Structure<\/strong>: In Fedora 36 the internal RPM package database was normally located in \/var.  But in this version it is moved to the \/usr directory.<\/li>\n<\/ul>\n<h2>How to update to the new version<\/h2>\n<p>After everything that we have told you, possibly the regulars of this Linux distribution want to update to the new version as soon as possible.  This is something we can do manually through the <strong>terminal<\/strong> of Fedora 35 using the following commands:<\/p>\n<p> <code class=\"code-section\">sudo dnf install dnf-plugin-system-upgrade<\/code> <code class=\"code-section\">sudo dnf system-upgrade download --releasever=36<\/code> <\/p>\n<p>In the same way we will have the possibility of <strong>download and install from scratch<\/strong> the new Fedora 36 from the official website of its developers.  In this way we will have direct access to all the news that we have told you about previously and enjoy this interesting new version.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We have at our fingertips a multitude of Linux distributions, more or less advanced, that cover the needs of most users. Now we are going to talk about a very popular one that has just been updated with a multitude of interesting integrated novelties, we refer to fedora 36. It is worth mentioning that all [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":549,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/547"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=547"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/547\/revisions"}],"predecessor-version":[{"id":974,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/547\/revisions\/974"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/549"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=547"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=547"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=547"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}