{"id":55,"date":"2022-05-05T16:28:03","date_gmt":"2022-05-05T16:28:03","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/05\/how-to-install-chrome-extensions-in-vivaldi\/"},"modified":"2022-05-18T15:50:57","modified_gmt":"2022-05-18T15:50:57","slug":"how-to-install-chrome-extensions-in-vivaldi","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/how-to-install-chrome-extensions-in-vivaldi\/","title":{"rendered":"How to install Chrome extensions in Vivaldi"},"content":{"rendered":"<p>Vivaldi is a web browser that, being based on Chromium, we can handle without problems if we are used to using other options such as Firefox or Chrome, since its interface is quite similar, showing us the navigation bar and the tabs on the main screen.  Although contrary to what happens with Firefox, this browser <strong>does not have its own extension store<\/strong>.  However, this can almost be considered a success, since we will not have problems and it will be possible to install any application that is available in the Chrome Store.<\/p>\n<p>By using the extensions we will be able to add new functions to Vivaldi, thereby greatly extending the functionalities of our browser that will go far beyond visiting web pages.  For this we will be able to make use of the add-ons found within the Chrome Web Store, as we will see below.<\/p>\n<h2>Is it safe to install extensions from Chrome?<\/h2>\n<p>extensions <strong>can be considered reliable<\/strong> when they are created by a developer that follows the Chrome Web Store Developer Program Policies, so if they are officially available on the web, we should not distrust them.  Google is responsible for reviewing all the accessories in its store to ensure that they are free of malware or that they can cause damage to our computer.<\/p>\n<p>Despite this, since the extensions are executed directly in our browser, it is important that <strong>let&#8217;s choose carefully what we install<\/strong> in it.  And there are situations where these add-ons can be used to access our computer and compromise our security, so it never hurts to be careful.<\/p>\n<p>It is also very important that <strong>let&#8217;s be careful and not abuse its use,<\/strong> since in that case they can compromise the performance of the browser, when we install more than we need and use.  And it is that, in general, the use of extensions consumes a lot of energy and system resources, so it can end up affecting slower browsing.<\/p>\n<p>Also, we should note that in some cases extensions made specifically for Chrome may behave differently when installed in Vivaldi and not work properly, although in most cases we shouldn&#8217;t have any issues.<\/p>\n<h2>Install extensions in Vivaldi<\/h2>\n<p>The<strong> Chrome Web Store<\/strong> is a store of web applications developed and maintained by Google to be installed Chrome.  Likewise, other Chromium-based web browsers like Vivaldi can also make use of its extensive content library.  Therefore, if we want to install any application in Vivaldi we will be able to do so by following a few simple steps.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>The first thing we are going to do is access the Chrome Web Store from our Vivaldi browser and explore its extensive catalog organized by categories (blogs, shopping, sports, productivity, accessibility, etc.), and in total we will have thousands of extensions to choose from. Once we find what we are looking for, just click on the button<strong> Add to Chrome<\/strong> and later in<strong> Add extension.<\/strong> This will mean that, even if we are not using the Google browser, the extension will still be added to Vivaldi, as it is fully compatible with its architecture.<\/p>\n<h3>Manage installed plugins<\/h3>\n<p>Once the desired plugins are installed, we can manage them from the Vivaldi Extensions page.  To access it, click on the “Menu” button that is located in the upper left (button with a circle and a V inside it).  This will open a drop-down menu where we must select “Tools” and then click on <strong>&#8220;Extensions&#8221;<\/strong>.  Likewise, if we prefer to use keyboard shortcuts, we can access it by pressing “Ctrl + Shift + E”.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-721488 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1651768083_676_How-to-install-Chrome-extensions-in-Vivaldi.jpg\" alt=\"Vivaldi extensions\" width=\"920\" height=\"332\"  \/><\/p>\n<p>From this page we will be able to see an overview of each of the extensions that we currently have installed, as well as have the ability to deactivate or remove those plugins that we no longer need and adjust the settings specifically for each extension.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-721482 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1651768083_423_How-to-install-Chrome-extensions-in-Vivaldi.jpg\" alt=\"Vivaldi manage extensions\" width=\"920\" height=\"483\"  \/><\/p>\n<p>If we want to disable any extension, just click on the blue button that we find inside the add-on window so that it turns white.  If what we want is to eliminate it completely, just click on its button.<strong> &#8220;Remove&#8221;<\/strong>and it will be erased without a trace.<\/p>\n<h3>Show extensions in the address bar<\/h3>\n<p>Vivaldi also allows us to choose between showing the extensions that we have installed in the address bar and hiding them behind a <strong>button toggle extensions<\/strong>, in case we prefer to keep our browser window cleaner.  Once activated, the Extension toggle button will be found at the end of the address bar.  To enable the toggle button we must do it from its Configuration section, which we access from its Menu button.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-721491 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1651768083_279_How-to-install-Chrome-extensions-in-Vivaldi.jpg\" alt=\"Vivaldi extensions visibility\" width=\"920\" height=\"479\"  \/><\/p>\n<p>Once in the Configuration section, we click on the Address bar section that we find in the menu on the left.  Now in the lower right part we must locate the section of <strong>“Visibility of extensions”.<\/strong> Here we will have three options to choose from.<\/p>\n<ul>\n<li>Toggle visibility of only hidden extensions<\/li>\n<li>Toggle visibility of all extensions<\/li>\n<\/ul>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-721494 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1651768083_232_How-to-install-Chrome-extensions-in-Vivaldi.jpg\" alt=\"button toggle extensions\" width=\"920\" height=\"152\"  \/><\/p>\n<p>Optionally, we can also check the “Show hidden extensions in a drop-down menu” section, which creates a button that, when clicked, shows all the extensions that we currently have hidden.<\/p>\n<p>Furthermore, it is possible <strong>reorder all buttons of each extension<\/strong> individual in the address bar by holding down the Shift key and dragging and dropping the extensions to the right place.  In this way we can keep it organized according to our preferences and be able to access them more comfortably.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Vivaldi is a web browser that, being based on Chromium, we can handle without problems if we are used to using other options such as Firefox or Chrome, since its interface is quite similar, showing us the navigation bar and the tabs on the main screen. Although contrary to what happens with Firefox, this browser [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":61,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/55"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=55"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/55\/revisions"}],"predecessor-version":[{"id":847,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/55\/revisions\/847"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/61"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=55"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=55"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=55"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}