{"id":565,"date":"2022-05-15T15:27:23","date_gmt":"2022-05-15T15:27:23","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/15\/how-to-voice-control-your-windows-pc\/"},"modified":"2022-05-18T16:01:47","modified_gmt":"2022-05-18T16:01:47","slug":"how-to-voice-control-your-windows-pc","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/how-to-voice-control-your-windows-pc\/","title":{"rendered":"How to voice control your Windows PC"},"content":{"rendered":"<p>Voice recognition is one of the latest additions that Microsoft has added to its Accessibility settings in Windows 10 and Windows 11. Through it, it offers users a wide set of voice commands that replace keyboard input, touch and the mouse, such as the ability to use your voice to write and format documents, control a device, enter numbers and text, etc.<\/p>\n<h2>What is Windows Speech Recognition<\/h2>\n<p>Windows Speech Recognition is a new accessibility tool that allows users to <strong>use your equipment using voice commands<\/strong>.  This feature belongs to the Accessibility family of tools, allowing us to perform a variety of tasks.  Having it activated we can open and switch between applications, browse the web and read and write emails, among other functions.  It also allows us to use voice commands to control keystrokes.  Also, the program works offline, so you don&#8217;t need to be connected to the Internet to use it.<\/p>\n<h3>Do not confuse Voice Dictation with Voice Recognition<\/h3>\n<p>It is possible that many may confuse the &#8216;Voice Recognition&#8217; function with the Voice Dictation function.  While the latter may look like the Voice Dictation feature on paper, the truth is that Voice Dictation can only be used for speech to text conversion, while Speech Recognition allows us to navigate our PC by interacting with the user interface elements present on your screen.<\/p>\n<p>The Voice Recognition feature, in addition to being useful for users with visual impairments, can also be useful for normal users who are physically busy with some other task, but can see the screen and dictate commands to operate Windows as if we had some hands free.  It can also be used for when we are resting lying on the sofa or in bed and we want to play songs on the computer without having to move.<\/p>\n<h2>Enable in Windows 11<\/h2>\n<p>To start using the Windows Voice Recognition function, the first thing we must do is enable it from the Windows 11 Settings menu, which we will access by pressing the Windows + I key combination. Then we click on the Accessibility section that we find in the left column.  Subsequently, on the right side we move to the bottom and within the section<strong> Interaction press on Voice<\/strong>.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>This will take us to a new screen where we will find the<strong> Windows speech recognition<\/strong> deactivated, because we click on the button so that it is shown as Activated.<\/p>\n<h2>Activate in Windows 10<\/h2>\n<p>To activate voice recognition in Windows 10 we must start by accessing the Configuration menu by pressing the Windows + I key combination. Then click on Accessibility.  On the next screen, in the left column we click on<strong> Voice<\/strong>.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-725421 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652628443_68_How-to-voice-control-your-Windows-PC.jpg\" alt=\"Speech recognition in Windows 10\" width=\"900\" height=\"632\"  \/><\/p>\n<p>Now on the screen on the right we find the section Dictate text and control the device by voice.  Here, in the section <strong>Activate speech recognition<\/strong> we see that it is deactivated so we press to show Activated.<\/p>\n<h2>Set up speech recognition<\/h2>\n<p>In the event that it is the first time that we activate the Voice Recognition function, a screen will appear where we must configure the system with our voice to be able to control it later.  On the next screen we must choose the type of microphone that we want to use, either with a headset, a desktop microphone or other types such as those that are integrated into the computer.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-725424 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652628443_662_How-to-voice-control-your-Windows-PC.jpg\" alt=\"Windows 11 microphone configured\" width=\"921\" height=\"761\"  \/><\/p>\n<p>Once finished we can improve the team&#8217;s ability to recognize spoken words by allowing the system to review documents and emails in the search index.  In this way the team will learn the words and phrases that will help us understand each other better when we speak.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-725427 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652628443_562_How-to-voice-control-your-Windows-PC.jpg\" alt=\"Improve speech recognition accuracy\" width=\"921\" height=\"761\"  \/><\/p>\n<p>Next, we can choose an activation mode, so that we can choose what will happen when we mention the mute command.  In case we choose the mode of <strong>manual activation<\/strong>, voice recognition is deactivated when we say Deactivate the microphone.  If we want to activate it again, just click on the microphone button or by pressing the keyboard shortcut Ctrl + Windows.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-725430 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652628443_167_How-to-voice-control-your-Windows-PC.jpg\" alt=\"Choose a voice recognition activation mode\" width=\"921\" height=\"761\"  \/><\/p>\n<p>In the case of choosing the <strong>voice activation mode<\/strong>voice recognition is suspended and can be activated by saying Activate microphone.<\/p>\n<p>On the next screen we can<strong> print a speech recognition reference card<\/strong> through a list of commands to which the computer can respond.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-725433 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652628443_20_How-to-voice-control-your-Windows-PC.jpg\" alt=\"Print a speech recognition reference card\" width=\"921\" height=\"761\"  \/><\/p>\n<p>We must also indicate if we want voice recognition to run every time we log on to the computer without having to do it manually.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-725439 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652628443_860_How-to-voice-control-your-Windows-PC.jpg\" alt=\"Run speech recognition at startup\" width=\"921\" height=\"761\"  \/><\/p>\n<p>Finally, before finishing the voice recognition configuration, they offer us the possibility of starting a tutorial with which we can learn and practice the voice commands with which we can control the equipment.<\/p>\n<h2>voice recognition commands<\/h2>\n<p>Next, we are going to see the different commands that we can use to get the most out of Windows 11 voice recognition.<\/p>\n<h3>Manage voice and microphone access<\/h3>\n<p>These commands will be useful to us to adjust the configuration of the voice control and\/or the microphone of the system.<\/p>\n<ul>\n<li>Get voice recognition to listen to us: voice access to activate \/ deactivate mute.<\/li>\n<li>Put speech recognition to sleep: silent<\/li>\n<li>Turn off microphone: turn off microphone.<\/li>\n<li>Close voice access: disable voice access.<\/li>\n<li>Show the list of commands we can use: what can I say<\/li>\n<li>Access the Speech Recognition settings menu: Open the speech recognition settings.<\/li>\n<li>Access the help menu for Speech Recognition: Speech Recognition Help.<\/li>\n<li>Switch to command-only mode: command mode.<\/li>\n<li>Access the Speech Recognition tutorial: speech recognition access guide.<\/li>\n<\/ul>\n<h3>control app<\/h3>\n<p>These commands are especially useful when we want to control an application using Windows Speech Recognition on our computer.<\/p>\n<ul>\n<li>Open a new app: open (app name).  For example, open Chrome.<\/li>\n<li>Close an already open application: close (application name. For example, close Chrome.<\/li>\n<li>Minimize or maximize an application window: maximize window or minimize window.<\/li>\n<li>Restore a window: restore window.<\/li>\n<li>Open task switcher: show task switcher.<\/li>\n<li>Go to Desktop: go to the desktop.<\/li>\n<li>Search in browser: search in (search engine) for (x).<\/li>\n<li>Fit Window: Fit window to (direction).  For example, fit window to top right.<\/li>\n<\/ul>\n<h3>Interaction for screen overlay<\/h3>\n<p>These commands will help us with actions that require a screen overlay.<\/p>\n<ul>\n<li>Show number overlays: Show numbers.<\/li>\n<li>Show number overlays in a specific app or window: Show numbers in (app name).  For example, show number in Word.<\/li>\n<li>Remove Number Overlays: Hide numbers or cancel.<\/li>\n<li>Select a numbered item: click (number).  For example, click 3.<\/li>\n<li>Show Grid Overlay – Show grid.<\/li>\n<li>Remove Grid Overlay: Hide grid or cancel.<\/li>\n<li>Go back to the previous state of the grid: undo or undo that.<\/li>\n<li>Mark an object to drag: mark or mark (number).  For example, dial 3.<\/li>\n<li>Drop the marked object at a location: drag.<\/li>\n<\/ul>\n<h3>Perform actions with the keyboard and mouse<\/h3>\n<p>We will use these commands to perform actions that are normally carried out with the keyboard and the mouse.<\/p>\n<ul>\n<li>Select an item: click or touch.<\/li>\n<li>Left-click or right-click an element: Left-click or Right-click.<\/li>\n<li>Double-click or triple-click an item: Double-click or triple-click.<\/li>\n<li>Press key or key combination: press (key 1) (key 2).  For example, pressing Control Shift Escape.<\/li>\n<li>Press a key several times: press (key) (count) times.  For example, press escape 4 times.<\/li>\n<li>Press and hold a key: hold down (key).  For example, holding down the escape key.<\/li>\n<li>Release the pressed key: release (key).<\/li>\n<li>Move mouse pointer continuously: move the mouse (direction).  For example, move the mouse down to the right.<\/li>\n<li>Stop moving the mouse pointer: stop.<\/li>\n<li>Pressing the escape key on your keyboard to close drop-down menus, such as context menus or drop-down menus: dismiss.<\/li>\n<\/ul>\n<p>We may not be able to remember all the commands while using the Windows Speech Recognition feature, so simply saying <strong>What can I say?<\/strong> And a complete list will appear on the screen.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Voice recognition is one of the latest additions that Microsoft has added to its Accessibility settings in Windows 10 and Windows 11. Through it, it offers users a wide set of voice commands that replace keyboard input, touch and the mouse, such as the ability to use your voice to write and format documents, control [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":573,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/565"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=565"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/565\/revisions"}],"predecessor-version":[{"id":968,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/565\/revisions\/968"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/573"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=565"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=565"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=565"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}