{"id":602,"date":"2022-05-16T13:39:05","date_gmt":"2022-05-16T13:39:05","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/16\/can-it-be-harmful-3-aspects-to-know-about-fast-charging-for-your-electric-car\/"},"modified":"2022-05-18T16:01:47","modified_gmt":"2022-05-18T16:01:47","slug":"can-it-be-harmful-3-aspects-to-know-about-fast-charging-for-your-electric-car","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/can-it-be-harmful-3-aspects-to-know-about-fast-charging-for-your-electric-car\/","title":{"rendered":"Can it be harmful?  3 aspects to know about fast charging for your electric car"},"content":{"rendered":"<h2>Fast charging, a second chance for the electric car<\/h2>\n<p>Recharging an electric car is a very simple process, but it goes beyond just plugging it into the mains.  And it is that to carry out the <strong>refills properly <\/strong>It will ensure that the state of our car&#8217;s battery is always optimal, and therefore the performance of the car as well.<\/p>\n<p>In the recharging process, factors such as power (Watts), voltage (Volts) and intensity (Amps) intervene, but also the type of battery that the car carries, or the cables that connect the vehicle with the post, the plugs or the charging station you use.  In those, however, a protagonist has appeared: fast charging for the electric car.<\/p>\n<p>It is the advances in the technology of fast chargers, which use direct current to introduce it into the batteries, that are really offering a <strong>second opportunity<\/strong> to electrified vehicles (also for those that are plug-in hybrids).  There are two developments in the design of direct current fast chargers that have contributed most to reducing recharging times: those aimed at controlling the high temperatures that occur in the cables and connectors, and those that reduce the current intensity by increasing the voltage.<\/p>\n<h2>What to know about her<\/h2>\n<p>The fast charge of the electric car consists of reaching and even surpassing the barrier of <strong>40 to 50 kW<\/strong> transmission of energy from the charger to the battery.  This, in itself, is already considered a level of fast charging for this class of vehicles.<\/p>\n<p>Although the cars themselves must also include batteries that allow a greater flow of electricity in less time without overheating, as the Hyundai Ioniq 5 does, fast charging technology focuses mainly on boosting the<strong> charger capacities<\/strong>, especially at service stations, since domestic chargers, for safety reasons, maintain a single-phase charge of between 2.3 and 7.4 kW of power.  But there are other aspects to take into account.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<h3>Can it be harmful?<\/h3>\n<p>This answer does not have a single answer, since, as it happens with our telephone, for example, everything will depend on the use you make of your electric car.  Thus, it is important that we know that the recommended percentage of charge in electric cars is between <strong>20% and 80%<\/strong> of its capacity, that is;  provided that the battery can be maintained between both percentages, that it does not drop below 20% of its charge and does not exceed 80% charge, especially if the vehicle is going to be left stationary.<\/p>\n<p>That said, in <strong>punctual moments<\/strong>Exceeding 80% of the charge or, on the contrary, the battery is discharged below 20%, it will not have major evils, but it is important that this range is maintained whenever possible, especially in daily use. .<\/p>\n<p>In this sense, making punctual charges and to make trips in fast chargers does not affect the health of the battery of your electric car.  Just <strong>may be affected<\/strong> the battery if you only use fast charges always even for day to day, in that case the degradation suffered by the battery will probably be faster and greater than normal.<\/p>\n<h3>It is done in direct current<\/h3>\n<p>At the same time, and as a point to consider about fast charging for your electric car, we must distinguish between mode 4 with &#8216;super fast&#8217; charging and mode 4 with &#8216;ultra fast&#8217; charging.  The latter is not recommended for daily charging since it can damage the battery if we use it regularly, as we mentioned.<\/p>\n<p>It is specially designed for <strong>outdoor public use stations<\/strong> such as charging stations, where we can recharge the vehicle during long journeys or specific situations in which we have little time.  This is what is done in <strong>DC<\/strong>, unlike the previous modes, which are carried out in alternating current.  Recharging points that use a charge of this type 4, in any case, are not designed or recommended for private garages.<\/p>\n<h3>It is important to recharge it when the battery is hot<\/h3>\n<p>Something no less important, and that may have an important consideration, is that when the battery is hot, the chemical processes accelerate.  This means that in this state, when connected to a charger, the <strong>electricity will flow faster<\/strong> and the recharge will speed up.  In fact, recharging a very cold battery can cause damage to it.<\/p>\n<p>Currently there are some models, such as those of Tesla, that have a <strong>preheat function<\/strong> of the battery.  If this feature is not available, it is highly recommended to go to the fast recharge point after driving for a couple of hours, so that, with complete certainty, the battery will be at a high temperature.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Fast charging, a second chance for the electric car Recharging an electric car is a very simple process, but it goes beyond just plugging it into the mains. And it is that to carry out the refills properly It will ensure that the state of our car&#8217;s battery is always optimal, and therefore the performance [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":604,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/602"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=602"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/602\/revisions"}],"predecessor-version":[{"id":961,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/602\/revisions\/961"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/604"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=602"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=602"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=602"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}