{"id":607,"date":"2022-05-16T14:35:41","date_gmt":"2022-05-16T14:35:41","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/16\/whats-new-in-android-tv-13-for-your-television\/"},"modified":"2022-05-18T16:01:47","modified_gmt":"2022-05-18T16:01:47","slug":"whats-new-in-android-tv-13-for-your-television","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/whats-new-in-android-tv-13-for-your-television\/","title":{"rendered":"What&#8217;s new in Android TV 13 for your television"},"content":{"rendered":"<p>Our Smart TVs are capable of more and more things, and that is partly due to their operating systems.  One of the most advanced that we have available is Android TV, which is a version of the same system that Android mobiles have but adapted to televisions.  Google is preparing to launch the new version of this (13), and now we can tell you <strong>some of the news that it will bring with it<\/strong>.<\/p>\n<p>Like any other operating system, the first step for it to reach our devices is for it to go through a series of tests or beta phases.  Android TV 13 was not going to be an exception to this principle, and for just a couple of days it has already been where it is. <strong>its second beta version<\/strong>.  Unfortunately, this is only available to developers, so we don&#8217;t have access to test it ourselves.<\/p>\n<h2>These are some of the novelties of Android TV 13<\/h2>\n<p>This second beta of Android TV 13 is excellent news compared to its first version, since this <strong>it arrived without any news<\/strong> compared to the current version of the operating system.  Now that the second is already &#8220;in the air&#8221;, we can tell you about some of the novelties that it has brought under its arm, and where we are going to find one of the most remarkable in the <strong>state change support for HDMI<\/strong>.<\/p>\n<p>If we go to the official notes of this new beta version, we will see that these state changes will be shown in the MediaSession cycle, the API that allows interaction with media controllers or volume keys.  This way, when an HDMI device is no longer the active source on the screen, <strong>playback will stop immediately<\/strong>and the device would enter a standby mode to reduce power consumption.<\/p>\n<p>   <\/p>\n<p id=\"caption-attachment-1654869\" class=\"wp-caption-text\">Android TV interface<\/p>\n<p>Another of the main novelties that we are going to find in Android TV 13 is going to be related to the so-called «<strong>Picture-in-Picture<\/strong>» or PIP.  The new version of Google&#8217;s operating system brings a considerable improvement in this field, and it is especially aimed at making better use of larger screens.  This mode will allow fonts to support resizing to optimally use the screen, and if the font does not support resizing, it will apply borders around the window to maintain the same size ratio. .  Android TV 13 will be the first release to support PIP on Google TV.<\/p>\n<h2>We will still have to wait to try it<\/h2>\n<p><strong>Google always launches betas of its products<\/strong> so that we can all test their new systems ahead of time, but in the case of Android TV 13 this is not yet possible.  Both the first beta and the second are only reserved for developers who want to test how their applications work on the system.<\/p>\n<p>In fact, not even these same developers can test Android TV 13 on a television, but rather <strong>they must use a specific development kit<\/strong>.  Therefore, we have no choice but to be patient and wait for more beta versions of this new operating system to arrive, although we must bear in mind that Google takes longer with it than with mobile OS.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Our Smart TVs are capable of more and more things, and that is partly due to their operating systems. One of the most advanced that we have available is Android TV, which is a version of the same system that Android mobiles have but adapted to televisions. Google is preparing to launch the new version [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":609,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/607"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=607"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/607\/revisions"}],"predecessor-version":[{"id":959,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/607\/revisions\/959"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/609"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=607"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=607"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=607"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}