{"id":615,"date":"2022-05-16T14:58:05","date_gmt":"2022-05-16T14:58:05","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/16\/microsoft-edge-free-vpn-reaches-some-users\/"},"modified":"2022-05-18T16:01:47","modified_gmt":"2022-05-18T16:01:47","slug":"microsoft-edge-free-vpn-reaches-some-users","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/microsoft-edge-free-vpn-reaches-some-users\/","title":{"rendered":"Microsoft Edge free VPN reaches some users"},"content":{"rendered":"<p>Maintaining a certain level of security and privacy on the Internet is increasingly complicated.  Even if we always use the latest versions of the protocols (HTTPS, TLS, DoH, etc), there are always ways in which either companies or hackers manage to bypass these security layers to take control of our data.  Internet giants, such as Microsoft, are aware of this.  And, for this reason, every so often we can find new security measures that seek to help us reinforce this security.  And one of the latest is a free VPN that is going to reach the Edge.<\/p>\n<p>A couple of weeks ago, Microsoft announced the release of one of the best features coming to Edge this year.  Under the name of <strong>Microsoft Secure Network<\/strong>, the company is going to offer all users of its Edge browser a completely free VPN, offered by Cloudflare.  The main objective of this function is to allow users who connect to the Internet from public networks (such as bars, stations, at work, etc.) to be able to browse more securely, preventing their data from leaking and being captured by hackers or other users connected to the network.<\/p>\n<p>Microsoft Secure Network will offer users <strong>1 GB of secure traffic per month<\/strong>, being able to activate and deactivate this function whenever we want.  Unlike other similar services (such as Opera) that we can pay to get more gigabytes of traffic, this is a closed service.  That is, when we finish the gigabyte of secure traffic, we will not be able to connect to the network until the following month.<\/p>\n<h2>How to know if I have the VPN available<\/h2>\n<p>Microsoft has already begun to activate this function to some users, although, at the moment, to a very limited number.  The first thing we need to be able to test this new browser function is to have the <strong>Canary version of it<\/strong>.  That is, the most advanced version of the development.  Right now, the first versions that have started to receive this feature are from 103.0.1255.0 onwards.<\/p>\n<p>But not all users who have this version installed will be able to see this feature.  Microsoft uses, like other times, two A\/B test groups where only one of them is activated and to have more control over possible problems.  If we have been selected to test this function, we can find it in the options menu, under the “read aloud” section.  And from there we can activate or deactivate it according to the needs of the moment.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>We must bear in mind that, in order to use it, we will have to log in with our Microsoft Account in the browser.  And agree to Cloudflare&#8217;s terms of use before you start browsing their VPN.  In addition, it is not a zero-log VPN that guarantees extreme anonymity, but, as its terms of use indicate, they will save &#8220;limited diagnostic data&#8221; for 25 hours.  Despite this, if what we are looking for is just to hide our IP and location, and skip regional restrictions, it will be more than enough.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Maintaining a certain level of security and privacy on the Internet is increasingly complicated. Even if we always use the latest versions of the protocols (HTTPS, TLS, DoH, etc), there are always ways in which either companies or hackers manage to bypass these security layers to take control of our data. Internet giants, such as [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":617,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/615"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=615"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/615\/revisions"}],"predecessor-version":[{"id":957,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/615\/revisions\/957"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/617"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=615"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=615"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=615"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}