{"id":618,"date":"2022-05-16T15:45:54","date_gmt":"2022-05-16T15:45:54","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/16\/134-security-holes-in-word-and-adobe-acrobat\/"},"modified":"2022-05-18T16:01:47","modified_gmt":"2022-05-18T16:01:47","slug":"134-security-holes-in-word-and-adobe-acrobat","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/134-security-holes-in-word-and-adobe-acrobat\/","title":{"rendered":"134 security holes in Word and Adobe Acrobat"},"content":{"rendered":"<p>We should not worry because there are security holes in our equipment, although it is evidence that they exist.  Many of them have not yet been exploited, hence so much effort and resources are spent to detect and patch them as soon as possible.  On the stage of <strong>Black Hat Asia<\/strong> This year, a conference that took place in Singapore focused on computer security, a tool has been presented that has discovered 134 security holes in two of the most used programs in the world.<\/p>\n<h2>Some of these holes are dangerous<\/h2>\n<p>This tool, called &#8220;Cooper&#8221;, has proven to be quite efficient when it comes to its operation.  All these security flaws have been discovered by her, although it should be noted that <strong>the 134 are not as dangerous<\/strong>.  Of all this amount, there is a total of 59 that the developers of both software have considered worth fixing;  33 who have been assigned a CVE number, and 17 who have even been given a &#8220;reward&#8221; that will be taken by the one or those who manage to solve it.<\/p>\n<p>One of those responsible for the creation of &#8220;Cooper&#8221;, Xu Peng, explained during the event that both Word and Acrobat accept scripting language input.  In fact, Acrobat even allows <strong>Java Script manipulate PDF files<\/strong>.  This requires the PDF to define native PDF objects and parse the JavaScript code.  Acrobat modules render the native objects, and a built-in JavaScript engine handles the scripts.<\/p>\n<p>This code, in the words of Xu Peng and the rest of his contributors, &#8220;is prone to inconsistent semantics and security holes, leading to serious vulnerabilities.&#8221;  As we have told you a little above, not all of these security flaws are equally serious, but, for example, we have two of them (CVE-2021-21028 and CVE-2021-21035) that are very important and have been dice <strong>a score of 8.8 out of 10 in Acrobat<\/strong>.<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1654236\" class=\"wp-caption-text\">An Adobe Security Flaw Considered &#8216;Very Dangerous&#8217;<\/p>\n<h2>A tool that can give a lot to talk about<\/h2>\n<p>The development of &#8220;Cooper&#8221; <strong>This is great news for computer security.<\/strong>.  It has been developed by Xu Peng and Professor Purui Su, both from the Chinese Academy of Sciences, security researcher Yanhao Wang from the QI-ANXIN Technology Research Institute, and Hong Hu, an assistant professor from Pennsylvania State University.<\/p>\n<p>The tool itself is a set of scripts that manages to infer in the process by which some scripts or applications can produce unwanted and\/or dangerous behavior.  Their creators <strong>They have made it available to everyone for free.<\/strong>so if you are curious to know more about it, all you have to do is go to its website on GitHub.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We should not worry because there are security holes in our equipment, although it is evidence that they exist. Many of them have not yet been exploited, hence so much effort and resources are spent to detect and patch them as soon as possible. On the stage of Black Hat Asia This year, a conference [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":620,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/618"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=618"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/618\/revisions"}],"predecessor-version":[{"id":956,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/618\/revisions\/956"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/620"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=618"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=618"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=618"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}