{"id":62,"date":"2022-05-06T02:40:55","date_gmt":"2022-05-06T02:40:55","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/06\/the-cnmv-prohibits-binance-from-trading-futures\/"},"modified":"2022-05-18T15:50:57","modified_gmt":"2022-05-18T15:50:57","slug":"the-cnmv-prohibits-binance-from-trading-futures","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/the-cnmv-prohibits-binance-from-trading-futures\/","title":{"rendered":"The CNMV prohibits Binance from trading futures"},"content":{"rendered":"<p>If we talk about places to buy cryptocurrencies, it is impossible not to include Binance.  This cryptocurrency exchange platform is the largest and has the most users around the world.  The platform, founded in China, but currently based in the Cayman Islands, has not yet obtained in Spain the necessary guarantee certificate issued by the Bank of Spain, and <strong>one of the great stumbling blocks to obtain it is futures operations<\/strong>.<\/p>\n<p>At the moment, <strong>Binance is on a “grey list”<\/strong> created by the National Securities Market Commission (or CNMV).  This list includes those platforms or entities that have not yet been able to obtain this certificate, but are considered suitable for it.  Binance has been working hard in recent months to overcome any type of stumbling block that could prevent obtaining it, and for the CNMV that stumbling block is precisely in this type of operation.<\/p>\n<h2>An essential certificate to operate in Spain<\/h2>\n<p>As we say, the presence of Binance on that list does not prevent it from operating in our country, <strong>but his stay in it cannot be something permanent<\/strong>.  This certification that we are talking about would allow it to adhere to the official register of service providers for exchanging virtual currency for fiduciary currency and custody of electronic purses, as it is officially called by the Bank of Spain.<\/p>\n<p>Being based in Cayman Island, Binance is in a kind of regulatory limbo, but to operate in our country it is necessary that they &#8220;religiously&#8221; comply with <strong>the Money Laundering Law<\/strong> and with the commercial and professional honorability requirements that prevail in credit institutions.  Binance has not put any impediment to this to date, however, the CNMV has been with futures operations &#8220;in its sights&#8221; for some time.<\/p>\n<p>In this way, the CNMV has prohibited Binance from operating with this type of securities, something that has led the platform to <strong>almost instantly remove them from your offer<\/strong>.  The only doubt that would remain in this regard would be to see what happens with the operations that have already been carried out, but the logical thing would be to think that the CNMV will force Binance to suspend them, but not before allowing its clients to withdraw their investments.<\/p>\n<h2>Futures trading, very dangerous<\/h2>\n<p>Trading futures, especially with leverage, carries very high risks that could make anyone a fortune.  When we bet on futures, what we are doing is committing ourselves to <strong>sell at a future date at a price already determined in advance<\/strong>, regardless of the actual value on that date.  These futures are already high risk, but they are even more risky when coupled with leverage.<\/p>\n<p>Simply explained, <strong>leverage consists of investing with capital that we do not have<\/strong>.  To illustrate one of these operations, we can look at the image that you have just below.  This tells us that with a capital of $5,676 we would be investing that amount multiplied by 25, that is, more than $140,000.  This investment tells us that we would be earning $4,300, 73% of what was invested.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>At first glance, this may sound very beneficial to us, but we must bear in mind that although the profits may be much higher, so are the losses, which could far exceed the initial investment.  When we combine these two elements we find ourselves before a type of operation designed only for the most expert, <strong>and hence all the suspicion expressed by the CNMV<\/strong>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If we talk about places to buy cryptocurrencies, it is impossible not to include Binance. This cryptocurrency exchange platform is the largest and has the most users around the world. The platform, founded in China, but currently based in the Cayman Islands, has not yet obtained in Spain the necessary guarantee certificate issued by the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":64,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/62"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=62"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/62\/revisions"}],"predecessor-version":[{"id":846,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/62\/revisions\/846"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/64"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=62"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=62"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=62"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}