{"id":627,"date":"2022-05-16T22:36:58","date_gmt":"2022-05-16T22:36:58","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/16\/telefonica-will-complete-its-offer-with-satellite-internet-in-rural-areas\/"},"modified":"2022-05-18T16:05:42","modified_gmt":"2022-05-18T16:05:42","slug":"telefonica-will-complete-its-offer-with-satellite-internet-in-rural-areas","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/telefonica-will-complete-its-offer-with-satellite-internet-in-rural-areas\/","title":{"rendered":"Telefónica will complete its offer with satellite Internet in rural areas"},"content":{"rendered":"<p>Telefónica Global Solutions (TGS), a subsidiary of the global telecommunications company, and OneWeb will collaborate to expand connectivity in Europe and Latin America <strong>reaching remote regions where it was previously unable to serve<\/strong>.<\/p>\n<h2>OneWeb Satellite Internet<\/h2>\n<p>OneWeb is a Low Earth Orbit (LEO) satellite communications company.  You are implementing a <strong>constellation of low earth orbit satellites<\/strong> with a global gateway station network and a range of user terminals to provide affordable, fast, high-bandwidth, low-latency communications service.<\/p>\n<p><\/p>\n<p id=\"caption-attachment-1654965\" class=\"wp-caption-text\">OneWeb<\/p>\n<p>By signing this agreement, TGS will be able to offer OneWeb&#8217;s low latency cellular backhaul services that will help enhance the existing one and support network upgrades to 4G\/5G.<\/p>\n<p>The same way, <strong>will also provide backhaul<\/strong> backup for critical sites and available capacity for special events.  Where backhaul does not currently exist, the OneWeb service will help expand Telefónica&#8217;s mobile coverage and extend business connectivity.<\/p>\n<p>“This deal is fantastic news for communities across Europe and Latin America, who will benefit from increased and better network coverage.  OneWeb believes that our network is unique and plays a crucial role in providing connectivity in the most difficult to access areas around the world, which is why we look forward to working with Telefónica to offer greater Internet performance and availability to customers. », commented the CEO of OneWeb, Neil Masterson.<\/p>\n<h2>The combination of Telefónica and OneWeb<\/h2>\n<p>This association between Telefónica Global Solutions and OneWeb will serve to allow a <strong>greater range of possibilities for users<\/strong>.  At a particular level, it will allow the use of new OTT applications and services to expand mobile connectivity.<\/p>\n<p><iframe title=\"Teléfonica Global Solutions - SatelliteSolutions (Spanish subtitles)\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/Yfpz7FPzGL8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe><\/p>\n<p>As for companies, for example SMEs (small and medium-sized companies) will be able to use OneWeb&#8217;s low orbit satellite technology to expand their business networks.<\/p>\n<p>Large organizations, such as governments, telcos and Internet providers in rural and remote areas will also be able to benefit from the combination of Telefónica&#8217;s fiber network that we mentioned earlier, in conjunction with OneWeb&#8217;s low latency broadband service.<\/p>\n<p><img viewbox=\"0 0 3 2\" aria-describedby=\"caption-attachment-1654980\" loading=\"lazy\" class=\"size-large wp-image-1654980\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652740618_589_Telefonica-will-complete-its-offer-with-satellite-Internet-in-rural.jpg\" alt=\"Country Connection\" width=\"648\" height=\"500\"><\/p>\n<p id=\"caption-attachment-1654980\" class=\"wp-caption-text\">Country Connection<\/p>\n<p>“Our goal is to empower our customers&#8217; businesses by connecting them to the world through innovative broadband solutions.  By partnering with OneWeb, we are able to increase our portfolio by offering solutions that require low latency.  Our expertise will be essential in adapting OneWeb&#8217;s solution to deliver corporate, B2B and cellular backhaul services and help drive adoption of critical business applications in hard-to-connect areas.  We are focused on helping our B2B and wholesale clients drive transformational change in their businesses, and we believe our partnership with OneWeb will help us do just that,&#8221; said Julio Beamonte Aisa, CEO of Telefónica Global Solutions.<\/p>\n<p>In this way, OneWeb will be one more alternative to the TGS catalogue, which already offers satellite solutions that adapt to your connectivity needs with the maximum quality guarantees.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Telefónica Global Solutions (TGS), a subsidiary of the global telecommunications company, and OneWeb will collaborate to expand connectivity in Europe and Latin America reaching remote regions where it was previously unable to serve. OneWeb Satellite Internet OneWeb is a Low Earth Orbit (LEO) satellite communications company. You are implementing a constellation of low earth orbit [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":630,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/627"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=627"}],"version-history":[{"count":2,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/627\/revisions"}],"predecessor-version":[{"id":997,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/627\/revisions\/997"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/630"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=627"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=627"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=627"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}