{"id":673,"date":"2022-05-17T11:19:41","date_gmt":"2022-05-17T11:19:41","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/17\/the-5-things-they-dont-tell-you-about-the-new-mimovistar\/"},"modified":"2022-05-18T16:03:38","modified_gmt":"2022-05-18T16:03:38","slug":"the-5-things-they-dont-tell-you-about-the-new-mimovistar","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/the-5-things-they-dont-tell-you-about-the-new-mimovistar\/","title":{"rendered":"The 5 things they don&#8217;t tell you about the new miMovistar"},"content":{"rendered":"\n<p>Then, if we want television, we have to add the Essential package <strong>for 10 euros per month<\/strong> and, from there, add other football, fiction, sports or Netflix.  Finally, there are other services such as Movistar Prosegur Alarmas, Movistar Salud or Xbox Game Pass to complete the offer.<\/p>\n<h2>Legal conditions of miMovistar<\/h2>\n<p>Reviewing the legal texts of the new rates, we have found some interesting aspects that are worth knowing:<\/p>\n<h3>In ADSL you will only navigate at 11.5 megabytes<\/h3>\n<p>Although Movistar is the operator with the most fiber in our country and one of those with the most fiber in all of Europe, the truth is that there are still people who must be served with the old ADSL.  In this case, they will only have <strong>11.5Mbps speed.<\/strong><\/p>\n<p>For their part, if they live in remote areas without fiber or ADSL, they will have radio access, that is, using their 3G or 4G networks.  Here the speed will rise slightly to 20 Mbps. Without a doubt, the arrival of 5G in these areas will be a good opportunity to improve these conditions.<\/p>\n<h3>Be careful if you exceed the 550 minutes of calls to mobiles<\/h3>\n<p>The miMovistar rates include 550 minutes of calls to mobiles from the landline, being <strong>500 minutes on weekends<\/strong> and 50 minutes on weekdays.  If we go overboard, we can get a surprise on the bill since the prices are:<\/p>\n<p>Calls from landlines directed to national mobile destinations that exceed the franchise that includes, where appropriate, the contracted product, will have the following cost: call establishment: <\/p>\n<p>€0.2893, (€0.35 VAT included) and price per minute: €0.2066, (€0.25 VAT included)<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1637016\" class=\"wp-caption-text\">Frequently asked questions miMovistar<\/p>\n<h3>The secondary line and its 40 cents of establishment<\/h3>\n<p>The operator continues to include a secondary line in all rates with conditions that are difficult to explain.  This includes 5GB, which is not bad for a secondary line, but still applies a <strong>fixed cost of 40 cents<\/strong> for each call we make for call establishment.<\/p>\n<p>In addition, we can only share the data in the Max mode and have a common bag of 35 gigabytes.  In case of doing it in unlimited modes, they will automatically lose unlimited data and we will only have 25GB to browse that month.<\/p>\n<h3>Satellite television does not have it all<\/h3>\n<p>In the event that Movistar is forced to install satellite television as it does not have fiber at home, the customer <strong>will lose a number of benefits<\/strong> What:<\/p>\n<p>In the case of satellite TV service provision: Satellite TV does not include U7D (Last Seven Days), recording service or Home Multiaccess with Movistar Plus+ on devices. <\/p>\n<p>In addition, you will have to pay a registration fee:<\/p>\n<p>With the simultaneous contracting of the satellite TV supply service and of any Fusion modality, in the case of customers with fiber coverage, the subscription fee for the satellite TV supply service will be €75.<\/p>\n<h3>Free device, but depending on where you live<\/h3>\n<p>In the legal conditions it is indicated that the clients will have a free device except those of <strong>Movistar Max<\/strong> in regulated areas.  The operator explains that this is:<\/p>\n<p>Regulated area: Those addresses that are not within any of the municipalities of the territory of Spain in which the CNMC has identified at the regulatory level that there is effective competition between operators in fiber optic networks to the home and, declared by the same as Competitive Zone.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Then, if we want television, we have to add the Essential package for 10 euros per month and, from there, add other football, fiction, sports or Netflix. Finally, there are other services such as Movistar Prosegur Alarmas, Movistar Salud or Xbox Game Pass to complete the offer. Legal conditions of miMovistar Reviewing the legal texts [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":675,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/673"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=673"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/673\/revisions"}],"predecessor-version":[{"id":982,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/673\/revisions\/982"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/675"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=673"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=673"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=673"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}