{"id":676,"date":"2022-05-17T13:45:03","date_gmt":"2022-05-17T13:45:03","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/17\/when-does-daylight-saving-time-change-and-what-happens-to-your-devices\/"},"modified":"2022-05-18T16:04:58","modified_gmt":"2022-05-18T16:04:58","slug":"when-does-daylight-saving-time-change-and-what-happens-to-your-devices","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/when-does-daylight-saving-time-change-and-what-happens-to-your-devices\/","title":{"rendered":"When does daylight saving time change and what happens to your devices"},"content":{"rendered":"<p>Spring is almost here, and like every year, this means that it will soon arrive. <strong>the time change to adopt daylight saving time<\/strong>.  This is an event that is always disruptive, and since you may be wondering when it is, we are going to tell you the exact date on which the time change is made and what is going to be done.<\/p>\n<p>And since this is Xataka Basics, we are going to take advantage of this information to tell you <strong>what you need to know about changing the time on your devices<\/strong>.  Fortunately, in most cases you won&#8217;t have to do anything, but there are always some details that are important to keep in mind.<\/p>\n<h2>When do we go into daylight saving time?<\/h2>\n<p>Spring will arrive in Spain next Sunday, March 20, however, the time change will take place a few days later.  Specifically, <strong>we will change the time at dawn from Saturday 26 to Sunday 27 March<\/strong> in this 2022. As always, the change will take place during the early morning.<\/p>\n<p>So that you have all the data, in the early hours of Sunday 27, <strong>at 2:00 AM it will become 3:00 AM<\/strong>.  This means that, on that night from Saturday to Sunday, we will have one hour less to sleep.  This is something you should keep in mind, especially if you have something to do the next day, because if there is a device where the time is not changed, you could be an hour late.<\/p>\n<h2>The time change and your devices<\/h2>\n<p><strong>Almost all devices connected to the Internet will change the time automatically<\/strong>, which means that your computer, your laptop, your mobile, your smart watch, your tablet, or your smart speaker devices will surely do it by themselves.  Come on, if you use your mobile or watch as an alarm clock, or you do it with your smart speaker, you won&#8217;t have to worry about anything.<\/p>\n<p>Nevertheless, <strong>you should be careful with unconnected devices<\/strong>, those that we could refer to as &#8220;non-intelligent&#8221; devices.  Your oven, your refrigerator, the timer of your air conditioner or the alarm clock on your bedside table may not change the time by themselves.<\/p>\n<p>In summary, if you are a person who has already embraced the use of smart devices, and both your agenda and your alarms are centralized on your mobile or other similar device, you will not have any problem with the time change.  Even <strong>if you have an alarm clock set on the 27th<\/strong>the time will be changed during the early morning and the alarm clock will ring at the updated time.<\/p>\n<p><\/p>\n<p>However, one thing to remember is that <strong>for your devices to automatically change the time you must have them configured in European time<\/strong>.  If, for example, you had a device set to American time, then it would stick to that time, and not change the time.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Spring is almost here, and like every year, this means that it will soon arrive. the time change to adopt daylight saving time. This is an event that is always disruptive, and since you may be wondering when it is, we are going to tell you the exact date on which the time change is [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":678,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/676"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=676"}],"version-history":[{"count":2,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/676\/revisions"}],"predecessor-version":[{"id":995,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/676\/revisions\/995"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/678"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=676"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=676"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=676"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}