{"id":679,"date":"2022-05-17T14:56:38","date_gmt":"2022-05-17T14:56:38","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/17\/what-is-free-software-characteristics-advantages-and-examples\/"},"modified":"2022-05-18T16:03:38","modified_gmt":"2022-05-18T16:03:38","slug":"what-is-free-software-characteristics-advantages-and-examples","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/what-is-free-software-characteristics-advantages-and-examples\/","title":{"rendered":"What is free software: characteristics, advantages and examples"},"content":{"rendered":"\n<p>Using free software is making use of a political and ethical choice that claims the right to learn and share what we learn from others.  Possibly the best known example of free software is Linux, an operating system that many people use as alternatives to Windows or other proprietary operating systems.  Systems like Ubuntu or Debian are a clear example of a Linux package distributor.<\/p>\n<p>On many occasions, the term free software<strong> confused with freeware<\/strong>a term that describes software that is free to download and use but may contain restrictions on its modification and reuse.<\/p>\n<h3>And what is the GPL?<\/h3>\n<p>Along with the meaning of free software, we must also know what the GPL is.  This is nothing more than a software license that is currently administered by the FSF (Free Software Foundation) and has been revised to better protect the privacy of these software users.  And it is that the GPL can be considered as a kind of<strong> &#8220;Bill of Rights&#8221;<\/strong> which offers four types of freedoms.<\/p>\n<ul>\n<li>The freedom to run the software for any purpose.<\/li>\n<li>The freedom to study the source code and change the software for any purpose.<\/li>\n<li>The freedom to share the software with others.<\/li>\n<li>The freedom to share your own modified versions of the software with others.<\/li>\n<\/ul>\n<p>The only one <strong>restriction<\/strong> The one it counts on is that if we share a modified version of the GPL software, we must also have a GPL license.  This is called &#8220;copyleft&#8221;, which is a play on words with &#8220;copyright&#8221;, and ensures that free software remains free.<\/p>\n<h3>Differences between free software and open source software<\/h3>\n<p>There are not a few occasions when<strong> the terms free software and open source software are confused<\/strong>.  And it is that open source is another term attributed to software that can be studied, shared and modified and its main initiative is based on open source, many of whose objectives are similar to those of free software.<\/p>\n<p>For example, others must be allowed to distribute open source software, either for free or for a fee.  Modifications are also permitted and must be distributed under the same terms as the original software.  In addition, discrimination is discouraged, whether against any person or use that may be given to the software.<\/p>\n<p>Although the objectives of both free software and open source software are similar, the truth is that in what <strong>they differ is in their values<\/strong>.  While free software is a social movement that promotes freedom, the open source movement promotes the commercial benefits of sharing source code.  Therefore, open source software is recognized as an effective way for developers to collaborate.<\/p>\n<h2>Advantages and disadvantages of free software<\/h2>\n<p>From the practical perspective of any user, the use of free software has both advantages and disadvantages.  In fact, its main attraction is related to its economic cost, although often free is not synonymous with quality.  That is why we must know what the most important aspects of this type of program are.<\/p>\n<h3>Main advantages<\/h3>\n<p>The use of free software has many advantages since these programs have been designed to meet the needs of users.  Some of the most important are:<\/p>\n<ul>\n<li><strong>Accessibility:<\/strong> since it allows us full access to the software<\/li>\n<li><strong>Innovation<\/strong>: the greater the access, the greater will be its cooperative technological innovation.<\/li>\n<li><strong>Independence<\/strong>: each user has the possibility of adapting the software to their preferences, as well as creating their own functions.<\/li>\n<li><strong>security and privacy<\/strong>: by having the source code, we can ensure that our information is safe, making it easier to adapt the program to any need.<\/li>\n<li><strong>low-cost<\/strong>: Since it has a community behind it that supports its development, the program ends up being an economical option that has a direct impact on the user.<\/li>\n<\/ul>\n<h3>Main drawbacks<\/h3>\n<p>Despite its advantages, not everything is perfect within free software, since we must also take into account some negative aspects such as:<\/p>\n<ul>\n<li><strong>variety of versions<\/strong>: Since it is free software, anyone can create different versions of the same program, which can cause confusion among users.<\/li>\n<li><strong>There is no guarantee<\/strong>: The software belongs to the community, so there is no one responsible in case we have any problem or mishap when using it.<\/li>\n<li><strong>QA<\/strong>: It is provided by the community, which can be a problem if it is not active and cannot fix the bugs that are raised.<\/li>\n<li><strong>No advertising<\/strong>: since it is cheap, it lacks advertising, so it has more difficulty reaching the user, unlike private software.<\/li>\n<\/ul>\n<h2>Essential free programs<\/h2>\n<p>Once we know everything about free software, it is worth learning about the most important programs that make use of it.  Surely, on many occasions we will know the program itself, but we are unaware that it is conceived as free software.<\/p>\n<h3>GIMP, the alternative to Photoshop<\/h3>\n<p>We are talking about a free software conceived to carry out tasks of photographic retouching and composition and images.  It has different features that make it possible to use it as a painting program, photo retouching or as a system to process a large number of images.  Many of its functions are the same as the popular Photoshop tool, so, except for very advanced professional needs, it is considered a great alternative to it.  In addition, it allows the use of plugins to improve its functionalities.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>We can download GIMP for free for both Windows, macOS and Linux computers from its website.<\/p>\n<h3>LibreOffice, the alternative to Microsoft Office<\/h3>\n<p>It is a package of office applications such as a word processor (Writer), a spreadsheet (Excel) and a program to prepare presentations (Impress), which is why it is positioned as the main free software alternative to Microsoft Office .  Office files can be opened in LibreOffice and vice versa, its commands are similar and its environment is more minimalist and simple compared to the Microsoft suite.  That is why it has everything that we may need to make office use of the PC without complications and without having to pay any license.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-655728 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652799398_128_What-is-free-software-characteristics-advantages-and-examples.jpg\" alt=\"libreoffice templates\" width=\"1000\" height=\"514\"  \/><\/p>\n<p>LibreOffice can be downloaded for free for both Windows and Linux and macOS from its official website.<\/p>\n<h3>Mozilla Firefox, the alternative to browsing with Chrome<\/h3>\n<p>If we talk about free software, it would be a sin not to mention Mozilla Firefox, one of the most used programs on computers such as Windows, Linux or macOS, becoming one of the preferred free options for browsing the Internet.  And it is that contrary to what many people may think, Chrome is neither free nor open source software, despite being from Google, since it has a large number of proprietary components inside.  That is why, if we do not want to have a whole series of “robots” that track our information to sell it later, Firefox is the best option.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-604314 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652799398_36_What-is-free-software-characteristics-advantages-and-examples.jpg\" alt=\"Firefox on W11\" width=\"1000\" height=\"620\"  \/><\/p>\n<p>We can download Mozilla Firefox for free from its official website.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Using free software is making use of a political and ethical choice that claims the right to learn and share what we learn from others. Possibly the best known example of free software is Linux, an operating system that many people use as alternatives to Windows or other proprietary operating systems. Systems like Ubuntu or [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":683,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/679"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=679"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/679\/revisions"}],"predecessor-version":[{"id":980,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/679\/revisions\/980"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/683"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=679"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=679"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=679"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}