{"id":69,"date":"2022-05-06T09:27:47","date_gmt":"2022-05-06T09:27:47","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/06\/can-i-program-the-operating-hours-of-transmission\/"},"modified":"2022-05-18T15:50:57","modified_gmt":"2022-05-18T15:50:57","slug":"can-i-program-the-operating-hours-of-transmission","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/can-i-program-the-operating-hours-of-transmission\/","title":{"rendered":"Can I program the operating hours of Transmission?"},"content":{"rendered":"<p>There is no doubt that one of the main objectives we seek with this type of task is fluidity in both downloading and uploading files.  Keep in mind that these networks that we are talking about are generally used to work with large files.  They offer us a reliability that we do not normally find in <strong>conventional downloads that we carry out through the browser<\/strong> Web.  That is precisely why both end users and companies opt for this method.<\/p>\n<p>The first thing we must do to achieve the best results is to choose the client that we are going to install on our computer.  Most of them are free or at least offer us a free version.  Here we want to focus on the open source project called Transmission that we can use for free and that is characterized by its reliability and good performance.  In addition, being a software <strong>Open Source<\/strong> it does not hide backdoors or any type of unreliable code, as other proposals are suspected.  in turn is <strong>ad free<\/strong> and from unwanted programs trying to install themselves.<\/p>\n<p>But whatever proposal of this type we choose, we must also keep in mind that it is convenient to configure it properly.  It is true that most Torrent clients of <strong>by default they are already configured to work<\/strong>.  This is very useful for the most inexperienced users.  But Torrent clients also offer parameters that we can configure and customize to get the most out of the application.<\/p>\n<h2>Schedule the start-up of Transmission<\/h2>\n<p>If we talk about the aforementioned program called <strong>Transmission<\/strong>, some of you may be wondering if we have the possibility of programming its automatic start and stop.  It must be borne in mind that this type of application on many occasions <strong>consume high bandwidth<\/strong> of our connection.  Therefore, on certain occasions we will be interested in uploading and downloading content here at times when we do not use the PC.  a good time to <strong>use these clients to their maximum performance<\/strong> it&#8217;s for the night.<\/p>\n<p>In case you are wondering about this programming function, we will tell you that this specific client does allow us to carry it out.  This will allow us to leave the bandwidth free when we are using the computer, and let Transmission make use of all of it when we finish working.  For all this, the first thing we do is put the client into operation in a conventional way.  Once on the screen we go to the menu option <strong>Edit \/ Preferences<\/strong>.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>The window that appears we are going to find different tabs, but in the case at hand we are on Speed.  It is worth mentioning that the function we are looking for programming by default <strong>we found it as deactivated<\/strong>.  Therefore, we only have to activate the feature and then <strong>specify both start-up and shutdown times<\/strong> from Transmission.  The changes will then take effect automatically and the program will only work for that predefined amount of time.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There is no doubt that one of the main objectives we seek with this type of task is fluidity in both downloading and uploading files. Keep in mind that these networks that we are talking about are generally used to work with large files. They offer us a reliability that we do not normally find [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":71,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/69"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=69"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/69\/revisions"}],"predecessor-version":[{"id":845,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/69\/revisions\/845"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/71"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=69"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=69"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=69"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}