{"id":697,"date":"2022-05-17T21:22:32","date_gmt":"2022-05-17T21:22:32","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/17\/what-you-can-do-if-you-have-a-very-high-ping-when-playing-online\/"},"modified":"2022-05-18T16:03:38","modified_gmt":"2022-05-18T16:03:38","slug":"what-you-can-do-if-you-have-a-very-high-ping-when-playing-online","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/what-you-can-do-if-you-have-a-very-high-ping-when-playing-online\/","title":{"rendered":"What you can do if you have a very high ping when playing online"},"content":{"rendered":"<p>If you have ever played an online game, you will know that it is common for the word “ping” to appear somewhere on the screen followed by a number.  It is important to note that this figure<strong> it has nothing to do with our connection speed<\/strong>, so we can have a connection of, say, 1 GB and be suffering from terrible ping.  In this article we are going to tell you more about the ping, and we are going to give you some tips so that you can keep it at optimal figures to play.<\/p>\n<h2>What is ping and why does it matter so much?<\/h2>\n<p><strong>Ping is a unit of measurement used to measure latency<\/strong>.  Simply put, latency is the time it takes for a data packet to be transmitted over the network.  Contrary to what happens with the connection, the lower this latency, the better our connection will be, since the server will take less time to send the data packets to our computer.<\/p>\n<p>This ping is measured in milliseconds (or ms), and the quality of the online game we play will largely depend on them.  Generally, <strong>a figure less than 20 ms is usually optimal<\/strong> to enjoy a good experience, although that will depend a lot on the type of video game we are playing.  Shooting games (or shooters) require latency to be as low as possible, while others such as strategy games do not need it as much.<\/p>\n<p>   <\/p>\n<p id=\"caption-attachment-1659537\" class=\"wp-caption-text\">A high ping crashes the online experience on any device.<\/p>\n<p>Having explained this, it is very easy to understand why ping is so important.  If we lose that immediacy when doing an action within the video game, <strong>we could lose a huge advantage<\/strong> relative to the rest of the players.<\/p>\n<h2>Tips to reduce ping<\/h2>\n<p>Reducing the ping is not something as simple as pressing a button, but there are some things we can do to prevent it from rising to figures that make video games unplayable.  Some of the tips that we give you in this list may seem very simple, but they are very effective:<\/p>\n<p>Most video games today allow us to choose the server where we want to play.  This is very interesting, since the further away the server is from our location, the higher the latency in all cases. <strong>We recommend that you always try to play on European servers<\/strong>, and if there are several, the one that is closest to our country.  Servers with more input demand also tend to cause higher latency.<\/p>\n<ul>\n<li><strong>Connect your computer by network cable<\/strong><\/li>\n<\/ul>\n<p>More and more people are choosing to connect their equipment via WiFi 100% of the time.  This solution is always much more comfortable and avoids us having to run a cable throughout our house.  However, this type of connection <strong>is always more unstable than wired<\/strong>so we will suffer a higher ping.<\/p>\n<p>As far as possible, we recommend that you connect your console or your computer via cable to the router.  In the event that it is impossible due to distribution, <strong>there are some alternative options<\/strong> to improve the quality of WiFi such as mesh networks or amplifiers that can make the signal much more stable and powerful.<\/p>\n<ul>\n<li><strong>Close other applications<\/strong><\/li>\n<\/ul>\n<p>All applications (including video games) consume bandwidth.  It is very important that when we play online we try to keep the rest of the applications closed, even if they are in the background.  This is usually a good way to drastically reduce our ping. <strong>Be especially careful with streaming applications<\/strong>.<\/p>\n<ul>\n<li><strong>Turn off equipment that you are not using<\/strong><\/li>\n<\/ul>\n<p>Following the previous advice a bit, we cannot forget that any computer that we have connected to the network is also consuming bandwidth.  If playing online we suffer from a high ping we should consider <strong>turn off other devices or consoles<\/strong> that we are connected to the same network.<\/p>\n<ul>\n<li><strong>Avoid any VPN to play<\/strong><\/li>\n<\/ul>\n<p>VPNs have gained a lot of importance in recent years, thanks above all to the fact that they allow us to maintain a greater degree of privacy, since they allow us to access services that we may not have available in our territory.  However, a VPN can be very harmful when gaming, as they drastically reduce browsing speed, and also greatly increase latency. <strong>This also applies to proxies<\/strong>.<\/p>\n<p>We always recommend that you have your equipment<strong> as up to date as possible<\/strong> for security reasons, but it can also help you improve your ping.  We are not only talking about computers, but also about consoles, routers or even mesh devices in case you have them.<\/p>\n<ul>\n<li><strong>Consider switching to a gaming router<\/strong><\/li>\n<\/ul>\n<p>As a last solution you can consider changing your router.  In the market <strong>there are some gaming options<\/strong> that are specifically designed to take better advantage of our connections, and thus have a lower ping when playing.  These devices, in addition, usually have a significant improvement when it comes to boosting our WiFi signal, so getting one can be more interesting than opting for an amplifier, for example.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you have ever played an online game, you will know that it is common for the word “ping” to appear somewhere on the screen followed by a number. It is important to note that this figure it has nothing to do with our connection speed, so we can have a connection of, say, 1 [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":699,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/697"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=697"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/697\/revisions"}],"predecessor-version":[{"id":976,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/697\/revisions\/976"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/699"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=697"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=697"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=697"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}