{"id":715,"date":"2022-05-17T23:38:38","date_gmt":"2022-05-17T23:38:38","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/17\/take-it-at-its-minimum-price\/"},"modified":"2022-05-18T16:04:33","modified_gmt":"2022-05-18T16:04:33","slug":"take-it-at-its-minimum-price","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/take-it-at-its-minimum-price\/","title":{"rendered":"Take it at its minimum price"},"content":{"rendered":"<p>When a person decides to buy an iPhone, it is very rare that in the future he abandons Apple products.  The Californian company&#8217;s smartphones are unique, and they offer a quality that is difficult to find elsewhere.  From time to time some of their products appear with a juicy discount, and, precisely, <strong>Today one of the most attractive has appeared<\/strong>.<\/p>\n<p>If you were looking for the right time to change your old iPhone, or you just want to get one of them, Amazon has made the 256 GB iPhone 12 Mini available to us at its lowest historical price.  We are talking about <strong>a 20% discount<\/strong>something that we do not usually see every day.<\/p>\n<h2>iPhone 12 Mini: small but powerful<\/h2>\n<p>The current trend in the smartphone market is to launch more and more products with the largest screen, but not all consumers like to have a huge mobile to put in their pockets.  For all those, the iPhone 12 Mini is a great option, since we are really facing a very powerful phone, but it has <strong>a screen that has a more “moderate” diagonal<\/strong>.<\/p>\n<p>The screen of this iPhone is exactly the same as that of its older brother, although with a reduced size.  This assures us that <strong>its 5.4 inches<\/strong> They are going to show us the great image quality with which Apple devices have accustomed us.  This Super Retina display features <strong>a FullHD+ resolution<\/strong> (2340 x 1080) and has a pretty good brightness, especially when watching HDR content.<\/p>\n<p><\/p>\n<p id=\"caption-attachment-1659147\" class=\"wp-caption-text\">A compact design but full of possibilities.<\/p>\n<p>As we say, the iPhone 12 is a small terminal, although inside it has power to spare.  This Apple smartphone <strong>mounts the A14 Bionic chip<\/strong> and it has <strong>4GB RAM<\/strong>, more than enough for any use that we want to give the phone, even the most intense.  This particular variant that is on sale is the one with <strong>256GB of storage<\/strong>, so it will be difficult for you to run out of space to save your photos or your applications.  Besides,<strong> is 5G<\/strong>which ensures very high download speeds.<\/p>\n<h2>A great camera and good autonomy<\/h2>\n<p>Another point to keep in mind with this iPhone 12 Mini is its camera.  Small phones generally have to reduce the size of their sensors, but that is not the case with this Apple terminal, which mounts exactly the same camera as the iPhone 12. The rear camera has a configuration of two 12 Mp modules, and It has the great advantage that it is <strong>capable of recording video in HDR<\/strong>.  The front camera is also not far behind, and it also has 12 Mp with an f \/ 2.2 aperture.<\/p>\n<p>Finally, it is worth mentioning that its battery is somewhat smaller than that of its brother, although it offers us a very good autonomy.  With a full charge we can be <strong>a whole day without charging our device<\/strong>and it is also <strong>18W fast charge compatible<\/strong> (compatible charger sold separately).  This iPhone model has a regular price of 859 euros, but thanks to this offer you can take it home right now <strong>for only 690 euros<\/strong>.<\/p>\n<p>The articles listed contain an affiliate link that reports to ADSLZone a small commission for each purchase.  The products that appear here have been chosen by the editors for being discounted, and their appearance here has nothing to do with any agreement with the brands.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When a person decides to buy an iPhone, it is very rare that in the future he abandons Apple products. The Californian company&#8217;s smartphones are unique, and they offer a quality that is difficult to find elsewhere. From time to time some of their products appear with a juicy discount, and, precisely, Today one of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":717,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/715"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=715"}],"version-history":[{"count":2,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/715\/revisions"}],"predecessor-version":[{"id":993,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/715\/revisions\/993"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/717"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=715"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=715"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=715"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}