{"id":718,"date":"2022-05-18T00:10:55","date_gmt":"2022-05-18T00:10:55","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/18\/what-you-need-and-how-to-install-and-activate-it-on-your-mobile-and-computer\/"},"modified":"2022-05-18T16:04:24","modified_gmt":"2022-05-18T16:04:24","slug":"what-you-need-and-how-to-install-and-activate-it-on-your-mobile-and-computer","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/what-you-need-and-how-to-install-and-activate-it-on-your-mobile-and-computer\/","title":{"rendered":"What you need and how to install and activate it on your mobile and computer"},"content":{"rendered":"<p>we will explain <strong>how to install and activate whatsapp<\/strong> on your mobile or your computer.  WhatsApp is still one of the most important messaging applications in the world, and for many people it is a way to communicate with their loved ones.  But not all users understand technology and know how to use it, so we are going to use this little guide to help them.<\/p>\n<p>We are going to start the article by telling you what you are going to need to install and use WhatsApp on your mobile and computer, since in some cases, such as the computer, you are going to depend on the mobile.  We will then go on to tell you about the installation and login process on each type of device.<\/p>\n<h2>What do you need to install WhatsApp<\/h2>\n<p>You will be able to install WhatsApp <strong>on any smartphone and on any PC<\/strong>, since it has mobile and desktop applications.  Nevertheless, <strong>to be able to use it the needs are different<\/strong> for now, since everything is simpler on the mobile, while on the PC you will need the support of the mobile.<\/p>\n<p><strong>If you want to use WhatsApp on your mobile<\/strong>, you will only need to have created an account and download the application.  To create the account, <strong>the only requirement is to have a phone number<\/strong>, since your WhatsApp account will be directly linked to that phone number.  It will not be linked to a name or an email, what will identify your account is the phone number.<\/p>\n<p><strong>If you want to use WhatsApp on PC<\/strong>, first you will need to have it activated on your mobile.  Then, once you have it activated, you can link your account to the computer to be able to use it from there.  It is a kind of remote control, although you can also use WhatsApp while the mobile is off.  You depend on WhatsApp for mobile, but not constantly.<\/p>\n<h2>How to use WhatsApp on your mobile<\/h2>\n<p><\/p>\n<p><strong>To use WhatsApp on your mobile<\/strong>, you have to download its official application on your mobile.  If you have Android, you can download its official APK directly from the official website, or install it through Google Play, which is the official application store.  On an iPhone, you&#8217;ll need to download it directly through the App Store.<\/p>\n<p><img class=\"sf-lazy centro_sinmarco\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652832653_867_what-you-need-and-how-to-install-and-activate-it.jpg\" alt=\"Accept and Continue\"><\/p>\n<p>When you open the application, the first thing you will see will be a screen where you have a link to the privacy policies and the terms of service.  You can read them, but if you want to use WhatsApp you will have to <strong>Click on the Accept button and continue<\/strong>.  Our captures are from Android, but on iOS it is the same.<\/p>\n<p><img class=\"sf-lazy centro_sinmarco\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652832653_302_what-you-need-and-how-to-install-and-activate-it.jpg\" alt=\"Write your number\"><\/p>\n<p>You will then be taken to a screen where <strong>you have to write your phone number<\/strong>.  You have to do it by first adding the international code of your country.  If you know it you can write it, and if you don&#8217;t know it, you can choose your country above.  Then, write your phone number and click on the Next button.<\/p>\n<p><img class=\"sf-lazy centro_sinmarco\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652832654_620_what-you-need-and-how-to-install-and-activate-it.jpg\" alt=\"Code\"><\/p>\n<p>After typing in your phone number, you will go to a verification screen. <strong>WhatsApp will send you an SMS with a code that you have to write on this screen<\/strong>and when you do, you will access your WhatsApp account. <strong>And if you don&#8217;t have an account you will see the process to create it<\/strong>which is quite simple and you only have to do it once.<\/p>\n<p><img src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652832654_29_what-you-need-and-how-to-install-and-activate-it.jpg\" alt=\"WhatsApp in invisible mode: how to hide yourself from everyone or just some people\"><\/p>\n<h2>How to use WhatsApp on PC<\/h2>\n<p><img class=\"sf-lazy centro_sinmarco\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652832654_484_what-you-need-and-how-to-install-and-activate-it.jpg\" alt=\"Whatsapp Pc\"><\/p>\n<p><strong>To install and use WhatsApp on your PC<\/strong> you have several options.  From the Whatsapp.com\/download website you will be able to find the link to download it to your operating system.  You also have the application available for download from the Windows Microsoft Store, and from the macOS App Store.<\/p>\n<p><img class=\"sf-lazy centro_sinmarco\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652832655_931_what-you-need-and-how-to-install-and-activate-it.jpg\" alt=\"Whatsapp QR\"><\/p>\n<p>When you install the app by one method or another, opening the app will always bring you to the same screen.  It is the same screen with a QR code, and <strong>you will have to point to this QR code with the WhatsApp of your mobile<\/strong> to establish the link between the mobile and the computer, and thus be able to see the mobile conversations in Windows.<\/p>\n<p><img class=\"sf-lazy centro_sinmarco\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652832655_828_what-you-need-and-how-to-install-and-activate-it.jpg\" alt=\"Link\"><\/p>\n<p>So now you have to <strong>enter the Linked Devices option of WhatsApp on your mobile<\/strong>.  You will find it in the application settings.  Inside, <strong>click on the Link a device button<\/strong> that will appear, and that is when the camera will open and you have to point to the QR code.<\/p>\n<p><img src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652832655_488_what-you-need-and-how-to-install-and-activate-it.jpg\" alt=\"How to use WhatsApp on two mobiles at the same time with its web version\"><\/p>\n<p>And that&#8217;s it, from now on you can <strong>use whatsapp on pc<\/strong>, although you will always need to have the mobile where you have the app installed nearby and on the same network as the computer.  Besides, <strong>there is another option for other computers or even tablets and mobiles<\/strong> to use WhatsApp, and it is that of WhatsApp Web, whose address is web.whatsapp.com.  The process to log in here is exactly the same.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>we will explain how to install and activate whatsapp on your mobile or your computer. WhatsApp is still one of the most important messaging applications in the world, and for many people it is a way to communicate with their loved ones. But not all users understand technology and know how to use it, so [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":728,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/718"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=718"}],"version-history":[{"count":2,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/718\/revisions"}],"predecessor-version":[{"id":992,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/718\/revisions\/992"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/728"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=718"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=718"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=718"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}