{"id":729,"date":"2022-05-18T02:43:48","date_gmt":"2022-05-18T02:43:48","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/18\/give-photos-a-comic-effect-in-photoshop\/"},"modified":"2022-05-18T16:04:16","modified_gmt":"2022-05-18T16:04:16","slug":"give-photos-a-comic-effect-in-photoshop","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/give-photos-a-comic-effect-in-photoshop\/","title":{"rendered":"Give photos a comic effect in photoshop"},"content":{"rendered":"<p>For some time now, programs focused on photo editing have come a long way.  This allows us to achieve spectacular final results on our images, even without having much experience in these matters.  A clear example of this can be found with the powerful <strong>software offered by Adobe<\/strong> with your Photoshop.<\/p>\n<p>These photo editors that we are talking about allow us to carry out work and actions on these files that seemed impossible years ago.  To a large extent, this is something that we achieve thanks to the predefined functions that these applications offer us.  Little by little the <strong>artificial intelligence or AI<\/strong> to these software sectors by automating once very complex tasks.<\/p>\n<p>In this way, what those who are starting out in these types of jobs achieve are <strong>near-professional results when working with your images<\/strong> personal.  Obviously, for this we need editors that are powerful and complete enough to offer us the latest in software technology.  There is no need to present one of the best known and most used solutions of this type in the world, <strong>photoshop<\/strong>.  Serve as a clear example of all this that we are commenting on, the comic effect that we are going to learn to apply now.<\/p>\n<p>This is an effect that we can apply to any own image that we load in the program in a simpler way than we might think.  That is why we are going to show you the steps you must take to <strong>achieve this comic effect on any photo<\/strong>.  At the same time once you have achieved this, next, we will also show you how to make that new graphic content in the form of a comic become a black and white image.<\/p>\n<h2>Turn any image into a comic from Photoshop<\/h2>\n<p>The first thing we must do to achieve that graphic objective that we mentioned is to open the Adobe program in a conventional way.  Then we will have to reach out and load the photo with which we want to work in the application and open it so that it appears on the screen.  It is true that we can <strong>make that picture into a comic<\/strong> carrying out various movements and tasks at a professional level in this program.  But most users don&#8217;t want to get too complicated to achieve the same goal in a matter of seconds.<\/p>\n<p>This is precisely what we are going to show you next, so once we have loaded the image, we go to the option <strong>Filter menu \/ Filter Gallery<\/strong>.  We find this in the main Photoshop interface, which gives us a list of these elements.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>Among the alternatives that appear, we display the call <strong>Artistic<\/strong>, where we will see the samples of this particular section.  Well, to achieve the comic effect that we are looking for at this moment, we only have to click on the filter <strong>Added borders<\/strong>.  At that time we will see how the <strong>image that we have loaded becomes a comic<\/strong>, which is what we are looking for.  With everything and with it we always have the possibility of accentuating this effect more or less through the scroll bars that we find to the right of the sample.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-747168\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652841828_474_give-photos-a-comic-effect-in-photoshop.jpg\" alt=\"photoshop comics\" width=\"1000\" height=\"608\"><\/p>\n<p>Once we have achieved what we are telling you about, the <strong>comic effect<\/strong>, additionally we have the possibility of converting that new image into black and white in Adobe Photoshop.  To do this we just have to go to the menu option Image \/ Adjustments \/ Desaturate.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter size-full wp-image-747171\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652841828_776_give-photos-a-comic-effect-in-photoshop.jpg\" alt=\"comic photoshop black\" width=\"947\" height=\"595\"><\/p>\n","protected":false},"excerpt":{"rendered":"<p>For some time now, programs focused on photo editing have come a long way. This allows us to achieve spectacular final results on our images, even without having much experience in these matters. A clear example of this can be found with the powerful software offered by Adobe with your Photoshop. These photo editors that [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":733,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/729"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=729"}],"version-history":[{"count":2,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/729\/revisions"}],"predecessor-version":[{"id":991,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/729\/revisions\/991"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/733"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=729"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=729"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=729"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}