{"id":748,"date":"2022-05-18T06:30:58","date_gmt":"2022-05-18T06:30:58","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/18\/fotosizer-program-to-change-the-size-of-photos\/"},"modified":"2022-05-18T16:08:17","modified_gmt":"2022-05-18T16:08:17","slug":"fotosizer-program-to-change-the-size-of-photos","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/fotosizer-program-to-change-the-size-of-photos\/","title":{"rendered":"Fotosizer, program to change the size of photos"},"content":{"rendered":"<ul>\n<li>Resize photos based on a percentage.<\/li>\n<li>It is possible to choose a custom height and width.<\/li>\n<li>Maintains ratio.<\/li>\n<li>Allows you to apply effects (black and white, sepia or negative).<\/li>\n<li>We can rotate the photographs.<\/li>\n<li>Allows you to choose the output format including TIFF, PNG, GIF, JPEG and BMP.<\/li>\n<\/ul>\n<p>In case we want to opt for <strong>a greater number of features<\/strong>we must opt ​​for the professional version which includes the functions of the free version along with these additional ones:<\/p>\n<ul>\n<li>Advanced batch resizing, rotation and destination features.<\/li>\n<li>Allows you to apply text and image watermarks to photos, apply color adjustments to photos (brightness, contrast, hue, saturation, gamma, highlights, shadows, intensity and temperature).<\/li>\n<li>Applies rounded corners to photos.<\/li>\n<li>Ability to apply completion actions, such as deleting original photos or moving original photos to another folder.<\/li>\n<li>Resized photo output to a compressed ZIP file.<\/li>\n<\/ul>\n<p>In the event that we see that we are going to be able to take advantage of and use these options, we will surely be interested in paying for your license for life.<\/p>\n<h2>Resize your photos in batches with Fotosizer<\/h2>\n<p>Once we run Fotosizer we check that it contains a <strong>clean and intuitive design<\/strong> where we can import photos using its navigation button or drag and drop support. In addition, it is possible to add the content of a complete folder and delete all the elements that we have selected.<\/p>\n<p>The program allows us to create a list of elements that we want to process in batches and switch between different view modes (Preview Panel, Details and Thumbnails, as well as choose the columns that are revealed in the main window such as size, creation date, camera, ISO speed, copyright, aperture, copyright, among others.<\/p>\n<p>Once we have added the photographs, on the right side we find a column with the different options that we can carry out on them.<\/p>\n<h3>Configure resizing<\/h3>\n<p>From this section we will be able to <strong>make the necessary adjustments<\/strong> for resizing these images. Here we find the possibility to Fit, Stretch, Border, Fill with and Crop. We will also be able to select the custom size for Width and Height, either in pixels, percentages, centimeters, millimeters or inches.<\/p>\n<p>We also have the Preset size option, with different default size settings such as the screen size of different devices such as PSP, iPhone, iPod or different Android mobiles. Of course, it must be said that the models that appear are quite old and most of them are already in disuse or obsolete, so they will not be very useful either.<\/p>\n<h3>effects<\/h3>\n<p>The next section will give us the possibility of giving our photos different effects. In total they are <strong>15 effects available<\/strong> in the free version such as Black and White, Negative, Sepia, Spine, Pixelate, Vignette, Monochrome, Polaroid, Old Photo, Soft Color, Vibrant Color, Gotham, Cool, Warm and Dark. Perhaps in this section we miss the possibility of seeing a preview of how the final result looks.<\/p>\n<h3>Rotation, Miscellaneous and Destination Settings<\/h3>\n<p>Next, we go to the “Rotation” section, from where we can make adjustments to <strong>rotate images<\/strong> 90 degrees counterclockwise, 90 degrees clockwise, and 180 degrees. We can also rotate the photos horizontally or vertically.<\/p>\n<p>Right after we find the “Various” section, from where we will be able to modify the image quality, change the print resolution and apply image optimization. We can also copy the EXIF ​​(JPEG) information from the metadata of the images, as well as keep the creation date of the original file and save the modified file the original date.<\/p>\n<p>Finally, and once the desired settings have been made, we can carry out destination configuration tasks, since we can select the folder where we want the resulting files to be saved, select the format and with respect to the names, create copies, make them equal to the original or customize them.<\/p>\n<h2>Download Photosizer<\/h2>\n<p>If we want to use Fotosizer we can download its free version from its official website. We will also be able to buy your <strong>professional version<\/strong>which has a cost of<strong> 16.15 euros<\/strong>. Also, if we want to try this professional version before buying it, we can download a trial version, and in this way check all its functions first-hand and really see if we deserve your purchase or keep its free version.<\/p>\n<p>Both versions have Spanish as the language that we can select during the installation that is carried out in a simple way through its assistant. It barely occupies 11.07 MB, so we won&#8217;t have space problems on our hard drive. In addition, during its installation it does not try to install unwanted third-party programs, which is always appreciated.<\/p>\n<p>The program is compatible with different versions of the Microsoft operating system, from Windows XP to Windows 11.<\/p>\n<h2>Alternatives to Batch Convert Photos<\/h2>\n<p>If we are looking for a program to convert images in batches, we can also consider these alternatives to Fotosizer:<\/p>\n<h3>rEASYze<\/h3>\n<p>This batch image conversion tool will allow us to establish the desired parameters of width and height, either by pixel or by percentage, maintaining the proportions of the image at all times. With it we can resize, rotate, add watermarks, add filters, color settings and save as JPG, PNG, BMP, TIF, GIF, etc, all for free. We can download rEASYze from the developer&#8217;s website.<\/p>\n<h3>XnConvert<\/h3>\n<p>This batch image conversion app is cross-platform, fast, powerful, and free. We will be able to rotate, convert and compress a large number of images at the same time, as well as apply more than 80 different actions (crop, add filters, make color adjustments, change the size, etc.) In addition, it supports more than 500 different image formats and common graphics, among which are JPEG, TIFF, PNG, GIF, etc., all of this being a free program. We can download its latest version from its website.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Resize photos based on a percentage. It is possible to choose a custom height and width. Maintains ratio. Allows you to apply effects (black and white, sepia or negative). We can rotate the photographs. Allows you to choose the output format including TIFF, PNG, GIF, JPEG and BMP. In case we want to opt for [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":753,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/748"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=748"}],"version-history":[{"count":2,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/748\/revisions"}],"predecessor-version":[{"id":1010,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/748\/revisions\/1010"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/753"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=748"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=748"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=748"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}