{"id":754,"date":"2022-05-18T08:14:57","date_gmt":"2022-05-18T08:14:57","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/18\/how-are-the-new-mirrors-with-camera-that-the-dgt-recommends\/"},"modified":"2022-05-18T16:06:01","modified_gmt":"2022-05-18T16:06:01","slug":"how-are-the-new-mirrors-with-camera-that-the-dgt-recommends","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/how-are-the-new-mirrors-with-camera-that-the-dgt-recommends\/","title":{"rendered":"How are the new mirrors with camera that the DGT recommends?"},"content":{"rendered":"<p>Putting the focus and attention on safety, the DGT has now opted for new mirrors for our car in order to update them.  In fact, it is no longer just that the road agency recommends them, but that they even want to make them fixed for <strong>replace the classics<\/strong> lifelong.  But what are they and how do they work?  What&#8217;s so special about them?<\/p>\n<h2>The DGT wants to replace the classic mirrors<\/h2>\n<p>In the direction of the new mandatory driving assistants -known as ADAS-, starting next July of this 2022, the DGT advances steps in a <strong>modernization and upgrade<\/strong> of vehicles on our streets.  One of them has to do with the new mirrors that the road agency wants to make fixed.<\/p>\n<p>In fact, what he is looking for with them is to replace the usual classics and avoid fines of up to 200 euros.  And it is that there are already several brands that are opting for similar systems and that, despite the fact that they are not yet perfect, <strong>provide certain advantages<\/strong> in front of a conventional mirror.  Thus, the General Directorate of Traffic is considering making it mandatory for cars in the not too distant future.<\/p>\n<p>As such, the presence of the rear-view mirror is mandatory for driving and, although legally only the one located on the driver&#8217;s door and the interior is necessary, it is difficult to understand a current car without this type of element.  Thus, now they seek to incorporate a device of <strong>high technology<\/strong> to prevent drivers from losing sight in blind spots.<\/p>\n<h2>They are high-tech and expand the field of vision<\/h2>\n<p>The <strong>blind spots<\/strong> they are greater the larger the vehicle and the worse adjusted the mirrors are with respect to the position of the person driving it.  They are one of the biggest enemies when it comes to driving, since vision does not cover all directions and therefore poses a serious risk at the wheel.  But with this new system it will not happen;  in reality, they function as a kind of smart digital mirrors.<\/p>\n<p>Given this, it is a matter of replacing the traditional mirror systems with the <strong>Man Optiview<\/strong>, from the firm of trucks that use them as much as they do with buses, and that expands the field of vision of drivers and thus facilitates visibility during maneuvers that require maximum attention.  Some rear-view mirrors that are recommended by the DGT and that are made up of several exterior, focus and wide-angle cameras.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>Its operation is what is responsible for <strong>reproduce all there is<\/strong> in the environment of our car from a screen located inside the vehicle, either on the door itself or installed on the pillar.  In any case, if we have cars like the Honda-e (here its technical sheet), Audi, Tesla or Lexus, you may no longer have to make changes, but the other cars will have to be replaced by this type of device.<\/p>\n<h3>They allow to see what the traditional ones do not<\/h3>\n<p>As we say, this system allows us to offer a <strong>more accurate information<\/strong> of the perimeter, as well as avoiding the dangerous blind spots that we have with the rear-view mirrors.  Also, they have functions to repel rain or mist, but they offer certain drawbacks in the same way.<\/p>\n<p>Already locating themselves in the trucks, their <strong>cameras can be folded<\/strong>, they are waterproof, filter glare and heat up automatically.  It is true that there are already these types of devices on the market, but it is also true that not all of them are as recommendable as these DGT mirrors.<\/p>\n<p>In fact, one of its best features is that on the driver&#8217;s side there is a 12-inch screen with HD quality and a resolution of 1920 x 1080 pixels, which can show auxiliary lines to better assess the distance and length of the vehicle.  In addition, it is capable of adjusting the brightness and contrast automatically based on the surrounding lighting, offering <strong>three different views <\/strong>zoom, as well as detect distant objects in advance.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Putting the focus and attention on safety, the DGT has now opted for new mirrors for our car in order to update them. In fact, it is no longer just that the road agency recommends them, but that they even want to make them fixed for replace the classics lifelong. But what are they and [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":756,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/754"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=754"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/754\/revisions"}],"predecessor-version":[{"id":830,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/754\/revisions\/830"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/756"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=754"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=754"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=754"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}