{"id":770,"date":"2022-05-18T10:49:26","date_gmt":"2022-05-18T10:49:26","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/18\/you-can-now-try-the-new-kodi-20\/"},"modified":"2022-05-18T16:07:49","modified_gmt":"2022-05-18T16:07:49","slug":"you-can-now-try-the-new-kodi-20","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/you-can-now-try-the-new-kodi-20\/","title":{"rendered":"You can now try the new Kodi 20"},"content":{"rendered":"<p>If there is a program that stands out above the rest when we talk about setting up our own multimedia center, that is <strong>Kodi.<\/strong> This software, which began as a project to turn the original Xbox into a multimedia center (under the name of XBMC, or Xbox Media Center) has become a (controversial) platform to play what we want where we want.  19 years after its launch, its developers have just announced the arrival of version 20 of the program.  And all this is what we will find in it.<\/p>\n<p>Before starting to see all the new features of this version, remember that, as always, before reaching all users as a stable update, the program will go through several versions <strong>(Alpha, Beta,<\/strong> <strong>Release Candidate<\/strong>) in which, in addition to gradually including new features and improvements, Kodi errors will also be debugged.<\/p>\n<p>Today the first «Alpha» of the program has been released.  And, thanks to it, we can know what are the first novelties that we are going to find in <strong>«Nexus».<\/strong><\/p>\n<h2>What&#8217;s new in Kodi 20<\/h2>\n<p>Given the <strong>Kodi 20<\/strong> it&#8217;s a big update, with new numbering, expect big changes to the media center.  Although we can still see some improvements and news in the future that have not yet been revealed, the first important changes that we will find in this program are the following:<\/p>\n<ul>\n<li>Video: Improved AV1 hardware decoding on Android and Linux and jump to FFMPEG 4.4.<\/li>\n<li>Subtitles: new customization options for them and improved compatibility with certain formats.<\/li>\n<li>Discs: Fixed various bugs and issues with DVD and Blu-Ray playback.<\/li>\n<li>Interface: Various minor fixes to the system interface.  Improvements are also included in the integration with the skins that we select, especially when it comes to showing more information about the content.<\/li>\n<li>Input: Steam Deck controller support.<\/li>\n<li>Estuary PVR: new widget and new bars to see current programming.<\/li>\n<li>Games: Save states for Retroplayer games and ease of switching controllers.<\/li>\n<li>Windows: Use of 10-bit color in SDR videos and improved DXVA2 hardware decoding.<\/li>\n<li>Date and Time: Changes to date and time systems when using std::chrono.<\/li>\n<li>All build dependencies have been updated.<\/li>\n<\/ul>\n<p>Of course, this is a summary of the news and changes that, for the moment, have been implemented in the new Kodi 20. Although there are many more.  We can see the list of changes from the latest version of Kodi 19 to this new version of <strong>Kodi 20 “Nexus”<\/strong> from the following link to its GitHub repository.<\/p>\n<h2>How to test the new version<\/h2>\n<p>Although there is still a lot of work ahead, if we want to test the new version of this popular open source program, we will be able to do so easily.  What we must do is access this link, choose the operating system where we are going to install the program, select the tab <strong>«Prerelease»,<\/strong> and, finally, select the type of download we want.<\/p>\n<p>We remind you that this is a development version that may have serious problems.  Therefore, we do not recommend its daily use other than to test the latest developments that are being worked on and help, if we want, with the development and debugging of the program.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If there is a program that stands out above the rest when we talk about setting up our own multimedia center, that is Kodi. This software, which began as a project to turn the original Xbox into a multimedia center (under the name of XBMC, or Xbox Media Center) has become a (controversial) platform to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":771,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/770"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=770"}],"version-history":[{"count":2,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/770\/revisions"}],"predecessor-version":[{"id":1008,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/770\/revisions\/1008"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/771"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=770"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=770"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=770"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}