{"id":772,"date":"2022-05-18T11:25:15","date_gmt":"2022-05-18T11:25:15","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/18\/the-latest-o2-novelty-that-avoids-scares-on-your-bill\/"},"modified":"2022-05-18T16:06:01","modified_gmt":"2022-05-18T16:06:01","slug":"the-latest-o2-novelty-that-avoids-scares-on-your-bill","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/the-latest-o2-novelty-that-avoids-scares-on-your-bill\/","title":{"rendered":"The latest O2 novelty that avoids scares on your bill"},"content":{"rendered":"<p>Today there are many telephone rates that we can contract with almost any company that include unlimited calls.  This is obviously fantastic, since it allows us to be able to use our phones without having to continually check the number of minutes we have spent.  However, it can also generate <strong>a false sense of security<\/strong> when calling certain numbers, something that could cause us to have a scare when the bill arrives. <\/p>\n<p>As you probably know, in our country there are a series of telephone numbers called special rates.  These are really dangerous, since they have a price per minute that can become disproportionate depending on the case.  The O2 company is aware of this risk, and that is why it gives all its customers <strong>a simple and practical tool<\/strong> to prevent these numbers from taking their toll (pun intended).<\/p>\n<h2>Limit access to special billing services<\/h2>\n<p>This operator owned by Movistar has been informing all its users via email of the existence of this tool.  Thanks to it, any user who wishes will be able to block calls and SMS to this type of number <strong>via the Mi O2 app<\/strong>.  The process is really simple, and we can carry it out in a matter of a couple of minutes, and can even limit access only to a specific number in case we use the others.<\/p>\n<p>For it, <strong>we will only have to follow the following steps<\/strong>:<\/p>\n<ul>\n<li>Access the Mi O2 app<\/li>\n<li>Go to the “Management” section.  It is the nut-shaped icon that we can find in the lower right.<\/li>\n<li>Choose the line where you want to block a number with special rates\n<ul>\n<li>This is especially useful if we have several numbers and we want to limit access, for example, to a minor<\/li>\n<\/ul>\n<\/li>\n<li>Click on “Configure line” and then on “<strong>Block special numbers<\/strong>«<\/li>\n<\/ul>\n<p>Once we have reached this screen we will have in front of us a selector like the one you can see in the following image.  In this way, we will have the possibility to separately restrict access to 118X numbers, 905 and 80X numbers, adult premium SMS and subscriptions, and the rest of premium SMS.  The company also reports that it is possible <strong>call the number 1551<\/strong> to make this block or to check if we have it active.<\/p>\n<p> <\/p>\n<p id=\"caption-attachment-1657632\" class=\"wp-caption-text\">Block special numbering in the app (O2)<\/p>\n<h2>Some really dangerous numbers<\/h2>\n<p>These numbers are nothing new at all, and although they are totally legal, it is always important to keep access to them as limited as possible.  However, O2 is informing its customers that lately they are being observed <strong>many scams related to them<\/strong>:<\/p>\n<blockquote>\n<p>The problem is that, although sometimes calls are made to these numbers knowing that they have an extra cost, there are other times that said cost is not being reported fraudulently, or it is not done clearly.  Even when calling apparently free numbers such as national landlines or 900 numbers, you are redirected from the call itself to these numbers, being very non-transparent and with the sole purpose that the customer makes the call to enter the cost of it.<\/p>\n<\/blockquote>\n<p>It should be remembered, as O2 itself does, that calls to numbers <strong>that start with 800 or 900 are totally free<\/strong>, hence we cannot block them in any way.  If you have any questions about this procedure or any other related to your rate, we recommend that you contact their customer service.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Today there are many telephone rates that we can contract with almost any company that include unlimited calls. This is obviously fantastic, since it allows us to be able to use our phones without having to continually check the number of minutes we have spent. However, it can also generate a false sense of security [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":774,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/772"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=772"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/772\/revisions"}],"predecessor-version":[{"id":825,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/772\/revisions\/825"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/774"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=772"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=772"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=772"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}