{"id":775,"date":"2022-05-18T12:04:47","date_gmt":"2022-05-18T12:04:47","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/18\/delete-one-or-more-partitions-from-our-hard-drive-in-windows\/"},"modified":"2022-05-18T16:06:01","modified_gmt":"2022-05-18T16:06:01","slug":"delete-one-or-more-partitions-from-our-hard-drive-in-windows","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/delete-one-or-more-partitions-from-our-hard-drive-in-windows\/","title":{"rendered":"Delete one or more partitions from our hard drive in Windows"},"content":{"rendered":"<p>In order to delete a partition from our disk, both in Windows 10 and in Windows 11 we will have several of our own tools in the system to be able to carry it out.  If we want to do it in a more graphic way we can use the <strong>disk manager<\/strong> system, while we can also do them from the command line through the <strong>symbol of the system<\/strong> either <strong>Windows PowerShell. <\/strong>We can also use different third-party applications specially developed for this purpose, in case we don&#8217;t like any of the options that the Microsoft operating system has by default.<\/p>\n<h2>Use Windows Partition Manager<\/h2>\n<p>Both Windows 10 and Windows 11 have an integrated tool with which we can delete partitions from both the HDD and SSD that we have on our computer.  Of course, with it we will not be able to eliminate all the partitions at the same time, since we will only be able to carry out this task individually.  This is perhaps the simplest method of all, although it has the downside that, if you want to delete system partitions, such as those reserved for recovery, Windows won&#8217;t allow it.<\/p>\n<p>To do this, the first thing to do is access the <strong>partition manager<\/strong>, for which we press the Windows + R keyboard shortcut, which is responsible for launching the Run command.  Here, we write <strong>diskmgmt.msc<\/strong> and press Enter or the OK button, which will open the Disk Management window.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>Once the main menu appears, it will show us the hard drives that we have installed.  From here we click with the right mouse button on the second hard drive or partition of the SSD and select <strong>&#8220;Delete Volume&#8221;<\/strong>.  It is important to emphasize not to select the main hard drive where the operating system is installed.<\/p>\n<p>We can repeat these steps until all partitions have been deleted from the hard drive of our computer.  Once deleted, all hard drive space will be Unallocated space, so we can create new partitions again.<\/p>\n<h2>From the Command Prompt<\/h2>\n<p>Another possibility to be able to delete partitions is to do it through the command line, by using the Command Prompt tool.  To do this, the first thing to do is use the Start menu search engine to write <strong>cmd<\/strong> and run Command Prompt with administrator rights.<\/p>\n<p>Once in the Command Prompt, we type the following command and press Enter:<\/p>\n<p> <code class=\"code-section\"> diskpart <\/code> <\/p>\n<p>Next, we write the following command to show us a list of installed hard drives and press Enter again:<\/p>\n<p> <code class=\"code-section\"> list disk <\/code> <\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-487018 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652875486_308_Delete-one-or-more-partitions-from-our-hard-drive-in.jpg\" alt=\"diskpart command\" width=\"1097\" height=\"509\"\/><\/p>\n<p>Now we are going to write this command to select the corresponding hard drive and press Enter to confirm:<\/p>\n<p> <code class=\"code-section\"> select disk 2 <\/code> <\/p>\n<p>We can change 2 for the number that we have assigned to the HDD or SSD.<\/p>\n<p>Next we are going to clean the drive, so we will type the following command and press Enter.<\/p>\n<p> <code class=\"code-section\"> clean <\/code> <\/p>\n<p>Once this action is done, all the partitions on the hard drive will be deleted, so we can re-partition it by creating new partitions with the unallocated space.<\/p>\n<h2>Using Windows PowerShell<\/h2>\n<p>If we prefer, we can also use Windows PowerShell to be able to delete partitions from our hard drive in both Windows 10 and Windows 11. To do this, we are going to use the Start menu search box to write <strong>powershell<\/strong> and run it with administrator rights.<\/p>\n<p>Once PowerShell is open, we write the following command to display a list with all the volumes or partitions, pressing Entire to confirm:<\/p>\n<p> <code class=\"code-section\"> Get-Volume <\/code> <\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-733683 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652875486_209_Delete-one-or-more-partitions-from-our-hard-drive-in.jpg\" alt=\"PowerShell Get-Volume\" width=\"900\" height=\"489\"\/><\/p>\n<p>Once this is done, we will execute the following command:<\/p>\n<p> <code class=\"code-section\"> Remove-Partition -DriveLetter <\/code> <\/p>\n<p>Here, we need to replace DriveLetter with the letter of the drive we want to delete.<\/p>\n<p>Finally, all that remains is to accept the confirmation window and the unit will automatically be removed from the selected disk so that we have its storage space.<\/p>\n<h2>Through a partition manager<\/h2>\n<p>As an alternative to the different elements and tools that we can find integrated in Windows to carry out this task, it is also possible to make use of certain third-party tools specially designed to carry out this task in a more comfortable and visually more attractive graphical way .<\/p>\n<h3>MiniTool Partition Wizard<\/h3>\n<p>We are talking about a partition manager, by means of which we are going to be able to create and eliminate all kinds of partitions on our hard drives, being compatible with a wide variety of file systems so that we can give different formats to our drives as we are interested.  It has a wide number of recovery functions for damaged disks and partitions.  We can even choose the possibility of deleting a partition by overwriting the data so that no one can recover its content.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-733674 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652875486_133_Delete-one-or-more-partitions-from-our-hard-drive-in.jpg\" alt=\"MiniTool Partition Wizard delete partition\" width=\"920\" height=\"478\"\/><\/p>\n<p>MiniTool Partition Wizard has a free version that we can download from the developer&#8217;s website.  Once downloaded and installed, we run it so that its main menu appears, where we can see a list of the hard drives and the partitions made on each one.  It would simply be enough to press the right button on the partition that we want to delete and a drop-down menu will appear where we only have to click on <strong>“Delete Partition”<\/strong>.<\/p>\n<h3><strong>Paragon Partition Manager<\/strong><\/h3>\n<p>It is a program to manage partitions.  Among the different functions that it has, we will be able to create and delete partitions, which will allow us to format our HDD, SSD, USB, memory card, SD card or delete a partition so that it is available for reuse.  This Paragon software has a free version, with limited functions, but it will help us to delete partitions.  We can download it from its official website.<\/p>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"aligncenter wp-image-733677 size-full\" src=\"https:\/\/why-what-who.com\/wp-content\/uploads\/2022\/05\/1652875487_460_Delete-one-or-more-partitions-from-our-hard-drive-in.jpg\" alt=\"Paragon Partition Manager Delete partition\" width=\"920\" height=\"481\"\/><\/p>\n<p>Once we run the application, its main menu appears with an intuitive interface, although completely in English.  It is divided into two columns.  In the one on the left we find the different functions, of which we will have access to “Disk &#038; Volumes” in this free version.  On the right side of the interface we find the different storage units that we have on our computer.<\/p>\n<p>We only have to select the desired partition and in the left column the different functions that we can carry out will appear.  As what we want is to be able to eliminate the partition, it will be enough to click on the <strong>“Delete Partition”<\/strong>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In order to delete a partition from our disk, both in Windows 10 and in Windows 11 we will have several of our own tools in the system to be able to carry it out. If we want to do it in a more graphic way we can use the disk manager system, while we [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":781,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/775"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=775"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/775\/revisions"}],"predecessor-version":[{"id":824,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/775\/revisions\/824"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/781"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=775"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=775"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=775"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}