{"id":802,"date":"2022-05-18T13:46:57","date_gmt":"2022-05-18T13:46:57","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/18\/from-web-1-0-to-the-current-metaverse\/"},"modified":"2022-05-18T16:07:30","modified_gmt":"2022-05-18T16:07:30","slug":"from-web-1-0-to-the-current-metaverse","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/from-web-1-0-to-the-current-metaverse\/","title":{"rendered":"From Web 1.0 to the current Metaverse"},"content":{"rendered":"<p>We could say that the internet has come a long way <strong>from Web 1.0 to Web 3.0<\/strong>.  in which we find ourselves immersed at the moment.  The first version focused on connecting multiple devices and getting <strong>information on the net<\/strong>.  Later, web 2.0 already allowed reading, creating and sending all kinds of content through this same channel.  This is precisely where we could say that the success and growth of the Internet as we know it today occurred.<\/p>\n<p>This is precisely where we find elements such as social networks or electronic commerce.  However, right now we are facing what could be considered a new era called the <strong>Web 3.0<\/strong> which has been talked about a lot lately.  Now elements such as artificial intelligence or <strong>machine learning technologies<\/strong>.  In this way, users will be able to interact with the network data.<\/p>\n<p>For its part, the Metaverse will combine multiple virtual spaces that provide access to a wide variety of platforms and projects, many of them focused on augmented reality.<\/p>\n<h2>The beginnings of the internet: Web 1.0 and Web 2.0<\/h2>\n<p>When we talk about the internet, we refer to a network where millions of computers are connected globally.  This allows any computer to communicate with another.  On the other hand we find the <strong>world Wide Web<\/strong>.  This is a way of accessing information over the Internet by viewing web pages in a browser.  Here the information is composed of hyperlinks, texts, graphics, audio, video, etc.  The aforementioned Web 1.0 or first <strong>web generation was developed from 1991<\/strong> where users could read and share information.  Therefore, we find ourselves with a source of information created by a small number of authors, for many users.<\/p>\n<p>We saw static web pages full of data of relative interest to connected users back then.  This gave way to <strong>Web 2.0<\/strong>, an environment in which we could already create, share and modify content, therefore, it was characterized by being more interactive.  This term was used <strong>for the first time in 1999<\/strong> and the Internet became geared towards something that actively involved the surfer.<\/p>\n<p>Basically it is the web that we know today and that has evolved since then.  Obviously, here we find both points that are very much in favor of the user, as well as others that are really against it.  As you can imagine, one of the main negative points of web 2.0 is the threats and current cybercrime.<\/p>\n<h2>Arrival of Web 3.0 and the Metaverse<\/h2>\n<p>For some time now, much has been said about the gradual arrival of the new internet, the one that <strong>called Web 3.0<\/strong>.  To say that this historical third generation of the Internet focuses on websites and applications being able to <strong>process information intelligently<\/strong>.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>It is expected that the <strong>behavior of these platforms is similar to that of humans<\/strong>, that is, in an intelligent way through technologies such as machine learning, Big Data, and much more.  Thus, now the great technological platforms are heading towards augmented reality by mixing elements of the physical and digital worlds.  Logically, they will have a lot to say here. <strong>virtual reality<\/strong>the <strong>augmented reality<\/strong>etc.<\/p>\n<p>Therefore, as we can see, new technologies have been applied to the growth of the Internet until now.  Now we could say that the <strong>merger of several of them<\/strong> Both at the software and hardware levels, they will create the new technological era called the metaverse in Web 3.0.  Nothing to do with the simplicity offered by those first pages belonging to Web 1.0.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We could say that the internet has come a long way from Web 1.0 to Web 3.0. in which we find ourselves immersed at the moment. The first version focused on connecting multiple devices and getting information on the net. Later, web 2.0 already allowed reading, creating and sending all kinds of content through this [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":804,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/802"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=802"}],"version-history":[{"count":2,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/802\/revisions"}],"predecessor-version":[{"id":1007,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/802\/revisions\/1007"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/804"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=802"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=802"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=802"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}