{"id":87,"date":"2022-05-06T20:01:35","date_gmt":"2022-05-06T20:01:35","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/06\/this-is-the-email-scam\/"},"modified":"2022-05-18T15:50:56","modified_gmt":"2022-05-18T15:50:56","slug":"this-is-the-email-scam","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/this-is-the-email-scam\/","title":{"rendered":"this is the email scam"},"content":{"rendered":"<p>Technology and all the advances that are taking place in it are wonderful, and make our lives much easier.  Unfortunately, all these developments always have an unintended &#8220;consequence&#8221;, which is the presence of hackers or cybercriminals looking to take advantage of them.  It can be very expensive for us if we come across one of them, and in fact at a business level <strong>it is common for them to try it with the so-called Business E-mail Compromise or BEC<\/strong>.<\/p>\n<p>Today, email is the main means of business communication that exists, both within the company itself and between one and the other.  It is very important to keep these email accounts sufficiently secure to avoid problems, since in fact if a cybercriminal somehow manages to get hold of his credentials, he can create all kinds of problems.  This is how the BEC works, or as it is known in Spanish, <strong>compromised corporate email<\/strong>and we will tell you below how it works.<\/p>\n<h2>A “simple” scam that is not easy to perceive<\/h2>\n<p>If we are self-employed or have a company, we will be used to continuously receiving emails from suppliers where they attach invoices to us.  It is something normal from day to day, <strong>and that is precisely why it is so dangerous<\/strong>.  Cybercriminals precisely attack the email accounts of provider companies, intercepting the data they send us and exchanging it for others controlled by them.  This is a way to impersonate them, similar in a way to phishing.<\/p>\n<p>We, as we have said a little above, are so used to this procedure, we will receive an invoice with a series of bank details to be able to pay it, and of course we will proceed to it.  The problem will be that <strong>we are paying an invoice to an account owned by the cybercriminal<\/strong>.  It is very common not to realize that we have &#8220;fallen&#8221; into this scam until the company to which we had supposedly sent the payment claims it again.<\/p>\n<p>   <\/p>\n<p id=\"caption-attachment-1623216\" class=\"wp-caption-text\">This is how the BEC works.<\/p>\n<p>The way these undesirables proceed generally tends to go two ways. <strong>The first one is to attack our own mail<\/strong>, establishing entry rules so that when an email arrives from a provider, it is forwarded to an account chosen by the cybercriminal, and it is also stored in a hidden folder so that we do not see it.  This would create an account with a domain similar to that of the provider, so we would be completely at their mercy if we do not realize it.<\/p>\n<p><strong>The other way to proceed is to attack the provider&#8217;s mail<\/strong>.  In this sense, the cybercriminal would generate an outbound rule so that the emails with invoices end up in an account created by him for the occasion.  This scam is even more difficult to detect, because the emails with &#8220;fake&#8221; invoices could come from the provider&#8217;s verified email.<\/p>\n<h2>How can we avoid this scam?<\/h2>\n<p>The National Institute of Cybersecurity gives us <strong>a series of recommendations so that we can avoid this scam<\/strong>.  It is important that we take them all into account, since most of them will also prevent us from falling into other different scams.  The tips are as follows:<\/p>\n<ul>\n<li><strong>Be very careful with your corporate email account<\/strong><\/li>\n<\/ul>\n<p>It may sound a bit obvious, but these types of accounts usually handle much more sensitive information, so it is essential that we do not use them lightly.  In this sense, what we must do is not register with this email on &#8220;strange&#8221; websites or in contests, as well as avoid using them on our social networks.<\/p>\n<p>To bring the security of our email account up to date, it is essential that we review the account settings very often, as well as keep the antimalware applications updated.  We should also consider changing the password periodically.<\/p>\n<ul>\n<li><strong>Be alert to possible fraud<\/strong><\/li>\n<\/ul>\n<p>If we are not sure of the reliability of an email, it is interesting that we go to a communication channel other than the email to ensure that the information it contains is not a scam.  We must also learn to identify suspicious emails and be very careful with links or attachments.<\/p>\n<ul>\n<li><strong>Use tools and configure protocols to detect possible scams<\/strong><\/li>\n<\/ul>\n<p>For this, we should install and monitor the traffic with IDS and IPS or UTM tools.  The Institute itself has a series of recommendations for more advanced users, although you can consult them if you want on its website.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Technology and all the advances that are taking place in it are wonderful, and make our lives much easier. Unfortunately, all these developments always have an unintended &#8220;consequence&#8221;, which is the presence of hackers or cybercriminals looking to take advantage of them. It can be very expensive for us if we come across one of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":89,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/87"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=87"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/87\/revisions"}],"predecessor-version":[{"id":842,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/87\/revisions\/842"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/89"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=87"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=87"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=87"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}