{"id":93,"date":"2022-05-07T09:16:29","date_gmt":"2022-05-07T09:16:29","guid":{"rendered":"https:\/\/why-what-who.com\/2022\/05\/07\/where-does-thunderbird-save-email-and-profile-data\/"},"modified":"2022-05-18T15:50:56","modified_gmt":"2022-05-18T15:50:56","slug":"where-does-thunderbird-save-email-and-profile-data","status":"publish","type":"post","link":"https:\/\/why-what-who.com\/where-does-thunderbird-save-email-and-profile-data\/","title":{"rendered":"Where does Thunderbird save email and profile data?"},"content":{"rendered":"<p>Over time, platforms <strong>online email<\/strong> They allow us to manage this important element on the internet, through the cloud.  A clear example of all this is found with the Google service, Gmail.  But applications that we install locally, such as Thunderbird, also continue to have enormous market penetration.<\/p>\n<p>Despite the enormous use of social networks or instant messaging applications, email is still a very used element on a daily basis.  All this is something that is extended both on a personal and business level, and that many considered it finished.  But with everything and with it the sending and receiving of <strong>email messages<\/strong> It is still very common in all kinds of environments and modes of use.  As we mentioned before, we can manage these elements both through <strong>cloud platforms<\/strong> as in local mode.<\/p>\n<p>In this specific case we are going to focus on the second modality, that is, on those programs that we install locally on our PC.  I&#8217;m sure many of you sound familiar. <strong>Outlook<\/strong>but also <strong>thunder bird<\/strong> It is a program that has been with us for years.  This second mentioned is an open source application that provides us with innumerable functions and features that are very useful for <strong>email management<\/strong>.<\/p>\n<p>In addition, it presents us with a user interface that could be considered very intuitive and that allows us to manage multiple email accounts.  For those of you who don&#8217;t know how to say that we can even add Gmail accounts to <strong>send and receive messages<\/strong> from Thunderbird itself.  The use of local programs for mail provides us with some advantages.  Keep in mind that all your configuration settings and accounts are stored on the drives.<\/p>\n<h2>Locate Thunderbird profiles and data on your PC<\/h2>\n<p>One of the main differences between both modes of use is that cloud platforms do not store our messages and accounts on the computer.  Quite the contrary, it happens with the applications that we install for these specific tasks.  And this program is like the one mentioned <strong>store lots of data<\/strong> belonging to the application itself on our drives.<\/p>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>All this will allow us to have much <strong>more control over messages, settings and user profiles<\/strong> that we use in the program.  At this point some of you may be wondering how to locate all this information that we discussed in the case of Thunderbird.  Well then, we will talk about the <strong>disk location<\/strong> where you can locate all that information if you have installed the program by default.  And it is that it is necessary to bear in mind that, in personalized installations, the locations to which we refer may vary.<\/p>\n<p>In addition, all errors and crashes that may have occurred while using the <strong>mail manager my open source<\/strong>.  Having the files and folders corresponding to each user at hand will help us, for example, when migrating from PCs and taking all this personal data with us.  To access the folder that contains all of this in our Windows system, we go to the following path:<\/p>\n<p> <code class=\"code-section\">C:\/Users\/USUARIO\/AppData\/Roaming\/Thunderbird<\/code> <\/p>\n<p>Here we find several folders related to the data that we commented on, such as user accounts or errors that have occurred.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Over time, platforms online email They allow us to manage this important element on the internet, through the cloud. A clear example of all this is found with the Google service, Gmail. But applications that we install locally, such as Thunderbird, also continue to have enormous market penetration. Despite the enormous use of social networks [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":95,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/93"}],"collection":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/comments?post=93"}],"version-history":[{"count":1,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/93\/revisions"}],"predecessor-version":[{"id":841,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/posts\/93\/revisions\/841"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media\/95"}],"wp:attachment":[{"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/media?parent=93"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/categories?post=93"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/why-what-who.com\/wp-json\/wp\/v2\/tags?post=93"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}